#pragma once
#include "Common/typedefs.h"
#include "Common/Singleton.h"
#include "PacketManager/Protodefs.h"
#include "PacketManager/C2SPackets.h"
#include "PacketManager/S2CPackets.h"
#include <map>
#include <vector>
#include <memory> 

template <typename T, typename Addr>
T GetOffset(Addr* addr, std::size_t offset) {
	return *reinterpret_cast<T*>(reinterpret_cast<unsigned char*>(addr) + offset);
}

template <typename T, typename Addr>
void SetOffset(Addr* addr, std::size_t offset, T value) {
	*reinterpret_cast<T*>(reinterpret_cast<unsigned char*>(addr) + offset) = value;
}

#define BroadCastEToEveryWorld ((void(*)(void* cpPacket, size_t iLen))0x075CDF0)
#define IPC_CALL_PROC ((int(*)(DWORD pTile, void* cpPacket, size_t iLen))0x0B37CE0)
inline int GetServerIdx()
{
	return *reinterpret_cast<DWORD*>(*reinterpret_cast<DWORD*>(0x2162628) + 0x1C4);
}

inline int GetGroupIdx()
{
	return *reinterpret_cast<DWORD*>(*reinterpret_cast<DWORD*>(0x2162628) + 0x1C8);
}

#define MASK_ITEMKINDINDEX		0x6000FFF
#define SHF_UPGRADECORE		13
#define IS_BIT_ON(val, bit) ((val & bit) == bit)
#define SKILL_BM1_SLOTID			72
#define SKILL_BM2_SLOTID			73
#define SKILL_BM3_SLOTID			74
#define MAX_WAYPOINTNUM				32
#define TILELIST_MAXNUM				9
#define TILELIST_DATALEN			11
#define _TILELIST_DATALEN			( TILELIST_DATALEN + (5) )
#define TILELIST_NUMOFFSET			0
#define TILELIST_PRSOFFSET			10
#define HOR_TILENUM					16		// ( TERR_WIDTH / TILE_WIDTH ) * MAX_HORTERRNUM
#define VER_TILENUM					16		// ( TERR_HEIGHT / TILE_HEIGHT ) * MAX_VERTERRNUM
#define MAX_TILENUM					256		// ( TERR_WIDTH / TILE_WIDTH ) * ( TERR_HEIGHT / TILE_HEIGHT ) * MAX_TERRNUM
#define INVENTORY_SLOTNUM			266		// ( 8 * 8 * 2 ) + 8 + ( 8 * 8 * 2 )
#define SKILLLIST_SLOTNUM			128
#define QUICKLINK_SLOT				386
#define MAX_MOBSEVTLISTNUM			4

typedef long long TALZ;
struct IObject;
struct SERVERCONTEXTEX;
struct USERCONTEXT;
struct USERDATACONTEXT;
struct POSITIONDATA;							//0x001C
struct PARAMETERS;
struct QD;
struct MOBSCONTEXT;
struct CWorld;
struct QDUNGEONDATA;

namespace CHANNEL_TYPE
{
	const short NONE					= 0x00;
	const short ADULT					= 0x01;
	const short PCBANG					= 0x02;
	const short PREMIUM					= 0x04;
	const short WARWAR					= 0x08;
	const short INSTANTWAR				= 0x10;
	const short RESTRICTED				= 0x20;
	const short INSTANTWAR_LOBBY_START	= 0x40;
	const short INSTANTWAR_LOBBY_STOP	= 0x80;
	const short INSTANTWAR_LOBBY_CLOSED	= 0x100;
	const short INSTANTWAR_BF_CLOSED	= 0x200;
	const short TRADE					= 0x400;
};

enum ErrorCode
{
	EC_REQUIRE_NPCSIDX_DEAD = 0x01,
	EC_RESET_TRAP,

	EC_RESET_TRADE,
	EC_RESET_TARGET_USER,
	EC_AFTER_DEAD_USING_POTION,

	EC_FAIL,
	EC_BAD_REQ_MOVE,
	EC_BAD_REQ_QUEST_OPEN,
	EC_BAD_REQ_QUEST_ACNPC,
	EC_BAD_INVENSLOT_INDEX,
	EC_INVENSLOT_NOT_USING,
	EC_INVENSLOT_USING,
	EC_QD_INSTANCE_LIMIT_FULL,
	EC_MP_INSUFFICIENCY,
	EC_ALEADYDEATH,
	EC_BMMODE_NONE,
	EC_SP_DEFICIENCY,
	EC_TARGET_ERROR = 25,

	EC_RESTRICTED_WORLDSVR,
	EC_QD_ANTI_ONLINEGAME,
	EC_IWAR_LOBBY_CLOSED,
	EC_IWAR_RESERVED_FOR_BF_ENTRYFEE,
	EC_IWAR_ENTRY_RESTRICTED,
	EC_IWAR_BF_CLOSED,
	EC_IWAR_NOT_ENOUGH_BF_ENTRYFEE,
	EC_CHANNEL_FULL,
	EC_XTRAP_AUTH_FAIL,
	EC_CHANNEL_ONLY_PCBANG_USER,
	EC_IWAR_HAVENO_NATIONREWARD,
	EC_IMAGEAUTH_WAITTIMEOVER,
	EC_IMAGEAUTH_LOADDATAFAIL,
	EC_IRREMOVABLE,
	EC_PARTY_MEMBER_IN_OTHER_MD,
	EC_NOT_ALLOWED_ENTER_QD_IN_TRADE_CH,
	EC_QD_INSTANCE_LIMIT_TIMEOVER,
	EC_NA_SKILL_COOLTIME,

	EC_IWAR_POTION_COOLTIME,
	EC_ALZ_LIMIT_SAVE,
	EC_IWAR_LOBBY_FULL,
	EC_IWAR_LOBBY_FULL_SOCKETCLOSING,
	EC_PARTYBUFF_OUTOFRANGE,
	EC_PARTYBUFF_HASNOPARTY
};

enum MOBS_PHASE
{
	MP_NONE_____ = 0x00,
	MP_MOVE00_CM = 0x01,			// MovePhase

	MP_FIND00_UN,					// FindPhase[UnAggressive]
	MP_FIND00_AG,					// FindPhase[Aggressive]

	MP_CHASE0_CN,					// ChasePhase[Concentrate]
	MP_CHASE0_SL,					// ChasePhase[Select]
	MP_CHASE0_RG,					// ChasePhase[Revenge]

	MP_BATTLE_CN,					// BattlePhase[Concentrate]
	MP_BATTLE_SL,					// BattlePhase[Select]
	MP_BATTLE_RG,					// BattlePhase[Revenge]

	MP_EVENT0_CM,
	MP_EVENT1_CM,

	MP_FDFOREVER,					// Find Forever

	MP_DEAD00_CM,					// DeadPhase

	MP_STUN00_CM,					// 스턴
	MP_CHASED_QD,					// 던전형 일반 추적
	MP_RQHELP_CM,					// 그룹몹에게 도움요청
	MP_ESCAPE_CM,					// 도망
	MP_ATTVLD_CM,					// 스킬 유효거리 감소

	MP_EVENTS_SP,					// 이벤트 스폰
	MP_EVENTS_KL,					// 이벤트 Kill
	MP_PHASE_END,
};

enum MOBS_EVTPHASE
{
	MPE_NONE____ = 0x00,
	MPE_SPAWN000,
	MPE_DEADSPWN,
	MPE_DEADFOREVER,
	MPE_AWAKE000,
};

enum IWarEndCause
{
	wecCalledGame,
	wecMaxScore,
	wecOnPoints
};

enum IWarRewardType
{
	wrtIndividual = 0,
	wrtNation = 1,
	wrtNationOneDayEnd = 2,
};

enum ForceValueType
{
	fvtReal = 1,
	fvtPercent = 2,
	fvtIrremovable = 3,
	fvtPercentNoLimit = 4,
};

enum SKILLRES_VALUE
{
	SR_CRITICAL = 0x01,
	SR_NORMALAK,
	SR_MISSINGS,
	SR_MOBSDEAD,

	// 버핑사용결과
	SR_SUCCSBUF,								// 버핑성공
	SR_EXISTBUF = 0x10,							// 버핑실패
	SR_EXTCRITL = SR_EXISTBUF + SR_CRITICAL,	// 공격성공+버핑실패
	SR_EXTNORML = SR_EXISTBUF + SR_NORMALAK,	// 공격성공+버핑실패
	SR_EXTMISSN = SR_EXISTBUF + SR_MISSINGS,	// 공격미스+버핑실패

	SR_ENCHANT,									// 인챈트 모드시 버핑 실패
	SR_STUNFAIL,								// 스턴으로 인한 버핑 실패
	SR_FULLFAIL,								// HP가 만땅으로 인한 실패
	SR_DIFFWORLD,
	SR_TARGETERROR,
	SR_DMG_ABSORBED,
};

enum HABITAGGR_TYPE
{
	HA_UNAGGRESVE = 0x00,
	HA_AGGRESSIVE = 0x01,
	HA_AGGRESSIVE_NATION = 0x02,
};

enum HABITATTACK_TYPE
{
	HT_ATTACKCONC = 0x00,
	HT_ATTACKSELT = 0x01,
	HT_ATTACKREVG = 0x02,
	HT_ATTACKNONE = 0x03,
};

enum NPC_TYPE
{
	NT_NONE = 0x00,					// None
	NT_SHOP = 0x01,					// Shop
	NT_SKIL = 0x02,					// Skill
	NT_SMYU = 0x03,					// StyleMasteyUp
	NT_ITUP = 0x04,					// ItemUp ( + Shop )
	NT_WHOU = 0x05,					// WareHouse
	NT_WARP = 0x06,					// WarpNpc
	NT_ETCS = 0x07,					// Etc
	NT_FTPN = 0x09,                 // ForceTower 컨트롤패널
	NT_FTSH = 0x0A,                 // 생산 ForceTower 
	NT_LCOR = 0x0B,                 // 레거시 코어
	NT_WOBJ = 0x10,					// WarpObject
	NT_QDUN = 0x11,					// Quest Dungoen
};

enum ATTCKPATTERN_TYPE
{
	AP_PATTERN1 = 0x01,
	AP_PATTERN2,
	AP_PATTERN3,
	AP_PATTERN4,
};

enum SKILLMODS_TYPE
{
	SK_MODS00 = 0x00,
	SK_MODS01,
	SK_MODS02,
	SK_MODS03,
	SK_MODS04,
	SK_MODS05,
	SK_MODS06,
	SK_MODS07,
};

enum OBJIDX_TYPE
{
	OT_USER = 0x01,
	OT_MOBS = 0x02,
	OT_ITEM = 0x03,
	OT_PART = 0x04,
	OT_UOBJ = 0x05,
};

enum E_PVP_TYPE
{
	NO_PVP,
	NORMAL_PVP = 2,
	PK = 6
};

enum IWARWORLDTYPE
{
	WT_INSTANTWAR_NONE = 0,
	WT_INSTANTWAR_LOBBY = 2,
	WT_INSTANTWAR_BF = 3,
};

enum WORLDTYPE
{
	WT_GN,	//mapa normal
	WT_QD, //dg
};

#pragma pack(push,1)

struct BuffTimeOut
{
	int skillIdx;
	INT64 nextTime;
};

struct CABALPOOL
{
	CABALPOOL* next;
	CABALPOOL* previous;
	void* _data;
};

struct CABALVECTORPOOL
{
	CABALPOOL* begin;									//0x4FF0
	CABALPOOL* end;										//0x4FF4
};

class CABAL_POOL_DATA : public Singleton<CABAL_POOL_DATA>
{
public:
	template <typename T>
	std::shared_ptr<std::vector<T*>> GetCabalPoolList(CABALVECTORPOOL* pool)
	{
		auto listData = std::make_shared<std::vector<T*>>();

		if (!pool->begin || !pool->end)
			return listData;

		CABALPOOL* it_begin = pool->begin;
		CABALPOOL* it_end = pool->end;

		// C?ia segura do ponteiro it_begin
		CABALPOOL* current = it_begin;

		if ((INT64)pool != (INT64)it_begin)
		{
			while (true)
			{
				listData->push_back(reinterpret_cast<T*>(&current->_data));

				if (current == it_end && current)
					break;

				current = current->next;
			}
		}
		return listData;
	}
};

struct IWarResults
{
	int warResultsId;
	BYTE channelIdx;
	BYTE warMapId;
	BYTE victoryNation;
	IWarEndCause warEndCause;
	IWarRewardType warRewardType;
	INT64 startDateTime;
	INT64 endDateTime;
};

struct AlzStatus
{
	TALZ value_;
	USERCONTEXT* userCtx_ = 0;
	USERDATACONTEXT* userDataCtx_ = 0;
	INT64 unkValue_ = 0;

	void UserContext(USERCONTEXT* userCtx, int value);

	USERCONTEXT* UserContext() const { return userCtx_; }
	USERDATACONTEXT* UserDataContext()const { return userDataCtx_; }
	void Init()
	{
		value_ = 0;
		userCtx_ = 0;
		userDataCtx_ = 0;
	}

	operator TALZ() const { return value_; }
	TALZ operator-(const TALZ alz) const { return value_ - alz; }
	TALZ operator-(const int alz) const { return value_ - alz; }
	TALZ operator+(const TALZ alz) const { return value_ + alz; }
	TALZ operator+(const int alz) const { return value_ + alz; }
	TALZ operator+(const AlzStatus& alzStatus) const { return value_ + alzStatus.value_; }
	bool operator==(const TALZ alz) const { return value_ == alz; }
	bool operator==(const int alz) const { return value_ == alz; }
	bool operator!=(const TALZ alz) const { return value_ != alz; }
	bool operator!=(const int alz) const { return value_ != alz; }
	bool operator<(const TALZ alz) const { return value_ < alz; }
	bool operator<(const int alz) const { return value_ < alz; }
	bool operator>(const TALZ alz) const { return value_ > alz; }
	bool operator>(const int alz) const { return value_ > alz; }
	bool operator<=(const TALZ alz) const { return value_ <= alz; }
	bool operator<=(const int alz) const { return value_ <= alz; }
	bool operator>=(const TALZ alz) const { return value_ >= alz; }
	bool operator>=(const int alz) const { return value_ >= alz; }

	TALZ operator=(const TALZ alz);
	const TALZ operator+=(const TALZ alz);
	const TALZ operator-=(const TALZ alz);
};

struct BuffingData
{
	int skillIdx;									//44		//0
	int skillGroup;									//48		//4
	int skillLv;									//4C		//8
	int forceIdx;									//50		//C
	int value;										//54		//10
	int valueApplied;								//58		//14
	int valueBak;									//5C		//18
	int iValueCoef_A;								//60		//1C
	int iValueCoef_B;								//64		//20
	int buffIdx;									//68		//24
	int buffKind;									//6C		//28
	int buffType;									//70		//2C
	int buffGroup;									//74		//30
	int Power;										//78		//34
	int MotionTime;									//7C		//38
	DWORD currentTime;								//80		//3C
	DWORD restartTime;								//84		//40
	DWORD expireTime;								//88		//44
	ForceValueType valueType;						//8C		//48
	int bfSeriesMaxCnt;								//90		//4C
	int bfSeriesType;								//94		//50
	char styleLv;									//98		//54
	char damageFunctionCallback;					//99		//55
};

struct FORCE_EFFECT_CONTEXT
{
	BuffingData* pBuffData;
	IObject* pAttacker;
	IObject* pDefender;
	BOOL isRing;
	FORCE_EFFECT_CONTEXT()
		: pBuffData(NULL), pAttacker(NULL), pDefender(NULL)
	{
	}

	FORCE_EFFECT_CONTEXT(BuffingData* buff, IObject* attacker, IObject* defender)
		:pBuffData(buff), pAttacker(attacker), pDefender(defender)
	{
	}

	FORCE_EFFECT_CONTEXT(BuffingData* buff, IObject* defender)
		:pBuffData(buff), pDefender(defender)
	{
	}
};

struct Resistance
{
	struct ResistanceElem
	{
		int value;
		int immunity;
		void IncValue(const int delta)
		{
			if (delta == 100)
			{
				IncImmunity();
			}
			else
			{
				value += delta;
			}
		}
		void DecValue(const int delta)
		{
			if (delta == 100)
			{
				DecImmunity();
			}
			else
			{
				value -= delta;
			}
		}
		void IncImmunity()
		{
			++immunity;
		}
		void DecImmunity()
		{
			if (immunity > 0)
			{
				--immunity;
			}
		}
		bool HasImmunity() const { return immunity > 0; }
		ResistanceElem()
			: value(0), immunity(0)
		{
		}
	};
	ResistanceElem bfxBlow;
	ResistanceElem bfxDown;
	ResistanceElem bfxStun;
	ResistanceElem sleep;
	ResistanceElem dontMove;
	ResistanceElem criRate;
	ResistanceElem criDmg;
	ResistanceElem ampRes;
};

struct ITEM_ID
{
	DWORD itemID : 12;//itemID
	DWORD boundOnAcc_Extended : 1;//item preso a conta ao equipar ou extendido
	DWORD upgradeLvl : 6; //upgrade
	DWORD boundOnChar : 1;//preso ao personagem
	DWORD boundOnEquip : 1; //quando o item tem a condi豫o de ficar preso ao equipar
	DWORD reserved : 3; //reservado -> sem uso
	DWORD specialItem : 1;//item do invent?io especial
	DWORD extendItemLimit : 7;//pode ser usado para o limite de itens -> 0 ~ 3

	ITEM_ID()
	{
	};

	ITEM_ID(DWORD itemId)
	{
		*(DWORD*)this = itemId;
	}

	//obtem o numero do item para o array (1,4095,4096,4097...) usado para o itemscp e para procurar itens no item.enc
	DWORD getItemIdxFromArrays() const
	{
		return itemID + (extendItemLimit * 4096);
	}

	//METHODS
	void set(DWORD itemId) { *(DWORD*)this = itemId; }
	DWORD get() { return *(DWORD*)this; }

	//remove a flag de item preso a conta
	void DesligarItem()
	{
		boundOnEquip = boundOnAcc_Extended ? 0 : 1;
		boundOnChar = 0;
	}
};

typedef struct ITEM_OPTION
{
	struct NORMAL_SLOTS
	{
		BYTE option : 4;
		BYTE rareNum : 4; // (Potencia do slot = rareNum % 4) -> craft = rareNum & 7

		bool IsCraft()
		{
			auto slot = *(WORD*)this & 0x80;
			return slot == 0x80 ? true : false;
		}
		bool IsSlot()
		{
			auto slot = *(WORD*)this & 0x80;
			return slot == 0x80 ? false : true;
		}
		int SlotLevel()
		{
			return IsSlot() ? (rareNum % 4) : 0;
		}
		int CraftLevel()
		{
			return IsCraft() ? (rareNum & 7) : 0;
		}
		int GetRowOpt() const
		{
			return option;
		}
	};
	NORMAL_SLOTS sNormalSlots[3];
	BYTE slotOption : 4;
	BYTE _slotCount : 4;

	ITEM_OPTION()
	{
	};

	ITEM_OPTION(DWORD value) { *(DWORD*)this = value; }

	//METHODS
	DWORD get() { return *(DWORD*)this; }
	DWORD GetQSTSLevel() { return *(DWORD*)this / 0x80; }
	DWORD GetQSTSCount() { return *(DWORD*)this % 0x80; }

	void set(DWORD value) { *(DWORD*)this = value; }
	DWORD decrement(int value) { return *(DWORD*)this -= value; }
	DWORD increment(int value) { return *(DWORD*)this += value; }
	void RemoverAllCraft()
	{
		//trata os slots normais
		for (int i = 0; i < 3; i++)
		{
			//remove o craft do item
			if (sNormalSlots[i].rareNum > 8)
			{
				sNormalSlots[i].option = 0;
				sNormalSlots[i].rareNum = 0;
			}

			//passa as informa寤es dos slots para o inicio do slot
			if (sNormalSlots[i].option == 0 && i < 2)
			{
				//s?passa os ids pra frente caso seja slot, caso contr?io tamb? limpa
				if (sNormalSlots[i + 1].rareNum < 9)
				{
					sNormalSlots[i] = sNormalSlots[i + 1];
					sNormalSlots[i + 1] = { 0,0 };
				}
			}
		}

		//soluciona o caso de item com 1 slot e 3 crafts
		if (slotOption)
		{
			for (auto& it : sNormalSlots)
			{
				if (it.option == 0)
				{
					//passa do slot inv?ido para um slot sem uso

					it.option = slotOption; //ocupa o slot livre
					it.rareNum = 1; //define o rarenum como 1

					//limpa a option no slot invalido
					slotOption = 0;
					break;
				}
			}
		}
	}
	void RemoveAllSlot()
	{
		for (int i = 0; i < 3; i++)
		{
			//remove o craft do item
			if (sNormalSlots[i].rareNum < 8)
			{
				sNormalSlots[i].option = 0;
				sNormalSlots[i].rareNum = 0;
			}
		}
		//remove o slot bugado quando tem 3 crafts
		if (slotOption)
			slotOption = 0;
	}
	int SlotCount() const
	{
		int result = 0;
		for (int i = 0; i < 3; i++)
		{
			if (sNormalSlots[i].rareNum && sNormalSlots[i].rareNum < 8)
			{
				result += sNormalSlots[i].rareNum % 4;
			}
		}

		if (slotOption)
			result++;

		return result;
	}
	void RemoveSelectedSlot(int slot)
	{
		if (slot < 1 || slot > 4)
		{
			//printf("O slot digitado nao existe.\n");
			return;
		}

		BYTE tmpSlot = slot - 1;

		if (!sNormalSlots[tmpSlot].option)
		{
			//printf("O slot selecionado ja esta vazio.\n");
			return;
		}

		if (sNormalSlots[tmpSlot].rareNum > 9)
		{
			//printf("Voce nao pode remover um slot de craft.\n");
			return;
		}

		//limpa os slots normais
		if (tmpSlot < 3)
		{
			if (sNormalSlots[tmpSlot].rareNum > 1)
			{
				sNormalSlots[tmpSlot].rareNum -= 1; //decrementa o slot em 1
				//printf("decrementado 1 slot\n");
			}
			else
			{
				sNormalSlots[tmpSlot].option = 0;
				sNormalSlots[tmpSlot].rareNum = 0;
			}
		}
		else
		{
			slotOption = 0;
		}


		for (int i = 0; i < 3; i++)
		{
			//passa as informa寤es dos slots para o inicio do slot
			if (sNormalSlots[i].option == 0 && i < 2)
			{
				//s?passa os ids pra frente caso seja slot, caso contr?io tamb? limpa
				if (sNormalSlots[i + 1].rareNum < 9)
				{
					sNormalSlots[i] = sNormalSlots[i + 1];
					sNormalSlots[i + 1] = { 0,0 };
				}
			}
		}

		//soluciona o caso de item com 1 slot e 3 crafts
		if (slotOption)
		{
			for (auto& it : sNormalSlots)
			{
				if (it.option == 0)
				{
					//passa do slot inv?ido para um slot sem uso

					it.option = slotOption; //ocupa o slot livre
					it.rareNum = 1; //define o rarenum como 1

					//limpa a option no slot invalido
					slotOption = 0;
					break;
				}
			}
		}
	}
}ITEM_OPTION;

struct ASSISTANTSLOT
{
	DWORD idx;										//0x0000
	DWORD used;										//0x0004
	DWORD category; //0x0008
	DWORD assistantIdx; //0x000C
	DWORD var_0010; //0x0010
	DWORD group;									//0x0014
	DWORD assistantLev; //0x0018
	DWORD var_001C; //0x001C
	DWORD var_0020; //0x0020
	DWORD var_0024; //0x0024
	DWORD var_0028; //0x0028
	DWORD var_002C; //0x002C
	DWORD var_0030; //0x0030
	DWORD var_0034; //0x0034
	DWORD var_0038; //0x0038
	DWORD var_003C; //0x003C
	DWORD var_0040; //0x0040
	DWORD var_0044; //0x0044
	DWORD var_0048; //0x0048
	DWORD var_004C; //0x004C
	DWORD var_0050; //0x0050
};

struct TargetPlayer
{
	int characterIdx;
	bool isDead;
	BYTE result;
	WORD damage;
	int targetNewHP;
	int U0;
};

struct MobAttackResult
{
	int result;
	int mobDamage;
	int isDead;
	int a3;
	int a4;
	int a5;
};

struct Style
{
	DWORD battleStyle_ : 3;
	DWORD masteryLevel_ : 5;
	DWORD face_ : 5;
	DWORD hairColor_ : 4;
	DWORD hairStyle_ : 5;
	DWORD	auraCode_ : 4;
	DWORD sex_ : 1;
	DWORD helmet_ : 1;
	DWORD newClass : 1;
	DWORD reserved_ : 3;

	BYTE	BattleStyle() const { return battleStyle_; }
	BYTE	MasteryLevel()const { return masteryLevel_; }
	BYTE	Face()const { return face_; }
	BYTE	HairColor() const { return hairColor_; }
	BYTE	HairStyle() const { return hairStyle_; }
	BYTE	AuraCode()const { return auraCode_; }
	BOOL	Sex() const { return sex_; }
	BOOL	Helmet()const { return helmet_; }

	int	GetClass() const
	{
		if (newClass)
		{
			if (battleStyle_ == 1)
				return 7;
			if (battleStyle_ == 3)
				return 9;
			if (battleStyle_ == 4)
				return 8;
		}
		return battleStyle_;
	}


	void	SetBattleStyle(const BYTE& battleStyle) { battleStyle_ = battleStyle; }
	void	SetMasteryLevel(const BYTE& masteryLevel) { masteryLevel_ = masteryLevel; }
	void	SetFace(const BYTE& face) { face_ = face; }
	void	SetHairColor(const BYTE& hairColor) { hairColor_ = hairColor; }
	void	SetHairStyle(const BYTE& hairStyle) { hairStyle_ = hairStyle; }
	void	SetAuraCode(const BYTE& auraCode) { auraCode_ = auraCode; }
	void	SetSex(const BOOL& sex) { sex_ = sex; }
	void	SetHelmet(const BOOL& helmet) { helmet_ = helmet; }

	void	Initialize() { SetStyleValue(0); }
	DWORD GetStyleValue() { return *(reinterpret_cast<DWORD*>(this)); }

	void	SetStyleValue(const DWORD& style)
	{
		*(reinterpret_cast<DWORD*>(this)) = style;
	}
};

struct ITEMDATA
{
	int ItemID;				 //0
	UINT64 PriceSell;		 //4
	UINT64 Price2;			 //C
	int ValueLv;			 //14
	int width;				 //18
	int height;				 //1C
	int Grade;				 //20
	int UniqueGrade;		 //24
	int var_0x28;			 //28
	int EnchantCodeLnk;		 //2C
	int var_0x30;			 //30
	int var_0x34;			 //34
	int Type;				 //38
	int var_0x3C;			 //
	int Property;
	int LimitLv;

	//AttckRate_Opt1;
	//DefenRate_Opt1Val_PhyAttMax;
	//Opt2_STRLmt1;
	//DEXLmt1_Opt2Val;
	//INTLmt1_Opt3;
	//Opt3Val_STRLmt2;
	//DEXLmt2_Opt4;
	//INTLmt2_Opt4Val;
	struct S_ITEMSCPOPTIONS
	{
		int option;
		int value;
	}
	sItemScpOptions[4];

	int Defense_LEVLmt_MagAttVal;
	int dSTR2;
	int dDEX2;
	int dINT2;
	int AttckRate;
	int PhyAttMax;
	int MagAttVal;
	int var_0x84;
	int ValueLv2;
	int Opt1;
	int MaxCore;
	int MaxReputation;
	int LimitReputation;
	int FixType;
};

struct PERIOD
{
	DWORD year : 7;	//YY
	DWORD month : 4;	//MM
	DWORD day : 5;	//DD
	DWORD hour : 5;	//HH
	DWORD minute : 6;	//NN
	DWORD periodidx : 5;	//period table reference index ( 1 ~ 31 ) 

	PERIOD(DWORD time)
	{
		*(DWORD*)this = time;
	}
};

typedef PERIOD ITEM_PERIOD;

struct ATTK_RES
{
	SKILLRES_VALUE iResult;
	int iDamage;
	int iDefDead;
	int iEXP;
	int iSkillExp;
	int f;
};

struct DropUnit
{
	DWORD dwItemKind;				//0x00
	DWORD dwItemOpt;				//0x04
	DWORD dwUnk2;					//0x08
	DWORD dwItemOpt2;				//0x0C
	DWORD dwUnk3;					//0x10
	DWORD dwUnk4;					//0x14
	DWORD dwUnk5;					//0x18
	DWORD dwUnk6;					//0x1C
	DWORD dwUnk7;					//0x20
	DWORD* ptrUnk1;					//0x24
	DWORD dwUnk8;					//0x28
	DWORD dwDropedCount;			//0x2C
	DWORD dwMaxDropCnt;				//0x30
	DWORD dwUnk9;					//0x34
};

struct INVENTORY_DB_DATA
{
	int iKindIdx;
	int iSerials;
	int iItemOpt;
	WORD slotIdx;
	ITEM_PERIOD period;
};

struct IVENTORY_DB_DATA_Lst
{
	INVENTORY_DB_DATA item[1];
};

struct ITEM_ADDITIONAL_DATA
{
};

struct ITEMUNIT
{
	ITEM_ID iKindIdx;
	int iSerials;
	ITEM_OPTION iItemOpt;
	ITEM_PERIOD period;
	ITEM_ADDITIONAL_DATA* additionalData;
};

struct SLOTBASE
{
	int						_iSlotIdx;			// 현재 슬롯의 인덱스
	BOOL					bIsUsed;			// 사용중인가
};

struct INVENTORYDATA : public SLOTBASE
{
	ITEM_ID				dwItemKind;
	DWORD				dwSerials;
	ITEM_OPTION			dwOption;
	DWORD				duration;
	DWORD				isS2C;

	void ClearInventory()
	{
		bIsUsed = 0;
		dwItemKind.set(0);
		dwSerials = 0;
		dwOption.set(0);
		duration = 0;
		isS2C = 0;
	}
};

class QD_Manager
{
public:
	SERVERCONTEXTEX* serverCtxEx_; //0x0000
	DWORD var_00004; //0x00004
	DWORD var_00008; //0x00008
	DWORD var_0000C; //0x0000C
	DWORD var_00010; //0x00010
	DWORD var_00014; //0x00014
	DWORD var_00018; //0x00018
	DWORD var_0001C; //0x0001C
	DWORD var_00020; //0x00020
	DWORD var_00024; //0x00024
	DWORD var_00028; //0x00028
	DWORD var_0002C; //0x0002C
	QDUNGEONDATA* questDungeon_; //0x00030
	DWORD var_00034; //0x00034
	DWORD var_00038; //0x00038
	DWORD var_0003C; //0x0003C
	DWORD var_00040; //0x00040
	DWORD var_00044; //0x00044
	DWORD var_00048; //0x00048
	DWORD var_0004C; //0x0004C
	DWORD var_00050; //0x00050
	DWORD var_00054; //0x00054
	DWORD var_00058; //0x00058
	DWORD var_0005C; //0x0005C
	QDUNGEONDATA* missionDungeon_; //0x00060
	DWORD var_00064; //0x00064
	DWORD maxDungeons; //0x00068
	DWORD var_0006C; //0x0006C
	DWORD var_00070; //0x00070
	DWORD var_00074; //0x00074
	DWORD var_00078; //0x00078
	DWORD var_0007C; //0x0007C
	DWORD var_00080; //0x00080
	DWORD var_00084; //0x00084
	DWORD var_00088; //0x00088
	DWORD var_0008C; //0x0008C
	DWORD var_00090; //0x00090
	DWORD var_00094; //0x00094
	DWORD var_00098; //0x00098
	DWORD var_0009C; //0x0009C
	DWORD var_000A0; //0x000A0
	DWORD var_000A4; //0x000A4
	DWORD var_000A8; //0x000A8
	DWORD var_000AC; //0x000AC
	DWORD var_000B0; //0x000B0
	DWORD var_000B4; //0x000B4
	DWORD var_000B8; //0x000B8
	DWORD var_000BC; //0x000BC
	DWORD var_000C0; //0x000C0
	DWORD var_000C4; //0x000C4
	DWORD var_000C8; //0x000C8
	DWORD var_000CC; //0x000CC
	DWORD var_000D0; //0x000D0
	DWORD var_000D4; //0x000D4
	DWORD var_000D8; //0x000D8
	DWORD var_000DC; //0x000DC
	DWORD var_000E0; //0x000E0
	DWORD var_000E4; //0x000E4
	DWORD var_000E8; //0x000E8
	DWORD var_000EC; //0x000EC
	DWORD var_000F0; //0x000F0
	DWORD var_000F4; //0x000F4
	DWORD var_000F8; //0x000F8
	DWORD var_000FC; //0x000FC
	DWORD var_00100; //0x00100
	DWORD var_00104; //0x00104
	DWORD var_00108; //0x00108
	DWORD var_0010C; //0x0010C
	DWORD var_00110; //0x00110
	DWORD var_00114; //0x00114
	DWORD var_00118; //0x00118
	DWORD var_0011C; //0x0011C
	DWORD var_00120; //0x00120
	DWORD var_00124; //0x00124
	DWORD var_00128; //0x00128
	DWORD var_0012C; //0x0012C
	DWORD var_00130; //0x00130
	DWORD var_00134; //0x00134
	DWORD var_00138; //0x00138
	DWORD var_0013C; //0x0013C
	DWORD var_00140; //0x00140
	DWORD var_00144; //0x00144
	DWORD var_00148; //0x00148
	DWORD var_0014C; //0x0014C
	DWORD var_00150; //0x00150
	DWORD var_00154; //0x00154
	DWORD var_00158; //0x00158
	DWORD var_0015C; //0x0015C
	DWORD var_00160; //0x00160
	DWORD var_00164; //0x00164
	DWORD var_00168; //0x00168
	DWORD var_0016C; //0x0016C
	DWORD var_00170; //0x00170
	DWORD var_00174; //0x00174
	DWORD var_00178; //0x00178
	DWORD var_0017C; //0x0017C
	DWORD var_00180; //0x00180
	DWORD var_00184; //0x00184
	DWORD var_00188; //0x00188
	DWORD var_0018C; //0x0018C
	DWORD var_00190; //0x00190
	DWORD var_00194; //0x00194
	DWORD var_00198; //0x00198
	DWORD var_0019C; //0x0019C
	DWORD var_001A0; //0x001A0
	DWORD var_001A4; //0x001A4
	DWORD var_001A8; //0x001A8
	DWORD var_001AC; //0x001AC
	DWORD var_001B0; //0x001B0
	DWORD var_001B4; //0x001B4
	DWORD var_001B8; //0x001B8
	DWORD var_001BC; //0x001BC
};

struct BBEADSLOT : SLOTBASE
{
	ITEMUNIT				sItemUnit;
};

struct SpecialSkill : public SLOTBASE
{
	DWORD var1;
	DWORD var2;
	DWORD var3;
	DWORD var4;
	DWORD var5;
	DWORD var6;
};

struct unkStruct_28Bytes : public SLOTBASE
{
	DWORD var1;
	DWORD var2;
	DWORD var3;
	DWORD var4;
	DWORD var5;
};

struct WAREHOUSEAGENT : public SLOTBASE
{
	ITEMUNIT itemUnit;
};

struct unkStruct_24Bytes
{
	DWORD var1;
	DWORD var2;
	DWORD var3;
	DWORD var4;
	DWORD var5;
	DWORD var6;
};

struct unkStruct_32Bytes : public SLOTBASE
{
	DWORD var1;
	DWORD var2;
	DWORD var3;
	DWORD var4;
	DWORD var5;
	DWORD var6;
};

struct Unknown40Bytes : public SLOTBASE
{
	DWORD var1;
	DWORD var2;
	DWORD var3;
	DWORD var4;
	DWORD var5;
	DWORD var6;
	DWORD var7;
	DWORD var8;
};

struct CHANGE_SHAPE_PTR
{
	DWORD shapeItemID;
};

struct ATTACKERDATA
{
	USERCONTEXT*			pUserCtx;
	int						time;
	int						unk;
};

struct EQUIPMENTSLOT : public SLOTBASE
{
	ITEM_ID iKindIdx;
	DWORD iSerials;
	ITEM_OPTION iItemOpt;
	DWORD duration;
	CHANGE_SHAPE_PTR* sChangeShape;
	DWORD checked;
	DWORD unkvar4;
	DWORD unkvar5;
	DWORD unkvar6;
	DWORD unkvar7;
	DWORD unkvar8;
	DWORD unkvar9;
	DWORD unkvar10;
	DWORD unkvar11;

	void ClearEquipament()
	{
		bIsUsed = 0;
		iKindIdx.set(0);
		iSerials = 0;
		iItemOpt.set(0);
		duration = 0;
		sChangeShape = 0;
		checked = 0;
		unkvar4 = 0;
		unkvar5 = 0;
		unkvar6 = 0;
		unkvar7 = 0;
		unkvar8 = 0;
		unkvar9 = 0;
		unkvar10 = 0;
		unkvar11 = 0;
	}
};

struct MOBSSKILLDATA
{
	int	unkData;
	int	iValidDist;

	int iValidDistDecreased;

	int	iValidOffset;
	int	iPhyAttMin;
	int	iPhyAttMax;
	int	iPhyAttDff;
	int	iReach;
	int	iRange;
	int	iStance;
	DWORD					dwInterval;
	BOOL					bIsDefSkill;
	DWORD					_sgGroup;
};

struct MOBSDATA
{
	int iMonsterIndex;
	int iLev;
	int iEXP;
	int var_089C;
	INT64 iHp;
	int AttacksR;
	int Hit;
	int Penetration;
	int Ignore_Damagedrop;
	int Defense;
	int DefenseR;
	int Flee;
	int DmgDsc;
	int CrPReg;
	int Cdreg;
	int Skampr;
	int Suppres_res;
	int Slience_res;
	int Ignore_Penetration;
	int Ignore_Hit;
	int Absolute_Damage;
	int HpProportionDmg;
	int DiffDamage_res;
	int HpDisturbance_res;
	int HPRechagR;
	int Escape;
	int Scale;
	int AlertRange;
	int var_00904;
	int Limt1Range;
	int FindCount;
	int var_00910;
	int Boss;
	int Aggressive;
	int Attack;
	int AttkPattern;
	int AggroPattern;
	float canatk2; //ser? acho que n?.
	int Property;
	int _Property;
	int iFindCounts;
	int FindInterval;
	int ChasInterval;
	float _haHabitAggr; //acho que n? ?bem isso...
	float ChasSpeed;
	int AttkPattern2;
	int AggroPattern2;
	int Atk_Count_Amp;
	int var_001F4;
	int PhyAttMax1;
	int PhyAttMin1;
	int Reach1;
	int Range1;
	int Stance1;
	int Interval1;
	int var_00970;
	int Group1;
	int var_00218;
	int var_0021C;
	int var_00220;
	int var_00224;
	int PhyAttMax2;
	int PhyAttMin2;
	int Reach2;
	int Range2;
	int Stance2;
	int Interval2;
	int var_009A0;
	int Group2;
	int var_009A8;
	int AtkSignal;
	int AtkSignal_value;
	float Radius;
	int canatk;
	int ServerBossType;
};

struct S_CHARACTER_LIST
{
	int unk1;
	int iLev;
	int iCharIdx;
	int isS2C;
	int uniqueCharIdx;
	char cCharName[20];
};

struct WarStatistics
{
	int kill;							//0x268
	int dead;							//0x26C
	int warScore;						//0x270
	UINT64 atkDamage;					//0x274
	UINT64 defDamage;					//0x27C
	UINT64 atkHeal;						//0x284
	UINT64 defHeal;						//0x28C
	UINT64 forceTowerBuildTime;			//0x294
	DWORD lastNotifyTick;				//0x29C
	BOOL updated;						//0x300
	PARAMETERS* owner_;					//0x304
	BOOL yellowAlert;					//0x308
	DWORD alertTime;					//0x30C
	int	unk;							//0x310
};

struct WAYPOINT
{
	int						iPosX,
							iPosY;
};

struct WAYPOINTSET
{
	WAYPOINT				sWayPoint[MAX_WAYPOINTNUM];
	int						iWayPointNum;
};

struct CREATE_CONTEXTLINK
{
	DWORD				unk1;
	DWORD				isS2C;
	USERCONTEXT*		userCtx;
	USERDATACONTEXT*	userDataCtx;
	int					flag;
};

struct IObject
{
public:
	//USERDATACONTEXT
	//virtual void InitializeUserDataContext() = 0;						//0x0000
	//virtual void UnitializeUserDataContext();						//0x0004
	//virtual int GetCharIdx();										//0x0008
	//virtual int GetType();	//retorna um enum: OBJIDX_TYPE			//0x000C
	//virtual int GetNation();										//0x0010
	//virtual int IsDead();											//0x0014
	//virtual void DeadAction(int deadBy);							//0x0018
	//virtual POSITIONDATA* ShutdownSvr();							//0x001C
	//virtual PARAMETERS* GetParameter();								//0x0020
	//virtual void* Unused(int buffKind, int id);//GetBuffList	//0x0024
	//virtual int GetPartyIdx();										//0x0028
	//virtual BYTE GetPVPType(); //retorna um enum: E_PVP_TYPE		//0x002C
	//virtual USERDATACONTEXT* SetAlgumaCoisaF5FC(int unkvalue);		//0x0030
	//virtual BOOL IsValidTime_desconhecido();						//0x0034
	//virtual USERDATACONTEXT* SetServerIdx(int serverIdx);			//0x0038
	//virtual USERDATACONTEXT* SetVerifyServerTime(int serverIdx);	//0x003C
	//virtual USERDATACONTEXT* SetVerifyUniqIdx(BYTE uniqIdx);		//0x0040
	//virtual BOOL ExistBFX(); //n? sei se ?o GET iVerifyUniqIdx	//0x0044
	//virtual int GetCharIdx2();										//0x0048

	INT64 allignement;
	INT64 allignement2;

	//USERDATACONTEXT* GetUserDataContext()
	//{
	//	return (USERDATACONTEXT*)this;
	//}
	//
	//MOBSCONTEXT* GetMobDataContext()
	//{
	//	return (MOBSCONTEXT*)this;
	//}
};

struct SKILL_LISTSLOT : public SLOTBASE
{
	int						iSkillIdx = 0,
							iSkillLv = 0;
	DWORD					_dwLastUseTime = 0;
	int						useCoolTimeCount = 0;
	int						BadTimeCount = 0;

};

struct QUICKLINKSLOT : public SLOTBASE
{
	int						iTargetSlotIdx;
	void*					pTargetSlot;
};

struct SERVERCONTEXTEX
{
public:
	std::map<unsigned int, USERCONTEXT*> userCtxMap;

	//procurar :)
	USERCONTEXT* GetUserCtxByUserIdx(int UserIdx);
	USERCONTEXT* GetUserCtxByCharIdx(int CharacterIdx);


	USERDATACONTEXT* GetUserDataCtxByCharIdx(int characterIdx);
	USERDATACONTEXT* GetUserDataCtxByUserIdx(WORD objIdx, OBJIDX_TYPE objType);
};

struct ITEMCONTEXT
{
	int*		itemforceProp;
	IObject*	pAttacker;
	IObject*	pDefender;
	void*		unk;
};

struct TRADECONTEXT
{

};

typedef struct
{
	int						iSkillIdx,
		iSkillLv;
	int 					SkillBook;

}SKILLUNIT;

typedef struct
{
	int						iTrgIdx;
}ActUnit;

typedef struct
{
	int iWarpIdx;
	int iLEVLmt;			// 워프하기위한 제한 레벨
	int iFee;				// 워프비용
	int iType;				// NPC Type
}WARPUNIT;

typedef struct
{
	int iKindIdx;
	int iItemOpt;
	int iReqSerial;
	int iReputationClass;
	int iDurationIdx;
	int iPrice;

}SHOPUNIT;

struct NPCSDATA
{
	int						iIndex,
		iPosX,
		iPosY,
		rangeCheck;

	NPC_TYPE				_ntType,
		_ntSubT;

	union
	{
		SHOPUNIT			sShopUnit[256];
		WARPUNIT			sWarpUnit[256];
		SKILLUNIT			sSkillUnit[1024];
		ActUnit				sActUnit[1024];
	};
};

struct TERRAINDATA
{
	BYTE TerrainDummy[215076];
};

struct TILEATTR
{
	DWORD					dwData[16 * 16];
};

struct TILECONTEXT
{
	int						iProcessIdx,
							iTileIdx,
							iPosX,
							iPosY;
	BOOL					bIsEdge;
	TILEATTR*				pTileAttr;
};

struct TILELIST
{
	int						iTileIdxCurProcessLayer[_TILELIST_DATALEN],
							iTileIdxOthBoundary[TILELIST_MAXNUM][_TILELIST_DATALEN],
							iTileIdxOthProcessLayerNum,
							iTileIdxNum;
};

struct WARPPOINT
{
	int iPosXPnt;
	int iPosYPnt;
};

struct WARPDATA
{
	int						_iIndex,
							iWorldIdx;
	//PROCESS IDX N?   LIDO NO EP8
	WARPPOINT				sWarpPoint[4];

	int						iTerrainIdx,	//colocar o id do world em novas TGS
							iTerrainMask,	//geralmente ?00004000
							iLEVLmt,
							iFee;
};

struct TILELISTEX
{
	TILELIST	tileList[9];
};

class CProcessLayer
{
public:
	///pega o buffer compatilhado
	char* AllocTransBuffer()
	{
		return ((char* (*)())0x08484424)();
	}
};

struct POINTX
{
	int x;
	int y;
};

typedef std::vector<POINTX> VEC_POINTX;

struct QDDYNMAPINFO
{
	int					iTileNo,
						iSTileX,
						iSTileY,
						iDTileX,
						iDTileY,
						iPPLinkIdx,
						iPPLinkSeq,
						iQDungeonIdx;

};	// QuestDungeon Dynamic Map Info

struct QUESTUNIT3
{
	DWORD	iKindIdx;
	int		iItemOpt,
			iItemNum;
};

struct TILEINFO
{
	TILECONTEXT			sTileCtx;
	TILELISTEX			sTileLst;
};

struct QDUNGEONDATA
{
	enum UserType
	{
		UT_SINGLE = 0,// 싱글 입장
		UT_PARTY = 1, // 파티 입장
		UT_ORDER = 2, // 선착순 입장
	};

	enum DugeonType
	{
		DT_QUEST = 0, // 퀘스트 던전
		DT_DDT = 1, // D.D.T 카드 던전
		DT_MISSION = 2, // 미션 던전
		DT_EVENT = 3, // 이벤트 던전
	};

	int					iIndex,
						iLevel,
						iStdLev,
						iStyleMastery,
						iStyleMasteryLv,
						iMaxUser,
						iMaxRank,
						iInstanceCnt,
						iInstanceLimit,
						iProcessIdx,
						iWarpIdxForFail,
						iWarpIdxForSucess,
						iWarpIdxForDead,
						iWorldIdx,
						iWarpIdx,
						iTileNum,
						iPPLinkNum,
						iPPLink[32],
						iPenalty[1],
						iReward[8],
						iRewardIdx,
						iGrade,
						iUseStdLv;
	int					maxLevel;
	BYTE				userType;
	BYTE				dungeonType;
	DWORD				closedTime;
	int iType;

	QUESTUNIT3			_quOpenItem;
	BOOL				bDBWrite,
						bRmOpenItem,
						bIsOpenItem,
						bIsAddRange;
	QDDYNMAPINFO*		dynmapinfo_;
	TILECONTEXT*		tilectx_[HOR_TILENUM * VER_TILENUM];
	TILEINFO*			tileinfo_;
	TILEINFO*			tileinfomap_[HOR_TILENUM * VER_TILENUM];
	TILEINFO*			tileinfomapforoldcood_[HOR_TILENUM * VER_TILENUM];
	int					iNextQDIdxForSuccess;
	int					iTerrainIdx;
	void*				missionmmap_;//aparentemente ?um map.
	int					dummy[1555];
	WORD				dwDummy;
};

struct MovimentCoords
{
	WORD y;
	WORD x;
};

typedef struct
{
	int							iCntType,
		iCount,
		iMaxCount;
	long long					iKindIdx;

}QDCOUNTINUNIT;

typedef struct : public SLOTBASE
{
	QDCOUNTINUNIT			sQDMissionUnit;				// 단위 미션(PP)

}QDMISSIONSLOT;

struct QD_PartternPart
{
	DWORD					unk;
	BOOL					isopen_;
	QDMISSIONSLOT			qdmissionslot[4];
	int						mazekey_;
	int						seq_;
	QD* qd_;
	//QDPPDATA*				qdppdata_;

};

struct CTile
{
public:
	SERVERCONTEXTEX*		m_pServerCtxEx;
	TERRAINDATA*			m_pTerrainData;
	WARPDATA*				m_pWarpDataForDead,
							*m_pWarpDataForLOut,
							*m_pWarpDataForRetn;

	int						worldIdx;
	int						posY;

	TILECONTEXT				m_tileCtx;
	TILELISTEX*				m_pTileListEx;

	QD*						m_pQDungon;
	QD_PartternPart*		m_pQDPPCtx;
	CWorld*					pWorld;
};

struct TILE_DATA_LIST
{
	DWORD TileList[1];
};

class CPathFind
{
public:
	BOOL CheckEnvironsPosition(POSITIONDATA* pPosData, int& move_position);
};

struct TILE_DATA_TEST
{
	TILE_DATA_LIST* TileData;						//0x0000
	DWORD					var_0004; //0x0004
	DWORD					var_0008; //0x0008
	DWORD					var_000C; //0x000C
	DWORD					var_0010; //0x0010
	DWORD					var_0014; //0x0014
	DWORD					var_0018; //0x0018
	DWORD					var_001C; //0x001C
	DWORD					var_0020; //0x0020
	DWORD					var_0024; //0x0024
	DWORD					var_0028; //0x0028
	DWORD					var_002C; //0x002C
	DWORD					var_0030; //0x0030
	DWORD					var_0034; //0x0034
	DWORD					var_0038; //0x0038
	DWORD					var_003C; //0x003C
	DWORD					var_0040; //0x0040
	DWORD					var_0044; //0x0044
	DWORD					var_0048; //0x0048
	DWORD					var_004C; //0x004C
	DWORD					var_0050; //0x0050
	DWORD					var_0054; //0x0054
	DWORD					var_0058; //0x0058
	DWORD					var_005C; //0x005C
	DWORD					var_0060; //0x0060
	DWORD					var_0064; //0x0064
	DWORD					var_0068; //0x0068
	DWORD					var_006C; //0x006C
	DWORD					var_0070; //0x0070
	DWORD					var_0074; //0x0074
	DWORD					var_0078; //0x0078
	DWORD					var_007C; //0x007C
	DWORD					var_0080; //0x0080
	DWORD					var_0084; //0x0084
	DWORD					var_0088; //0x0088
	DWORD					var_008C; //0x008C
	DWORD					var_0090; //0x0090
	DWORD					var_0094; //0x0094
	DWORD					var_0098; //0x0098
	DWORD					var_009C; //0x009C
	DWORD					var_00A0; //0x00A0
	DWORD					var_00A4; //0x00A0
};

struct OBJPTRNODE
{
	void*		pBase;
	OBJPTRNODE	*pPrev,
				*pNext;
	int			iIndex;

	OBJPTRNODE()
	{
		iIndex = 0;
		pBase = NULL;
		pPrev = 0;
		pNext = 0;
	}
};

class CGameManager
{
public:
	SERVERCONTEXTEX* m_pServerCtxEx;				//0x0000
	MOBSCONTEXT* m_pMobsCtx;//0x0004
	OBJPTRNODE m_sMobsNodeBegin;					//0x0008
	OBJPTRNODE* m_pMobsNodeEnd; //0x0018
	DWORD m_iMobsNodeNum; //0x001C
};

class IMobRepository
{
public:
	virtual ~IMobRepository() {};
	virtual int GetRepositoryIndex(void) = 0;
	virtual MOBSCONTEXT* FindMobIndexOf(int mmapIdx) = 0;
	virtual int RegisterMobData(int mmapIdx, int posX, int posY) = 0;
};

class GMMobRepository : public IMobRepository
{
public:
	typedef std::map<int, MOBSCONTEXT*>::iterator BEGINITER;
	typedef std::map<int, MOBSCONTEXT*>::const_iterator ENDITER;

	int								repositoryIndex_;
	CGameManager* gameManager;
	std::map<int, MOBSCONTEXT*>		mobList_;

	//impede que o mob renas? novamente - em caso n? queria o respawn dele usar o bIsForeverDeath = 1 pois se eu usar esta fun豫o o mob n? ataca

	void RemoveMob(int mobIndex)
	{
		((void(*)(GMMobRepository*, int mobIdx))0x08449408)(this, mobIndex);
	}
};

struct CWorld
{
	GMMobRepository* GetMobRepository()
	{
		return ((GMMobRepository * (*)(CWorld*))0x084495CC)(this);
	}

	MOBSCONTEXT* GetMobPtr(int row)
	{
		return ((MOBSCONTEXT * (*)(int, CWorld*, QD*))0x084607C8)(row, this, 0);
	}
	MOBSCONTEXT* GetMobPtr(int row, CWorld* pcWorld, QD* pQD)
	{
		return ((MOBSCONTEXT * (*)(int, CWorld*, QD*))0x084607C8)(row, this, 0);
	}

	void DelFromCell(int posX, int posY, QD* pQD)
	{
		((void(*)(CWorld*, int, int, QD*))0x0817419C)(this, posX, posY, pQD);
	}

	void AddToCell(int posX, int posY, QD* pQD)
	{
		((void(*)(CWorld*, int, int, QD*))0x08107C20)(this, posX, posY, pQD);
	}

	//CProcessLayer* ProcessLayer() const { return m_pProcessLayer; }

	INT64				var_0x0000;
	INT64				var_0x0008;
	INT64				var_0x0010;
	INT64				var_0x0018;
	INT64				var_0x0020;
	INT64				var_0x0028;
	INT64				var_0x0030;
	INT64				var_0x0038;
	INT64				var_0x0040;
	INT64				var_0x0048;
	INT64				var_0x0050;
	INT64				var_0x0058;
	INT64				var_0x0060;
	INT64				var_0x0068;
	INT64				var_0x0070;
	INT64				var_0x0078;
	INT64				var_0x0080;
	INT64				var_0x0088;
	INT64				var_0x0090;
	INT64				var_0x0098;
	INT64				var_0x00A0;
	INT64				var_0x00A8;
	INT64				var_0x00B0;
	INT64				var_0x00B8;
	INT64				var_0x00C0;
	INT64				var_0x00C8;
	INT64				var_0x00D0;
	INT64				var_0x00D8;
	INT64				var_0x00E0;
	INT64				var_0x00E8;
	INT64				var_0x00F0;
	INT64				var_0x00F8;
	INT64				var_0x0100;
	INT64				var_0x0108;
	INT64				var_0x0110;
	INT64				var_0x0118;
	INT64				var_0x0120;
	INT64				var_0x0128;
	INT64				var_0x0130;
	INT64				var_0x0138;
	INT64				var_0x0140;
	INT64				var_0x0148;
	INT64				var_0x0150;
	INT64				var_0x0158;
	INT64				var_0x0160;
	INT64				var_0x0168;
	INT64				var_0x0170;
	INT64				var_0x0178;
	INT64				var_0x0180;
	INT64				var_0x0188;
	int					e_WorldType;
	int					iWorldIdx;
	int					m_iWareHouseNpcIdx;
	int					iMobsCount;
	INT64				iUnk;
	SERVERCONTEXTEX* m_pServerCtxEx;
	MOBSCONTEXT* m_pMobsCtx;
	ITEMCONTEXT* m_pItemCtx;
	TRADECONTEXT* m_pTradeCtx;
	INT64 				var_0x01C8;
	int var_01D0;                                   //  0x01D0
	int var_01D4;                                   //  0x01D4
	int var_01D8;                                   //  0x01D8
	int var_01DC;                                   //  0x01DC
	int var_01E0;                                   //  0x01E0
	int var_01E4;                                   //  0x01E4
	int var_01E8;                                   //  0x01E8
	int var_01EC;                                   //  0x01EC
	int var_01F0;                                   //  0x01F0
	int var_01F4;                                   //  0x01F4
	int var_01F8;                                   //  0x01F8
	int var_01FC;                                   //  0x01FC
	int var_0200;                                   //  0x0200
	int var_0204;                                   //  0x0204
	int var_0208;                                   //  0x0208
	int var_020C;                                   //  0x020C
	int var_0210;                                   //  0x0210
	int var_0214;                                   //  0x0214
	int var_0218;                                   //  0x0218
	int var_021C;                                   //  0x021C
	int var_0220;                                   //  0x0220
	int var_0224;                                   //  0x0224
	int var_0228;                                   //  0x0228
	int var_022C;                                   //  0x022C
	int var_0230;                                   //  0x0230
	int var_0234;                                   //  0x0234
	int var_0238;                                   //  0x0238
	int var_023C;                                   //  0x023C
	int var_0240;                                   //  0x0240
	int var_0244;                                   //  0x0244
	int var_0248;                                   //  0x0248
	int var_024C;                                   //  0x024C
	int var_0250;                                   //  0x0250
	int var_0254;                                   //  0x0254
	int var_0258;                                   //  0x0258
	int var_025C;                                   //  0x025C
	int var_0260;                                   //  0x0260
	int var_0264;                                   //  0x0264
	int var_0268;                                   //  0x0268
	int var_026C;                                   //  0x026C
	int var_0270;                                   //  0x0270
	int var_0274;                                   //  0x0274
	int var_0278;                                   //  0x0278
	int var_027C;                                   //  0x027C
	int var_0280;                                   //  0x0280
	int var_0284;                                   //  0x0284
	int var_0288;                                   //  0x0288
	int var_028C;                                   //  0x028C
	int var_0290;                                   //  0x0290
	int var_0294;                                   //  0x0294
	int var_0298;                                   //  0x0298
	int var_029C;                                   //  0x029C
	int var_02A0;                                   //  0x02A0
	int var_02A4;                                   //  0x02A4
	int var_02A8;                                   //  0x02A8
	int var_02AC;                                   //  0x02AC
	int var_02B0;                                   //  0x02B0
	int var_02B4;                                   //  0x02B4
	int var_02B8;                                   //  0x02B8
	int var_02BC;                                   //  0x02BC
	int var_02C0;                                   //  0x02C0
	int var_02C4;                                   //  0x02C4
	int var_02C8;                                   //  0x02C8
	int var_02CC;                                   //  0x02CC
	int var_02D0;                                   //  0x02D0
	int var_02D4;                                   //  0x02D4
	int var_02D8;                                   //  0x02D8
	int var_02DC;                                   //  0x02DC
	int var_02E0;                                   //  0x02E0
	int var_02E4;                                   //  0x02E4
	int var_02E8;                                   //  0x02E8
	int var_02EC;                                   //  0x02EC
	int var_02F0;                                   //  0x02F0
	int var_02F4;                                   //  0x02F4
	int var_02F8;                                   //  0x02F8
	int var_02FC;                                   //  0x02FC
	int var_0300;                                   //  0x0300
	int var_0304;                                   //  0x0304
	int var_0308;                                   //  0x0308
	int var_030C;                                   //  0x030C
	int var_0310;                                   //  0x0310
	int var_0314;                                   //  0x0314
	int var_0318;                                   //  0x0318
	int var_031C;                                   //  0x031C
	int var_0320;                                   //  0x0320
	int var_0324;                                   //  0x0324
	int var_0328;                                   //  0x0328
	int var_032C;                                   //  0x032C
	int var_0330;                                   //  0x0330
	int var_0334;                                   //  0x0334
	int var_0338;                                   //  0x0338
	int var_033C;                                   //  0x033C
	int var_0340;                                   //  0x0340
	int var_0344;                                   //  0x0344
	int var_0348;                                   //  0x0348
	int var_034C;                                   //  0x034C
	int var_0350;                                   //  0x0350
	int var_0354;                                   //  0x0354
	int var_0358;                                   //  0x0358
	int var_035C;                                   //  0x035C
	int var_0360;                                   //  0x0360
	int var_0364;                                   //  0x0364
	int var_0368;                                   //  0x0368
	int var_036C;                                   //  0x036C
	int var_0370;                                   //  0x0370
	int var_0374;                                   //  0x0374
	int var_0378;                                   //  0x0378
	int var_037C;                                   //  0x037C
	int var_0380;                                   //  0x0380
	int var_0384;                                   //  0x0384
	int var_0388;                                   //  0x0388
	int var_038C;                                   //  0x038C
	int var_0390;                                   //  0x0390
	int var_0394;                                   //  0x0394
	int var_0398;                                   //  0x0398
	int var_039C;                                   //  0x039C
	int var_03A0;                                   //  0x03A0
	int var_03A4;                                   //  0x03A4
	int var_03A8;                                   //  0x03A8
	int var_03AC;                                   //  0x03AC
	int var_03B0;                                   //  0x03B0
	int var_03B4;                                   //  0x03B4
	int var_03B8;                                   //  0x03B8
	int var_03BC;                                   //  0x03BC
	int var_03C0;                                   //  0x03C0
	int var_03C4;                                   //  0x03C4
	int var_03C8;                                   //  0x03C8
	int var_03CC;                                   //  0x03CC
	int var_03D0;                                   //  0x03D0
	int var_03D4;                                   //  0x03D4
	int var_03D8;                                   //  0x03D8
	int var_03DC;                                   //  0x03DC
	int var_03E0;                                   //  0x03E0
	int var_03E4;                                   //  0x03E4
	int var_03E8;                                   //  0x03E8
	int var_03EC;                                   //  0x03EC
	int var_03F0;                                   //  0x03F0
	int var_03F4;                                   //  0x03F4
	int var_03F8;                                   //  0x03F8
	int var_03FC;                                   //  0x03FC
	int var_0400;                                   //  0x0400
	int var_0404;                                   //  0x0404
	int var_0408;                                   //  0x0408
	int var_040C;                                   //  0x040C
	int var_0410;                                   //  0x0410
	int var_0414;                                   //  0x0414
	int var_0418;                                   //  0x0418
	int var_041C;                                   //  0x041C
	int var_0420;                                   //  0x0420
	int var_0424;                                   //  0x0424
	int var_0428;                                   //  0x0428
	int var_042C;                                   //  0x042C
	int var_0430;                                   //  0x0430
	int var_0434;                                   //  0x0434
	int var_0438;                                   //  0x0438
	int var_043C;                                   //  0x043C
	int var_0440;                                   //  0x0440
	int var_0444;                                   //  0x0444
	int var_0448;                                   //  0x0448
	int var_044C;                                   //  0x044C
	int var_0450;                                   //  0x0450
	int var_0454;                                   //  0x0454
	int var_0458;                                   //  0x0458
	int var_045C;                                   //  0x045C
	int var_0460;                                   //  0x0460
	int var_0464;                                   //  0x0464
	int var_0468;                                   //  0x0468
	int var_046C;                                   //  0x046C
	int var_0470;                                   //  0x0470
	int var_0474;                                   //  0x0474
	int var_0478;                                   //  0x0478
	int var_047C;                                   //  0x047C
	int var_0480;                                   //  0x0480
	int var_0484;                                   //  0x0484
	int var_0488;                                   //  0x0488
	int var_048C;                                   //  0x048C
	int var_0490;                                   //  0x0490
	int var_0494;                                   //  0x0494
	int var_0498;                                   //  0x0498
	int var_049C;                                   //  0x049C
	int var_04A0;                                   //  0x04A0
	int var_04A4;                                   //  0x04A4
	int var_04A8;                                   //  0x04A8
	int var_04AC;                                   //  0x04AC
	int var_04B0;                                   //  0x04B0
	int var_04B4;                                   //  0x04B4
	int var_04B8;                                   //  0x04B8
	int var_04BC;                                   //  0x04BC
	int var_04C0;                                   //  0x04C0
	int var_04C4;                                   //  0x04C4
	int var_04C8;                                   //  0x04C8
	int var_04CC;                                   //  0x04CC
	int var_04D0;                                   //  0x04D0
	int var_04D4;                                   //  0x04D4
	int var_04D8;                                   //  0x04D8
	int var_04DC;                                   //  0x04DC
	int var_04E0;                                   //  0x04E0
	int var_04E4;                                   //  0x04E4
	int var_04E8;                                   //  0x04E8
	int var_04EC;                                   //  0x04EC
	int var_04F0;                                   //  0x04F0
	int var_04F4;                                   //  0x04F4
	int var_04F8;                                   //  0x04F8
	int var_04FC;                                   //  0x04FC
	int var_0500;                                   //  0x0500
	int var_0504;                                   //  0x0504
	int var_0508;                                   //  0x0508
	int var_050C;                                   //  0x050C
	int var_0510;                                   //  0x0510
	int var_0514;                                   //  0x0514
	int var_0518;                                   //  0x0518
	int var_051C;                                   //  0x051C
	int var_0520;                                   //  0x0520
	int var_0524;                                   //  0x0524
	int var_0528;                                   //  0x0528
	int var_052C;                                   //  0x052C
	int var_0530;                                   //  0x0530
	int var_0534;                                   //  0x0534
	int var_0538;                                   //  0x0538
	int var_053C;                                   //  0x053C
	int var_0540;                                   //  0x0540
	int var_0544;                                   //  0x0544
	int var_0548;                                   //  0x0548
	int var_054C;                                   //  0x054C
	int var_0550;                                   //  0x0550
	int var_0554;                                   //  0x0554
	int var_0558;                                   //  0x0558
	int var_055C;                                   //  0x055C
	int var_0560;                                   //  0x0560
	int var_0564;                                   //  0x0564
	int var_0568;                                   //  0x0568
	int var_056C;                                   //  0x056C
	int var_0570;                                   //  0x0570
	int var_0574;                                   //  0x0574
	int var_0578;                                   //  0x0578
	int var_057C;                                   //  0x057C
	int var_0580;                                   //  0x0580
	int var_0584;                                   //  0x0584
	int var_0588;                                   //  0x0588
	int var_058C;                                   //  0x058C
	int var_0590;                                   //  0x0590
	int var_0594;                                   //  0x0594
	int var_0598;                                   //  0x0598
	int var_059C;                                   //  0x059C
	int var_05A0;                                   //  0x05A0
	int var_05A4;                                   //  0x05A4
	int var_05A8;                                   //  0x05A8
	int var_05AC;                                   //  0x05AC
	int var_05B0;                                   //  0x05B0
	int var_05B4;                                   //  0x05B4
	int var_05B8;                                   //  0x05B8
	int var_05BC;                                   //  0x05BC
	int var_05C0;                                   //  0x05C0
	int var_05C4;                                   //  0x05C4
	int var_05C8;                                   //  0x05C8
	int var_05CC;                                   //  0x05CC
	int var_05D0;                                   //  0x05D0
	int var_05D4;                                   //  0x05D4
	int var_05D8;                                   //  0x05D8
	int var_05DC;                                   //  0x05DC
	int var_05E0;                                   //  0x05E0
	int var_05E4;                                   //  0x05E4
	int var_05E8;                                   //  0x05E8
	int var_05EC;                                   //  0x05EC
	int var_05F0;                                   //  0x05F0
	int var_05F4;                                   //  0x05F4
	int var_05F8;                                   //  0x05F8
	int var_05FC;                                   //  0x05FC
	int var_0600;                                   //  0x0600
	int var_0604;                                   //  0x0604
	int var_0608;                                   //  0x0608
	int var_060C;                                   //  0x060C
	int var_0610;                                   //  0x0610
	int var_0614;                                   //  0x0614
	int var_0618;                                   //  0x0618
	int var_061C;                                   //  0x061C
	int var_0620;                                   //  0x0620
	int var_0624;                                   //  0x0624
	int var_0628;                                   //  0x0628
	int var_062C;                                   //  0x062C
	int var_0630;                                   //  0x0630
	int var_0634;                                   //  0x0634
	int var_0638;                                   //  0x0638
	int var_063C;                                   //  0x063C
	int var_0640;                                   //  0x0640
	int var_0644;                                   //  0x0644
	int var_0648;                                   //  0x0648
	int var_064C;                                   //  0x064C
	int var_0650;                                   //  0x0650
	int var_0654;                                   //  0x0654
	int var_0658;                                   //  0x0658
	int var_065C;                                   //  0x065C
	int var_0660;                                   //  0x0660
	int var_0664;                                   //  0x0664
	int var_0668;                                   //  0x0668
	int var_066C;                                   //  0x066C
	int var_0670;                                   //  0x0670
	int var_0674;                                   //  0x0674
	int var_0678;                                   //  0x0678
	int var_067C;                                   //  0x067C
	int var_0680;                                   //  0x0680
	int var_0684;                                   //  0x0684
	int var_0688;                                   //  0x0688
	int var_068C;                                   //  0x068C
	int var_0690;                                   //  0x0690
	int var_0694;                                   //  0x0694
	int var_0698;                                   //  0x0698
	int var_069C;                                   //  0x069C
	int var_06A0;                                   //  0x06A0
	int var_06A4;                                   //  0x06A4
	int var_06A8;                                   //  0x06A8
	int var_06AC;                                   //  0x06AC
	int var_06B0;                                   //  0x06B0
	int var_06B4;                                   //  0x06B4
	int var_06B8;                                   //  0x06B8
	int var_06BC;                                   //  0x06BC
	int var_06C0;                                   //  0x06C0
	int var_06C4;                                   //  0x06C4
	int var_06C8;                                   //  0x06C8
	int var_06CC;                                   //  0x06CC
	int var_06D0;                                   //  0x06D0
	int var_06D4;                                   //  0x06D4
	int var_06D8;                                   //  0x06D8
	int var_06DC;                                   //  0x06DC
	int var_06E0;                                   //  0x06E0
	int var_06E4;                                   //  0x06E4
	int var_06E8;                                   //  0x06E8
	int var_06EC;                                   //  0x06EC
	int var_06F0;                                   //  0x06F0
	int var_06F4;                                   //  0x06F4
	int var_06F8;                                   //  0x06F8
	int var_06FC;                                   //  0x06FC
	int var_0700;                                   //  0x0700
	int var_0704;                                   //  0x0704
	int var_0708;                                   //  0x0708
	int var_070C;                                   //  0x070C
	int var_0710;                                   //  0x0710
	int var_0714;                                   //  0x0714
	int var_0718;                                   //  0x0718
	int var_071C;                                   //  0x071C
	int var_0720;                                   //  0x0720
	int var_0724;                                   //  0x0724
	int var_0728;                                   //  0x0728
	int var_072C;                                   //  0x072C
	int var_0730;                                   //  0x0730
	int var_0734;                                   //  0x0734
	int var_0738;                                   //  0x0738
	int var_073C;                                   //  0x073C
	int var_0740;                                   //  0x0740
	int var_0744;                                   //  0x0744
	int var_0748;                                   //  0x0748
	int var_074C;                                   //  0x074C
	int var_0750;                                   //  0x0750
	int var_0754;                                   //  0x0754
	int var_0758;                                   //  0x0758
	int var_075C;                                   //  0x075C
	int var_0760;                                   //  0x0760
	int var_0764;                                   //  0x0764
	int var_0768;                                   //  0x0768
	int var_076C;                                   //  0x076C
	int var_0770;                                   //  0x0770
	int var_0774;                                   //  0x0774
	int var_0778;                                   //  0x0778
	int var_077C;                                   //  0x077C
	int var_0780;                                   //  0x0780
	int var_0784;                                   //  0x0784
	int var_0788;                                   //  0x0788
	int var_078C;                                   //  0x078C
	int var_0790;                                   //  0x0790
	int var_0794;                                   //  0x0794
	int var_0798;                                   //  0x0798
	int var_079C;                                   //  0x079C
	int var_07A0;                                   //  0x07A0
	int var_07A4;                                   //  0x07A4
	int var_07A8;                                   //  0x07A8
	int var_07AC;                                   //  0x07AC
	int var_07B0;                                   //  0x07B0
	int var_07B4;                                   //  0x07B4
	int var_07B8;                                   //  0x07B8
	int var_07BC;                                   //  0x07BC
	int var_07C0;                                   //  0x07C0
	int var_07C4;                                   //  0x07C4
	int var_07C8;                                   //  0x07C8
	int var_07CC;                                   //  0x07CC
	int var_07D0;                                   //  0x07D0
	int var_07D4;                                   //  0x07D4
	int var_07D8;                                   //  0x07D8
	int var_07DC;                                   //  0x07DC
	int var_07E0;                                   //  0x07E0
	int var_07E4;                                   //  0x07E4
	int var_07E8;                                   //  0x07E8
	int var_07EC;                                   //  0x07EC
	int var_07F0;                                   //  0x07F0
	int var_07F4;                                   //  0x07F4
	int var_07F8;                                   //  0x07F8
	int var_07FC;                                   //  0x07FC
	int var_0800;                                   //  0x0800
	int var_0804;                                   //  0x0804
	int var_0808;                                   //  0x0808
	int var_080C;                                   //  0x080C
	int var_0810;                                   //  0x0810
	int var_0814;                                   //  0x0814
	int var_0818;                                   //  0x0818
	int var_081C;                                   //  0x081C
	int var_0820;                                   //  0x0820
	int var_0824;                                   //  0x0824
	int var_0828;                                   //  0x0828
	int var_082C;                                   //  0x082C
	int var_0830;                                   //  0x0830
	int var_0834;                                   //  0x0834
	int var_0838;                                   //  0x0838
	int var_083C;                                   //  0x083C
	int var_0840;                                   //  0x0840
	int var_0844;                                   //  0x0844
	int var_0848;                                   //  0x0848
	int var_084C;                                   //  0x084C
	int var_0850;                                   //  0x0850
	int var_0854;                                   //  0x0854
	int var_0858;                                   //  0x0858
	int var_085C;                                   //  0x085C
	int var_0860;                                   //  0x0860
	int var_0864;                                   //  0x0864
	int var_0868;                                   //  0x0868
	int var_086C;                                   //  0x086C
	int var_0870;                                   //  0x0870
	int var_0874;                                   //  0x0874
	int var_0878;                                   //  0x0878
	int var_087C;                                   //  0x087C
	int var_0880;                                   //  0x0880
	int var_0884;                                   //  0x0884
	int var_0888;                                   //  0x0888
	int var_088C;                                   //  0x088C
	int var_0890;                                   //  0x0890
	int var_0894;                                   //  0x0894
	int var_0898;                                   //  0x0898
	int var_089C;                                   //  0x089C
	int var_08A0;                                   //  0x08A0
	int var_08A4;                                   //  0x08A4
	int var_08A8;                                   //  0x08A8
	int var_08AC;                                   //  0x08AC
	int var_08B0;                                   //  0x08B0
	int var_08B4;                                   //  0x08B4
	int var_08B8;                                   //  0x08B8
	int var_08BC;                                   //  0x08BC
	int var_08C0;                                   //  0x08C0
	int var_08C4;                                   //  0x08C4
	int var_08C8;                                   //  0x08C8
	int var_08CC;                                   //  0x08CC
	int var_08D0;                                   //  0x08D0
	int var_08D4;                                   //  0x08D4
	int var_08D8;                                   //  0x08D8
	int var_08DC;                                   //  0x08DC
	int var_08E0;                                   //  0x08E0
	int var_08E4;                                   //  0x08E4
	int var_08E8;                                   //  0x08E8
	int var_08EC;                                   //  0x08EC
	int var_08F0;                                   //  0x08F0
	int var_08F4;                                   //  0x08F4
	int var_08F8;                                   //  0x08F8
	int var_08FC;                                   //  0x08FC
	int var_0900;                                   //  0x0900
	int var_0904;                                   //  0x0904
	int var_0908;                                   //  0x0908
	int var_090C;                                   //  0x090C
	int var_0910;                                   //  0x0910
	int var_0914;                                   //  0x0914
	int var_0918;                                   //  0x0918
	int var_091C;                                   //  0x091C
	int var_0920;                                   //  0x0920
	int var_0924;                                   //  0x0924
	int var_0928;                                   //  0x0928
	int var_092C;                                   //  0x092C
	int var_0930;                                   //  0x0930
	int var_0934;                                   //  0x0934
	int var_0938;                                   //  0x0938
	int var_093C;                                   //  0x093C
	int var_0940;                                   //  0x0940
	int var_0944;                                   //  0x0944
	int var_0948;                                   //  0x0948
	int var_094C;                                   //  0x094C
	int var_0950;                                   //  0x0950
	int var_0954;                                   //  0x0954
	int var_0958;                                   //  0x0958
	int var_095C;                                   //  0x095C
	int var_0960;                                   //  0x0960
	int var_0964;                                   //  0x0964
	int var_0968;                                   //  0x0968
	int var_096C;                                   //  0x096C
	int var_0970;                                   //  0x0970
	int var_0974;                                   //  0x0974
	int var_0978;                                   //  0x0978
	int var_097C;                                   //  0x097C
	int var_0980;                                   //  0x0980
	int var_0984;                                   //  0x0984
	int var_0988;                                   //  0x0988
	int var_098C;                                   //  0x098C
	int var_0990;                                   //  0x0990
	int var_0994;                                   //  0x0994
	int var_0998;                                   //  0x0998
	int var_099C;                                   //  0x099C
	int var_09A0;                                   //  0x09A0
	int var_09A4;                                   //  0x09A4
	int var_09A8;                                   //  0x09A8
	int var_09AC;                                   //  0x09AC
	int var_09B0;                                   //  0x09B0
	int var_09B4;                                   //  0x09B4
	int var_09B8;                                   //  0x09B8
	int var_09BC;                                   //  0x09BC
	int var_09C0;                                   //  0x09C0
	int var_09C4;                                   //  0x09C4
	int var_09C8;                                   //  0x09C8
	int var_09CC;                                   //  0x09CC
	int var_09D0;                                   //  0x09D0
	int var_09D4;                                   //  0x09D4
	int var_09D8;                                   //  0x09D8
	int var_09DC;                                   //  0x09DC
	int var_09E0;                                   //  0x09E0
	int var_09E4;                                   //  0x09E4
	int var_09E8;                                   //  0x09E8
	int var_09EC;                                   //  0x09EC
	int var_09F0;                                   //  0x09F0
	int var_09F4;                                   //  0x09F4
	std::map<int, NPCSDATA*> m_sNpcsData;
};

struct ACE_OS
{
	DWORD* funct1[1];
};

struct ACE_Thread_Mutex
{
	DWORD* funct1;
	DWORD* funct2;
	DWORD* funct3;
	DWORD* funct4;
	DWORD* funct5;
	DWORD* funct6;
	DWORD* funct7;
	DWORD* funct8;
};

struct ACE_MsgQueue
{
	DWORD* AceFunct1;
	DWORD* AceFunct2;
	DWORD* AceFunct3;
	DWORD* AceFunct4;
	DWORD* AceFunct5;
	DWORD* AceFunct6;
	DWORD* AceFunct7;
	DWORD* AceFunct8;
	DWORD* AceFunct9;
	DWORD* AceFunct10;
	DWORD* AceFunct11;
	DWORD* AceFunct12;
	DWORD* AceFunct13;
	DWORD* AceFunct14;
	DWORD* AceFunct15;
	DWORD* AceFunct16;
	DWORD* AceFunct17;
	DWORD* AceFunct18;
	DWORD* AceFunct19;
	DWORD* AceFunct20;
	DWORD* AceFunct21;
	DWORD* AceFunct22;
	DWORD* AceFunct23;
	DWORD* AceFunct24;
	DWORD* AceFunct25;
	DWORD* AceFunct26;
	DWORD* AceFunct27;
	DWORD* AceFunct28;
	DWORD* AceFunct29;
	DWORD* AceFunct30;
	DWORD* AceFunct31;
	DWORD* AceFunct32;
	DWORD* AceFunct33;
	DWORD* AceFunct34;
	DWORD* AceFunct35;
	DWORD* AceFunct36;
	DWORD* AceFunct37;
	DWORD* AceFunct38;
	DWORD* AceFunct39;
	DWORD* AceFunct40;
	DWORD* AceFunct41;
	DWORD* AceFunct42;
	DWORD* AceFunct43;
	DWORD* AceFunct44;
	DWORD* AceFunct45;
	DWORD* AceFunct46;
	DWORD* AceFunct47;
	DWORD* AceFunct48;
	DWORD* AceFunct49;
	DWORD* AceFunct50;
	DWORD* AceFunct51;
	DWORD* AceFunct52;
	DWORD* AceFunct53;
	DWORD* AceFunct54;
	DWORD* AceFunct55;
	DWORD* AceFunct56;
	DWORD* AceFunct57;
};

struct OBJIDXDATA
{
	short sObjIdxData;
	BYTE bWorldMob;
	BYTE objectType;

	DWORD get()
	{
		return *(DWORD*)this;
	}
};

struct POSITIONDATA
{
	WAYPOINTSET				sWayPointSet;
	BOOL					bIsMoving;
	INT64					dwMvBgnTime;
	int						iPosXBegin,
							iPosYBegin,
							iPrecisePosXCur,
							iPrecisePosYCur,
							iPosXCur,
							iPosYCur,
							iPosXEnd,
							iPosYEnd;
	BOOL					bIsDReckoning;
	int						iCurt;
	float					fBase,
							fDist,
							fSine,
							fCosn,
							fSped,
							fBikeSpeed,
							fDummy;
	int						iSpeed;
	int						iBikeSpeed;
	int						iDummy2;
	CTile*					pTile;
	int						iTileX,
							iTileY;
	QD*						pQDungeon;
	QD_PartternPart*		pPP;
	CWorld*					pWorld;
	INT64					var_0x198;

	int GetCurrentWorld() const { return this->pWorld ? this->pWorld->iWorldIdx : 0; }

	MOBSCONTEXT* GetMobPtr(int row)
	{
		return this->pWorld ? ((MOBSCONTEXT*(*)(int, CWorld*, QD*))0x084607C8)(row, this->pWorld, this->pQDungeon) : nullptr;
	}

	MOBSCONTEXT* GetMobPtr(int row, CWorld* pcWorld, QD* pQD)
	{
		return this->pWorld ? ((MOBSCONTEXT * (*)(int, CWorld*, QD*))0x084607C8)(row, this->pWorld, this->pQDungeon) : nullptr;
	}
};

struct PARAMETERS
{
	QWORD					expStatus;	
	int						iLEV;	
	int						iSTR;	
	int						iDEX;	
	int						iINT;	
	int						iSTR2;	
	int						iDEX2;	
	int						iINT2;	
	int						var_0x178;
	INT64					iHP;	
	int						iMP;	
	int						iSP;	
	int						iCurBP;	
	int						iMaxBP;
	INT64					var_0x1E0;
	INT64					iHPMax;
	int						iMPMax;
	int						iSPMax;
	INT64					iHPUseMx;	
	int						iMPUseMx;	
	int						iSPUseMx;	
	INT64					iMaxUnknown_208;
	INT64					iPhyAttMax;	
	INT64					iPhyAttMin;	
	INT64					iMagAttVal;
	INT64					iMagAttMin;
	INT64					iAttackR;
	INT64					iCriticalNR; //taxa dada por outras coisa "exceto an?s"
	int						iRingMaxCriticalR;
	int						iRingCriticalR;
	int						iMaxCriticalRate;
	INT64					iCriticalDamage;
	INT64					iCriticalRate;

	INT64					iSkillAmpS;
	INT64					iSkillAmpM;

	INT64					iHitRate; //acerto
	INT64					iDrillerRate; //perfura豫o
	INT64					iAddDamage;	
	INT64					iMinDmgRate;	//238 -> aplicada pelo rank.scp do personagem
	INT64					iFinalDmg;	
	INT64					iIgnoreHitRate;	//ignorar acerto
	INT64					iIgnoreBlock;	//ignorar bloqueio
	INT64					iIgnoreResCriticalRate;	//ignorar resistencia a taxa critica
	INT64					iIgnoreResDmg;	//ignorar resistencia a dano critico
	INT64					iUndoIgnoreEvasion;	//desfazer ignorar evas?
	INT64					iIgnoreFallRes;	//ingorar resistencia a queda
	INT64					iIgnoreLungRes;	//ingorar resistencia a investida
	INT64					iIgnoreStunRes;	//ingorar resistencia a atordoamento
	INT64					iIncreaseNormalAttack;	//aumento de ataque normal em %
	INT64					iUndoIgnoreDrillerRate;	//desfazer ignorar perfura豫o
	INT64					iPVE_SwordSkillAmp;		//somente PVE
	INT64					iPVE_MagicSkillAmp;		//somente PVE
	INT64					iPVE_CriticalDamage;	//somente PVE
	INT64					iPVP_DrillRate;			//somente Perfura豫o PVE
	INT64					iPVP_SwordSkillAmp;	//somente PVP
	INT64					iPVP_MagicSkillAmp;	//somente PVP
	INT64					iPVP_CriticalDamage;	//somente PVP
	int						iPVP_Attack;	//somente PVP
	int						iPVE_Attack;	//somente PVP
	int						iPVP_MagicAttack;	//somente PVP
	int						iPVE_MagicAttack;	//somente PVE
	INT64					iPVP_AttackR;	//somente PVP
	INT64					iPVE_AttackR;	//somente PVE
	INT64					iPVP_CriticalR;	//somente PVP
	INT64					iPVP_MaxCriticalR1;	//somente PVP
	int						iPVP_MaxCriticalRate;	//somente PVP
	INT64					iPVE_CriticalR;	//somente PVE
	INT64					iPVE_MaxCriticalR;	//somente PVE
	int						iPVE_MaxCriticalRate;	//somente PVE
	INT64					var_0x364;	
	INT64					var_0x36C;	
	INT64					iPVP_DrillerRate; //perfura豫o pvp
	INT64					iPVP_IncreaseNormalAttack; // %
	INT64					iPVE_IncreaseNormalAttack; // %
	INT64					var_0x38C;
	INT64					var_0x394;
	INT64					iPVP_AddDamage;
	INT64					iPVE_AddDamage;
	INT64					var_0x3AC;
	INT64					var_0x3B4;
	INT64					var_0x3BC;
	INT64					var_0x3C4;
	INT64					var_0x3CC;
	INT64					var_0x3D4;
	INT64					var_0x3DC;
	INT64					var_0x3E4;
	INT64					iPVP_IgnoreReduceDamage;
	INT64					iPVE_IgnoreReduceDamage;
	INT64					var_0x3FC;
	INT64					var_0x404;
	INT64					iDefense;
	INT64					var_0x414;
	INT64					iEvasion;
	INT64					iEvasionR;
	INT64					iDamageReduce;
	INT64					iCriticalRateResist;
	INT64					iCriticalDamageResist;
	INT64					iResistStun;
	INT64					iResistFall;
	INT64					iResistLunge;
	INT64					iResistImobility;
	INT64					iAmpResist;
	INT64					iSupressionResist;
	INT64					iSilenceResist;
	INT64					iIgnoreDrillRate;
	INT64					iIgnoreHitRate2;
	INT64					iUndoIgnoreDamageReduce;
	INT64					UndoIgnoreEvasion;
	INT64					iReduceDamage;
	INT64					iPVP_ResistAttackAmp;
	INT64					iPVP_ResistMagicAttackAmp;
	INT64					iPVE_Defense;
	INT64					iPVE_ReduceDamage;
	INT64					iPVE_IgnoreDrillRate;
	INT64					var_0x4CC;
	INT64					iPVP_Defense;
	INT64					var_0x4DC;
	INT64					var_0x4E4;
	INT64					var_0x4EC;
	INT64					var_0x4F4;
	INT64					iPVP_ReduceDamage;
	INT64					iPVP_IgnoreDrillRate;
	INT64					var_0x50C;
	INT64					var_0x514;
	INT64					var_0x51C;
	INT64					var_0x524;
	INT64					var_0x52C;
	INT64					var_0x534;
	INT64					iRouboHPPercent;
	INT64					iTheftHpMax;
	INT64					iHpAutoHeal;
	INT64					iRouboMPPercent;
	INT64					var_0x55C;
	int						iMPAutoReal;
	int						iBattleModeTimeExtend;
	int						iAuraExtendTimeLimit;
	int						iBoostHpRegenPercent;
	INT64					var_0x574;
	int						var_0x57C;
	INT64					var_0x584;
	INT64					var_0x58C;
	INT64					var_0x594;
	INT64					var_0x59C;
	INT64					iHP2;
	INT64					var_0x5A8;
	INT64					var_0x5B0;
	INT64					var_0x5B8;
	UINT64					var_005C0;
	UINT64					var_005C8;
	UINT64					var_005D0;
	UINT64					var_005D8;
	UINT64					var_005E0;
	UINT64					var_005E8;
	DWORD					var_005F0;
	BYTE					nation;
	BYTE					var_005F5;
	BYTE					var_005F6;
	BYTE					var_005F7;
	UINT64					var_005F8;
	UINT64					var_00600;
	UINT64					var_00608;
	UINT64					var_00610;
	UINT64					var_00618;
	UINT64					var_00620;
	UINT64					var_00628;
	UINT64					var_00630;
	UINT64					var_00638;
	UINT64					var_00640;
	UINT64					var_00648;
	UINT64					var_00650;
	UINT64					var_00658;
	UINT64					var_00660;
	UINT64					var_00668;
	UINT64					var_00670;
	UINT64					var_00678;
	UINT64					var_00680;
	UINT64					var_00688;
	UINT64					var_00690;
	UINT64					var_00698;
	UINT64					var_006A0;
	UINT64					var_006A8;
	UINT64					var_006B0;
	UINT64					var_006B8;
	UINT64					var_006C0;
	UINT64					var_006C8;
	UINT64					var_006D0;
	UINT64					var_006D8;
	UINT64					var_006E0;
	UINT64					var_006E8;
	UINT64					var_006F0;
	UINT64					var_006F8;
	UINT64					var_00700;
	UINT64					var_00708;
	UINT64					var_00710;
	UINT64					var_00718;
	UINT64					var_00720;
	UINT64					var_00728;
	UINT64					var_00730;
	UINT64					var_00738;
	UINT64					var_00740;
	UINT64					var_00748;
	UINT64					var_00750;
	UINT64					var_00758;
	UINT64					var_00760;
	UINT64					var_00768;
	UINT64					var_00770;
	UINT64					var_00778;
	UINT64					var_00780;
	UINT64					var_00788;
	UINT64					var_00790;
	UINT64					var_00798;
	UINT64					var_007A0;
	UINT64					var_007A8;
	UINT64					var_007B0;
	UINT64					var_007B8;
	UINT64					var_007C0;
	UINT64					var_007C8;
	UINT64					var_007D0;
	UINT64					var_007D8;
	UINT64					var_007E0;
	UINT64					var_007E8;
	UINT64					var_007F0;
	UINT64					var_007F8;
	UINT64					var_00800;
	UINT64					var_00808;
	UINT64					var_00810;
	UINT64					var_00818;
	UINT64					var_00820;
	UINT64					var_00828;
	UINT64					var_00830;
	UINT64					var_00838;
	USERDATACONTEXT*		pUserDataCtx; //uso na parameters
};

struct CREATUREBASE : public IObject
{
	POSITIONDATA			sPosData;
	PARAMETERS				sParameters;
};

struct DROPCONTEXT
{
	DropUnit* pWorldDropUnit; //0x0520 - lista de drops
	DWORD iWorldDropUnitNum;//0x0524 - drops do mob no canal
};

struct MOBSCONTEXT : public CREATUREBASE
{
	INT64					var_0x0848;
	DWORD					iIndex;
	OBJIDXDATA				objIdx;
	MOBS_PHASE				_mpMPhase;
	CGameManager*			pBaseGameMgr;
	CGameManager*			pGameMgr;
	INT64					sObjNode1;
	INT64					var_0x0878;
	INT64*					pBaseGameMgr2;
	INT64*					pBaseGameMgr3;
	int						var_0x088E;
	MOBSDATA				sMobsData;
	DROPCONTEXT				sMobsDrops;
	DWORD					iSpawnCoordsCount;
	MovimentCoords			sSpawnCoordenates[400];
	DWORD					iSPosX;
	DWORD					iSPosY;
	DWORD					iCPosX;
	DWORD					iCPosY;
	DWORD					iFindRests;
	DWORD					iValidDist;
	DWORD					iValidOffset;
	DWORD					dwNextTime;
	DWORD					dwReChagHPTime;
	INT64					iNextCheckUser;
	DWORD					dwEscapeTime;
	DWORD					bExistBFX;
	DWORD					bExistDelay;
	BOOL					bSpawnDefault;
	MOBS_PHASE				_mpMPhaseMove00;
	MOBS_PHASE				_mpMPhaseFind00;
	MOBS_PHASE				_mpMPhaseChase0; 
	MOBS_PHASE				_mpMPhaseBattle; 
	MOBS_PHASE				_mpMPhaseDead00; 
	MOBS_PHASE				_mpMPhaseEvent0;//Quando ocorre um evento (morte) Phase
	MOBS_PHASE				_mpMPhaseEventS;//geracao de evento
	MOBS_PHASE				_mpMPhaseEventK;//evento KILL
	MOBS_PHASE				_mpMEventPhase0;//na hora do evento Phase
	MOBS_PHASE				_mpMEventPhase1;//
	MOBS_PHASE				_mpMEventPhase2;//
	MOBS_PHASE				_mpMEventPhase3;//
	MOBS_PHASE				_mpMEventPhase4;//
	MOBS_PHASE				_mpMPhaseStun00;
	MOBS_PHASE				_mpMPhaseAttVld;//Reduza o alcance da habilidade
	int						iEvtMobsPhase[MAX_MOBSEVTLISTNUM];			
	int						iEvtMobsList[MAX_MOBSEVTLISTNUM];			
	int						iEvtInterval[MAX_MOBSEVTLISTNUM];			
	DWORD					iSpwnCount;
	DWORD					bIsInfinitySpwn;
	DWORD					bIsForeverDeath;
	DWORD					dwSpwnInterval;
	DWORD					dwEvtInterval;
	INT64					iPPIdx;									//?um vector?
	INT64					iPPIdx2;									//?um vector?
	INT64					var_0x010D0;
	INT64					var_0x010D8;
	INT64					var_0x010E0;
	INT64					var_0x010E8;
	DWORD					var_0x010F0;
	DWORD					var_0x010F4;
	DWORD					var_0x010F8;
	DWORD					var_0x010FC;
	INT64					iHP30p;
	INT64					iHP50p; 
	BOOL					bIsChasing; 
	BOOL					bIsAttackted; 
	BOOL					bIsDead;
	BOOL					bIsStun;
	BOOL					isMissionGate;
	BOOL					bIsWall;
	BOOL					bIsDurDamage; 
	BOOL					bIsEnervation;
	MOBSSKILLDATA*			pActiveSkill; 
	ATTACKERDATA			sAttackerData;					
	ATTACKERDATA			sDefenderData;					
	USERDATACONTEXT*		pAtackingTarget; //QUEM ELE EST?ATACANDO
	INT64					iNextAttackToTarget;
	UINT64					var_01068;
	UINT64					var_01070;
	UINT64					var_01078;
	UINT64					var_01080;
	UINT64					var_01088;
	UINT64					var_01090;
	UINT64					var_01098;
	UINT64					var_010A0;
	UINT64					var_010A8;
	UINT64					var_010B0;
	UINT64					var_010B8;
	UINT64					var_010C0;
	UINT64					var_010C8;
	UINT64					var_010D0;
	UINT64					var_010D8;
	UINT64					var_010E0;
	UINT64					var_010E8;
	UINT64					var_010F0;
	UINT64					var_010F8;
	UINT64					var_01100;
	UINT64					var_01108;
	UINT64					var_01110;
	UINT64					var_01118;
	UINT64					var_01120;
	UINT64					var_01128;
	UINT64					var_01130;
	UINT64					var_01138;
	UINT64					var_01140;
	UINT64					var_01148;
	UINT64					var_01150;
	UINT64					var_01158;
	UINT64					var_01160;
	UINT64					var_01168;
	UINT64					var_01170;
	UINT64					var_01178;
	UINT64					var_01180;
	UINT64					var_01188;
	UINT64					var_01190;
	UINT64					var_01198;
	UINT64					var_011A0;
	UINT64					var_011A8;
	UINT64					var_011B0;
	UINT64					var_011B8;
	UINT64					var_011C0;
	UINT64					var_011C8;
	UINT64					var_011D0;
	UINT64					var_011D8;
	UINT64					var_011E0;
	UINT64					var_011E8;
	UINT64					var_011F0;
	UINT64					var_011F8;
	UINT64					var_01200;
	UINT64					var_01208;
	UINT64					var_01210;
	UINT64					var_01218;
	UINT64					var_01220;
	UINT64					var_01228;
	UINT64					var_01230;
	UINT64					var_01238;
	UINT64					var_01240;
	UINT64					var_01248;
	UINT64					var_01250;
	UINT64					var_01258;
	UINT64					var_01260;
	UINT64					var_01268;
	UINT64					var_01270;
	UINT64					var_01278;
	UINT64					var_01280;
	UINT64					var_01288;
	UINT64					var_01290;
	UINT64					var_01298;
	UINT64					var_012A0;
	UINT64					var_012A8;
	UINT64					var_012B0;
	UINT64					var_012B8;
	UINT64					var_012C0;
	UINT64					var_012C8;
	UINT64					var_012D0;
	UINT64					var_012D8;
	UINT64					var_012E0;
	UINT64					var_012E8;
	UINT64					var_012F0;
	UINT64					var_012F8;
	UINT64					var_01300;
	UINT64					var_01308;
	UINT64					var_01310;
	UINT64					var_01318;
	UINT64					var_01320;
	UINT64					var_01328;
	UINT64					var_01330;
	UINT64					var_01338;
	UINT64					var_01340;
	UINT64					var_01348;
	UINT64					var_01350;
	UINT64					var_01358;
	UINT64					var_01360;
	UINT64					var_01368;
	UINT64					var_01370;
	UINT64					var_01378;
	UINT64					var_01380;
	UINT64					var_01388;
	UINT64					var_01390;
	UINT64					var_01398;
	UINT64					var_013A0;
	UINT64					var_013A8;
	UINT64					var_013B0;
	UINT64					var_013B8;
	UINT64					var_013C0;
	UINT64					var_013C8;
	UINT64					var_013D0;
	UINT64					var_013D8;
	UINT64					var_013E0;
	UINT64					var_013E8;
	UINT64					var_013F0;
	UINT64					var_013F8;
	UINT64					var_01400;
	UINT64					var_01408;
	UINT64					var_01410;
	UINT64					var_01418;
	UINT64					var_01420;
	UINT64					var_01428;
	UINT64					var_01430;
	UINT64					var_01438;
	UINT64					var_01440;
	UINT64					var_01448;
	UINT64					var_01450;
	UINT64					var_01458;
	UINT64					var_01460;
	UINT64					var_01468;
	UINT64					var_01470;
	UINT64					var_01478;
	UINT64					var_01480;
	UINT64					var_01488;
	UINT64					var_01490;
	UINT64					var_01498;
	UINT64					var_014A0;
	UINT64					var_014A8;
	UINT64					var_014B0;
	UINT64					var_014B8;
	UINT64					var_014C0;
	UINT64					var_014C8;
	UINT64					var_014D0;
	UINT64					var_014D8;
	UINT64					var_014E0;
	UINT64					var_014E8;
	UINT64					var_014F0;
	UINT64					var_014F8;
	UINT64					var_01500;
	UINT64					var_01508;
	UINT64					var_01510;
	UINT64					var_01518;
	UINT64					var_01520;
	UINT64					var_01528;
	UINT64					var_01530;
	UINT64					var_01538;
	UINT64					var_01540;
	UINT64					var_01548;
	UINT64					var_01550;
	UINT64					var_01558;
	UINT64					var_01560;
	UINT64					var_01568;
	UINT64					var_01570;
	UINT64					var_01578;
	UINT64					var_01580;
	UINT64					var_01588;
	UINT64					var_01590;
	UINT64					var_01598;
	UINT64					var_015A0;
	UINT64					var_015A8;
	UINT64					var_015B0;
	UINT64					var_015B8;
	UINT64					var_015C0;
	UINT64					var_015C8;
	UINT64					var_015D0;
	UINT64					var_015D8;
	UINT64					var_015E0;
	UINT64					var_015E8;
	UINT64					var_015F0;
	UINT64					var_015F8;
	UINT64					var_01600;
	UINT64					var_01608;
	UINT64					var_01610;
	UINT64					var_01618;
	UINT64					var_01620;
	UINT64					var_01628;
	UINT64					var_01630;
	UINT64					var_01638;
	UINT64					var_01640;
	UINT64					var_01648;
	UINT64					var_01650;
	UINT64					var_01658;
	UINT64					var_01660;
	UINT64					var_01668;
	UINT64					var_01670;
};

struct USERLIST_TEST
{
	DWORD var_0000; //0x0000
	DWORD var_0004; //0x0004
	DWORD var_0008; //0x0008
	DWORD var_000C; //0x000C
};

struct QDDATA
{
	DWORD dungeonIndex;
	DWORD Level;
	DWORD StandardLevel;
	int BattleStyle[2];
	DWORD MaxUser;
	DWORD unk;
	DWORD currentInstances;
	DWORD InstanceLimit;
	DWORD gap24;
	signed int WarpIdxForFail;
	signed int WarpIdxForSucess;
	DWORD WarpIndexForDead;
	DWORD WorldIdx;
	signed int WarpIdx;
	signed int signed3C;
	DWORD linkCount;
	DWORD dword44;
	BYTE PPLink[132];
	DWORD UseStdLv;
	DWORD MissionTimeout;
	BYTE gapD4[4];
	BYTE DungeonType;
	DWORD Party_Type;
	INT64 OpenItem[2];
	BYTE gapF0[8];
	DWORD DBWrite;
	DWORD RemoveItem;
	DWORD dword100;
	DWORD bAddRange;
	INT64 qword108;
	BYTE gap110[6152];
	DWORD NextQDIdxForSuccess;
};

struct QD
{
	INT64 vTables;															//0x0000
	CWorld* cWorld_;
	QDDATA* pQDData; //verificar depois, cont? dados da dungeon
	DWORD m_iMobsCnt;														//0x0008
	QDUNGEONDATA* qddata_;
	DWORD var_0010;															//0x0010
	DWORD var_0014;															//0x0014
	DWORD Var_0018;															//0x0018
	USERLIST_TEST* userlist_;												//0x001C //USERCONTEXT
	DWORD Var_0020;															//0x0020
	WORD dungeonCodeID;														//0x0024
	WORD wUnknown1;															//0x0024
	CTile* m_cTileObjMapping[HOR_TILENUM * VER_TILENUM];//0x0028
	TILECONTEXT m_sTileCtxMapping[HOR_TILENUM * VER_TILENUM];
	TILEATTR m_sTileAttrMapping[MAX_TILENUM];
	TILEATTR m_sTileAttrUnMvble[MAX_TILENUM];
	DWORD* m_pTileList;
	DWORD* dwUnknown2;
	DWORD* dwUnknown3;
	MOBSCONTEXT* mobsctx_;
	DWORD* dwUnknown5;
	DWORD* dwUnknown6;
	DWORD* dwUnknown7;
	DWORD* dwUnknown8;

	MOBSCONTEXT* GetQDMobData(int index) { return &this->mobsctx_[index]; }

	int GetUsersCount() const
	{
		auto iter = *(INT64**)userlist_;
		int userCount = 0;
		while (iter != (INT64*)userlist_)
		{
			iter = (INT64*)*iter;
			++userCount;
		}
		return userCount;
	}

	//int GetKilledMobCount(int mobID)
	//{
	//	int count = 0;
	//	for (int i = 0; i < this->m_iMobsCnt; i++)
	//	{
	//		auto mobData = GetQDMobData(i);
	//		if (mobData)
	//		{
	//			int data = offsetof(MOBSCONTEXT, var_0EB0);
	//
	//			if (mobData->sParameters.iHP == 0 && (mobData->bIsDead == true) && mobData->_mpMPhase != MOBS_PHASE::MP_NONE_____ && mobData->sMobsData.iSpeciesIdx == mobID)
	//			{
	//				count++;
	//			}
	//		}
	//	}
	//	return count;
	//}
	//
	//int GetAliveMobCount(int mobID)
	//{
	//	int count = 0;
	//	if (this->mobsctx_)
	//	{
	//		for (int i = 0; i < this->m_iMobsCnt; i++)
	//		{
	//			auto mobData = &this->mobsctx_[i];
	//			if (mobData)
	//			{
	//				if (mobData->sParameters.iHP == 0 && mobData->_mpMPhase != MOBS_PHASE::MP_NONE_____ && mobData->sMobsData.iSpeciesIdx == mobID)
	//				{
	//					count++;
	//				}
	//			}
	//		}
	//	}
	//	return count;
	//}

	//FOR DUNGEONS
	void UserLink(USERCONTEXT* pUserCtx) { ((void(*)(QD*, USERCONTEXT*))0x08410D48)(this, pUserCtx); }
	void EnterDungeon(USERCONTEXT* pUserCtx) { ((void(*)(QD*, USERCONTEXT*))0x08410E5C)(this, pUserCtx); }
	void SendNFYPacketToDungeonMembers(USERCONTEXT* pUserCtx, BYTE pUnknown) { ((void(*)(QD*, USERCONTEXT*, BYTE))0x084098A4)(this, pUserCtx, pUnknown); }
};

struct USERCONTEXT
{
	char dummyBytes[200];
	char ipAddress[16];
	char dummyBytes2[16];
	int* pData;
	char dummyBytes3[24];
	int* pProcessLayer;

	void UnicastE(void* packet, int len)
	{
		reinterpret_cast<void* (*)(USERCONTEXT*, void*, int)>(0x0075D4E0)(this, packet, len);
	}

	void UnicastW(CTile* pTile, void* packet, int len)
	{
		reinterpret_cast<void* (*)(CTile*, void*, int)>(0x0075CBA0)(pTile, packet, len);
	}

	void SendErrorCode(MAINCMD_VALUE_EX errorCMD, ErrorCode errorType, WORD reqMainCmd, WORD deadType)
	{
		sNFS_LASTERRCODE	err;
		err.wMagicCode		= 0xB7E2;
		err.wPayLoadLen		= sizeof(sNFS_LASTERRCODE);
		err.wMainCmd		= MAINCMD_VALUE_EX::NFS_LASTERRCODE;
		err.wReqMainCmd		= errorCMD;
		err.wLastErrCode	= errorType;
		err.wReqMainCmdEx	= reqMainCmd;
		err.wDeadType		= deadType;
		UnicastE(&err, err.wPayLoadLen);
	}
};

struct USERDATACONTEXT : public CREATUREBASE
{
	DWORD var_00848;								   //  0x00848
	DWORD var_0084C;                                   //  0x0084C
	DWORD var_00850;                                   //  0x00850
	DWORD var_00854;                                   //  0x00854
	DWORD var_00858;                                   //  0x00858
	DWORD var_0085C;                                   //  0x0085C
	DWORD var_00860;                                   //  0x00860
	DWORD var_00864;                                   //  0x00864
	DWORD var_00868;                                   //  0x00868
	DWORD var_0086C;                                   //  0x0086C
	DWORD var_00870;                                   //  0x00870
	DWORD var_00874;                                   //  0x00874
	DWORD var_00878;                                   //  0x00878
	DWORD var_0087C;                                   //  0x0087C
	DWORD var_00880;                                   //  0x00880
	DWORD var_00884;                                   //  0x00884
	DWORD var_00888;                                   //  0x00888
	DWORD var_0088C;                                   //  0x0088C
	DWORD var_00890;                                   //  0x00890
	DWORD var_00894;                                   //  0x00894
	DWORD var_00898;                                   //  0x00898
	DWORD var_0089C;                                   //  0x0089C
	DWORD var_008A0;                                   //  0x008A0
	DWORD var_008A4;                                   //  0x008A4
	DWORD var_008A8;                                   //  0x008A8
	DWORD var_008AC;                                   //  0x008AC
	DWORD var_008B0;                                   //  0x008B0
	DWORD var_008B4;                                   //  0x008B4
	DWORD var_008B8;                                   //  0x008B8
	DWORD var_008BC;                                   //  0x008BC
	DWORD var_008C0;                                   //  0x008C0
	DWORD var_008C4;                                   //  0x008C4
	DWORD var_008C8;                                   //  0x008C8
	DWORD var_008CC;                                   //  0x008CC
	DWORD var_008D0;                                   //  0x008D0
	DWORD var_008D4;                                   //  0x008D4
	DWORD var_008D8;                                   //  0x008D8
	DWORD var_008DC;                                   //  0x008DC
	DWORD var_008E0;                                   //  0x008E0
	DWORD var_008E4;                                   //  0x008E4
	DWORD var_008E8;                                   //  0x008E8
	DWORD var_008EC;                                   //  0x008EC
	DWORD var_008F0;                                   //  0x008F0
	DWORD var_008F4;                                   //  0x008F4
	DWORD var_008F8;                                   //  0x008F8
	DWORD var_008FC;                                   //  0x008FC
	DWORD var_00900;                                   //  0x00900
	DWORD var_00904;                                   //  0x00904
	DWORD var_00908;                                   //  0x00908
	DWORD var_0090C;                                   //  0x0090C
	DWORD var_00910;                                   //  0x00910
	DWORD var_00914;                                   //  0x00914
	DWORD var_00918;                                   //  0x00918
	DWORD var_0091C;                                   //  0x0091C
	DWORD var_00920;                                   //  0x00920
	DWORD var_00924;                                   //  0x00924
	DWORD var_00928;                                   //  0x00928
	DWORD var_0092C;                                   //  0x0092C
	DWORD var_00930;                                   //  0x00930
	DWORD var_00934;                                   //  0x00934
	DWORD var_00938;                                   //  0x00938
	DWORD var_0093C;                                   //  0x0093C
	DWORD var_00940;                                   //  0x00940
	DWORD var_00944;                                   //  0x00944
	DWORD var_00948;                                   //  0x00948
	DWORD var_0094C;                                   //  0x0094C
	DWORD var_00950;                                   //  0x00950
	DWORD var_00954;                                   //  0x00954
	DWORD var_00958;                                   //  0x00958
	DWORD var_0095C;                                   //  0x0095C
	DWORD var_00960;                                   //  0x00960
	DWORD var_00964;                                   //  0x00964
	DWORD var_00968;                                   //  0x00968
	DWORD var_0096C;                                   //  0x0096C
	DWORD var_00970;                                   //  0x00970
	DWORD var_00974;                                   //  0x00974
	DWORD var_00978;                                   //  0x00978
	DWORD var_0097C;                                   //  0x0097C
	DWORD var_00980;                                   //  0x00980
	DWORD var_00984;                                   //  0x00984
	DWORD var_00988;                                   //  0x00988
	DWORD var_0098C;                                   //  0x0098C
	DWORD var_00990;                                   //  0x00990
	DWORD var_00994;                                   //  0x00994
	DWORD var_00998;                                   //  0x00998
	DWORD var_0099C;                                   //  0x0099C
	DWORD var_009A0;                                   //  0x009A0
	DWORD var_009A4;                                   //  0x009A4
	DWORD var_009A8;                                   //  0x009A8
	DWORD var_009AC;                                   //  0x009AC
	DWORD var_009B0;                                   //  0x009B0
	DWORD var_009B4;                                   //  0x009B4
	DWORD var_009B8;                                   //  0x009B8
	DWORD var_009BC;                                   //  0x009BC
	DWORD var_009C0;                                   //  0x009C0
	DWORD var_009C4;                                   //  0x009C4
	DWORD var_009C8;                                   //  0x009C8
	DWORD var_009CC;                                   //  0x009CC
	DWORD var_009D0;                                   //  0x009D0
	DWORD var_009D4;                                   //  0x009D4
	DWORD var_009D8;                                   //  0x009D8
	DWORD var_009DC;                                   //  0x009DC
	DWORD var_009E0;                                   //  0x009E0
	DWORD var_009E4;                                   //  0x009E4
	DWORD var_009E8;                                   //  0x009E8
	DWORD var_009EC;                                   //  0x009EC
	DWORD var_009F0;                                   //  0x009F0
	DWORD var_009F4;                                   //  0x009F4
	DWORD var_009F8;                                   //  0x009F8
	DWORD var_009FC;                                   //  0x009FC
	DWORD var_00A00;                                   //  0x00A00
	DWORD var_00A04;                                   //  0x00A04
	DWORD var_00A08;                                   //  0x00A08
	DWORD var_00A0C;                                   //  0x00A0C
	DWORD var_00A10;                                   //  0x00A10
	DWORD var_00A14;                                   //  0x00A14
	DWORD var_00A18;                                   //  0x00A18
	DWORD var_00A1C;                                   //  0x00A1C
	DWORD var_00A20;                                   //  0x00A20
	DWORD var_00A24;                                   //  0x00A24
	DWORD var_00A28;                                   //  0x00A28
	DWORD var_00A2C;                                   //  0x00A2C
	DWORD var_00A30;                                   //  0x00A30
	DWORD var_00A34;                                   //  0x00A34
	DWORD var_00A38;                                   //  0x00A38
	DWORD var_00A3C;                                   //  0x00A3C
	DWORD var_00A40;                                   //  0x00A40
	DWORD var_00A44;                                   //  0x00A44
	DWORD var_00A48;                                   //  0x00A48
	DWORD var_00A4C;                                   //  0x00A4C
	DWORD var_00A50;                                   //  0x00A50
	DWORD var_00A54;                                   //  0x00A54
	DWORD var_00A58;                                   //  0x00A58
	DWORD var_00A5C;                                   //  0x00A5C
	DWORD var_00A60;                                   //  0x00A60
	DWORD var_00A64;                                   //  0x00A64
	DWORD var_00A68;                                   //  0x00A68
	DWORD var_00A6C;                                   //  0x00A6C
	DWORD var_00A70;                                   //  0x00A70
	DWORD var_00A74;                                   //  0x00A74
	DWORD var_00A78;                                   //  0x00A78
	DWORD var_00A7C;                                   //  0x00A7C
	DWORD var_00A80;                                   //  0x00A80
	DWORD var_00A84;                                   //  0x00A84
	DWORD var_00A88;                                   //  0x00A88
	DWORD var_00A8C;                                   //  0x00A8C
	DWORD var_00A90;                                   //  0x00A90
	DWORD var_00A94;                                   //  0x00A94
	DWORD var_00A98;                                   //  0x00A98
	DWORD var_00A9C;                                   //  0x00A9C
	DWORD var_00AA0;                                   //  0x00AA0
	DWORD var_00AA4;                                   //  0x00AA4
	DWORD var_00AA8;                                   //  0x00AA8
	DWORD var_00AAC;                                   //  0x00AAC
	DWORD var_00AB0;                                   //  0x00AB0
	DWORD var_00AB4;                                   //  0x00AB4
	DWORD var_00AB8;                                   //  0x00AB8
	DWORD var_00ABC;                                   //  0x00ABC
	DWORD var_00AC0;                                   //  0x00AC0
	DWORD var_00AC4;                                   //  0x00AC4
	DWORD var_00AC8;                                   //  0x00AC8
	DWORD var_00ACC;                                   //  0x00ACC
	DWORD var_00AD0;                                   //  0x00AD0
	DWORD var_00AD4;                                   //  0x00AD4
	DWORD var_00AD8;                                   //  0x00AD8
	DWORD var_00ADC;                                   //  0x00ADC
	DWORD var_00AE0;                                   //  0x00AE0
	DWORD var_00AE4;                                   //  0x00AE4
	DWORD var_00AE8;                                   //  0x00AE8
	DWORD var_00AEC;                                   //  0x00AEC
	DWORD var_00AF0;                                   //  0x00AF0
	DWORD var_00AF4;                                   //  0x00AF4
	DWORD var_00AF8;                                   //  0x00AF8
	DWORD var_00AFC;                                   //  0x00AFC
	DWORD var_00B00;                                   //  0x00B00
	DWORD var_00B04;                                   //  0x00B04
	DWORD var_00B08;                                   //  0x00B08
	DWORD var_00B0C;                                   //  0x00B0C
	DWORD var_00B10;                                   //  0x00B10
	DWORD var_00B14;                                   //  0x00B14
	DWORD var_00B18;                                   //  0x00B18
	DWORD var_00B1C;                                   //  0x00B1C
	DWORD var_00B20;                                   //  0x00B20
	DWORD var_00B24;                                   //  0x00B24
	DWORD var_00B28;                                   //  0x00B28
	DWORD var_00B2C;                                   //  0x00B2C
	DWORD var_00B30;                                   //  0x00B30
	DWORD var_00B34;                                   //  0x00B34
	DWORD var_00B38;                                   //  0x00B38
	DWORD var_00B3C;                                   //  0x00B3C
	DWORD var_00B40;                                   //  0x00B40
	DWORD var_00B44;                                   //  0x00B44
	DWORD var_00B48;                                   //  0x00B48
	DWORD var_00B4C;                                   //  0x00B4C
	DWORD var_00B50;                                   //  0x00B50
	DWORD var_00B54;                                   //  0x00B54
	DWORD var_00B58;                                   //  0x00B58
	DWORD var_00B5C;                                   //  0x00B5C
	DWORD var_00B60;                                   //  0x00B60
	DWORD var_00B64;                                   //  0x00B64
	DWORD var_00B68;                                   //  0x00B68
	DWORD var_00B6C;                                   //  0x00B6C
	DWORD var_00B70;                                   //  0x00B70
	DWORD var_00B74;                                   //  0x00B74
	DWORD var_00B78;                                   //  0x00B78
	DWORD var_00B7C;                                   //  0x00B7C
	DWORD var_00B80;                                   //  0x00B80
	DWORD var_00B84;                                   //  0x00B84
	DWORD var_00B88;                                   //  0x00B88
	DWORD var_00B8C;                                   //  0x00B8C
	DWORD var_00B90;                                   //  0x00B90
	DWORD var_00B94;                                   //  0x00B94
	DWORD var_00B98;                                   //  0x00B98
	DWORD var_00B9C;                                   //  0x00B9C
	DWORD var_00BA0;                                   //  0x00BA0
	DWORD var_00BA4;                                   //  0x00BA4
	DWORD var_00BA8;                                   //  0x00BA8
	DWORD var_00BAC;                                   //  0x00BAC
	DWORD var_00BB0;                                   //  0x00BB0
	DWORD var_00BB4;                                   //  0x00BB4
	DWORD var_00BB8;                                   //  0x00BB8
	DWORD var_00BBC;                                   //  0x00BBC
	DWORD var_00BC0;                                   //  0x00BC0
	DWORD var_00BC4;                                   //  0x00BC4
	DWORD var_00BC8;                                   //  0x00BC8
	DWORD var_00BCC;                                   //  0x00BCC
	DWORD var_00BD0;                                   //  0x00BD0
	DWORD var_00BD4;                                   //  0x00BD4
	DWORD var_00BD8;                                   //  0x00BD8
	DWORD var_00BDC;                                   //  0x00BDC
	DWORD var_00BE0;                                   //  0x00BE0
	DWORD var_00BE4;                                   //  0x00BE4
	DWORD var_00BE8;                                   //  0x00BE8
	DWORD var_00BEC;                                   //  0x00BEC
	DWORD var_00BF0;                                   //  0x00BF0
	DWORD var_00BF4;                                   //  0x00BF4
	DWORD var_00BF8;                                   //  0x00BF8
	DWORD var_00BFC;                                   //  0x00BFC
	DWORD var_00C00;                                   //  0x00C00
	DWORD var_00C04;                                   //  0x00C04
	DWORD var_00C08;                                   //  0x00C08
	DWORD var_00C0C;                                   //  0x00C0C
	DWORD var_00C10;                                   //  0x00C10
	DWORD var_00C14;                                   //  0x00C14
	DWORD var_00C18;                                   //  0x00C18
	DWORD var_00C1C;                                   //  0x00C1C
	DWORD var_00C20;                                   //  0x00C20
	DWORD var_00C24;                                   //  0x00C24
	DWORD var_00C28;                                   //  0x00C28
	DWORD var_00C2C;                                   //  0x00C2C
	DWORD var_00C30;                                   //  0x00C30
	DWORD var_00C34;                                   //  0x00C34
	DWORD var_00C38;                                   //  0x00C38
	DWORD var_00C3C;                                   //  0x00C3C
	DWORD var_00C40;                                   //  0x00C40
	DWORD var_00C44;                                   //  0x00C44
	DWORD var_00C48;                                   //  0x00C48
	DWORD var_00C4C;                                   //  0x00C4C
	DWORD var_00C50;                                   //  0x00C50
	DWORD var_00C54;                                   //  0x00C54
	DWORD var_00C58;                                   //  0x00C58
	DWORD var_00C5C;                                   //  0x00C5C
	DWORD var_00C60;                                   //  0x00C60
	DWORD var_00C64;                                   //  0x00C64
	DWORD var_00C68;                                   //  0x00C68
	DWORD var_00C6C;                                   //  0x00C6C
	DWORD var_00C70;                                   //  0x00C70
	DWORD var_00C74;                                   //  0x00C74
	DWORD var_00C78;                                   //  0x00C78
	DWORD var_00C7C;                                   //  0x00C7C
	DWORD var_00C80;                                   //  0x00C80
	DWORD var_00C84;                                   //  0x00C84
	DWORD var_00C88;                                   //  0x00C88
	DWORD var_00C8C;                                   //  0x00C8C
	DWORD var_00C90;                                   //  0x00C90
	DWORD var_00C94;                                   //  0x00C94
	DWORD var_00C98;                                   //  0x00C98
	DWORD var_00C9C;                                   //  0x00C9C
	DWORD var_00CA0;                                   //  0x00CA0
	DWORD var_00CA4;                                   //  0x00CA4
	DWORD var_00CA8;                                   //  0x00CA8
	DWORD var_00CAC;                                   //  0x00CAC
	DWORD var_00CB0;                                   //  0x00CB0
	DWORD var_00CB4;                                   //  0x00CB4
	DWORD var_00CB8;                                   //  0x00CB8
	DWORD var_00CBC;                                   //  0x00CBC
	DWORD var_00CC0;                                   //  0x00CC0
	DWORD var_00CC4;                                   //  0x00CC4
	DWORD var_00CC8;                                   //  0x00CC8
	DWORD var_00CCC;                                   //  0x00CCC
	DWORD var_00CD0;                                   //  0x00CD0
	DWORD var_00CD4;                                   //  0x00CD4
	DWORD var_00CD8;                                   //  0x00CD8
	DWORD var_00CDC;                                   //  0x00CDC
	DWORD var_00CE0;                                   //  0x00CE0
	DWORD var_00CE4;                                   //  0x00CE4
	DWORD var_00CE8;                                   //  0x00CE8
	DWORD var_00CEC;                                   //  0x00CEC
	DWORD var_00CF0;                                   //  0x00CF0
	DWORD var_00CF4;                                   //  0x00CF4
	DWORD var_00CF8;                                   //  0x00CF8
	DWORD var_00CFC;                                   //  0x00CFC
	DWORD var_00D00;                                   //  0x00D00
	DWORD var_00D04;                                   //  0x00D04
	DWORD var_00D08;                                   //  0x00D08
	DWORD var_00D0C;                                   //  0x00D0C
	DWORD var_00D10;                                   //  0x00D10
	DWORD var_00D14;                                   //  0x00D14
	DWORD var_00D18;                                   //  0x00D18
	DWORD var_00D1C;                                   //  0x00D1C
	DWORD var_00D20;                                   //  0x00D20
	DWORD var_00D24;                                   //  0x00D24
	DWORD var_00D28;                                   //  0x00D28
	DWORD var_00D2C;                                   //  0x00D2C
	DWORD var_00D30;                                   //  0x00D30
	DWORD var_00D34;                                   //  0x00D34
	DWORD var_00D38;                                   //  0x00D38
	DWORD var_00D3C;                                   //  0x00D3C
	DWORD var_00D40;                                   //  0x00D40
	DWORD var_00D44;                                   //  0x00D44
	DWORD var_00D48;                                   //  0x00D48
	DWORD var_00D4C;                                   //  0x00D4C
	DWORD var_00D50;                                   //  0x00D50
	DWORD var_00D54;                                   //  0x00D54
	DWORD var_00D58;                                   //  0x00D58
	DWORD var_00D5C;                                   //  0x00D5C
	DWORD var_00D60;                                   //  0x00D60
	DWORD var_00D64;                                   //  0x00D64
	DWORD var_00D68;                                   //  0x00D68
	DWORD var_00D6C;                                   //  0x00D6C
	DWORD var_00D70;                                   //  0x00D70
	DWORD var_00D74;                                   //  0x00D74
	DWORD var_00D78;                                   //  0x00D78
	DWORD var_00D7C;                                   //  0x00D7C
	DWORD var_00D80;                                   //  0x00D80
	DWORD var_00D84;                                   //  0x00D84
	DWORD var_00D88;                                   //  0x00D88
	DWORD var_00D8C;                                   //  0x00D8C
	DWORD var_00D90;                                   //  0x00D90
	DWORD var_00D94;                                   //  0x00D94
	DWORD var_00D98;                                   //  0x00D98
	DWORD var_00D9C;                                   //  0x00D9C
	DWORD var_00DA0;                                   //  0x00DA0
	DWORD var_00DA4;                                   //  0x00DA4
	DWORD var_00DA8;                                   //  0x00DA8
	DWORD var_00DAC;                                   //  0x00DAC
	DWORD var_00DB0;                                   //  0x00DB0
	DWORD var_00DB4;                                   //  0x00DB4
	DWORD var_00DB8;                                   //  0x00DB8
	DWORD var_00DBC;                                   //  0x00DBC
	DWORD var_00DC0;                                   //  0x00DC0
	DWORD var_00DC4;                                   //  0x00DC4
	DWORD var_00DC8;                                   //  0x00DC8
	DWORD var_00DCC;                                   //  0x00DCC
	DWORD var_00DD0;                                   //  0x00DD0
	DWORD var_00DD4;                                   //  0x00DD4
	DWORD var_00DD8;                                   //  0x00DD8
	DWORD var_00DDC;                                   //  0x00DDC
	DWORD var_00DE0;                                   //  0x00DE0
	DWORD var_00DE4;                                   //  0x00DE4
	DWORD var_00DE8;                                   //  0x00DE8
	DWORD var_00DEC;                                   //  0x00DEC
	DWORD var_00DF0;                                   //  0x00DF0
	DWORD var_00DF4;                                   //  0x00DF4
	DWORD var_00DF8;                                   //  0x00DF8
	DWORD var_00DFC;                                   //  0x00DFC
	DWORD var_00E00;                                   //  0x00E00
	DWORD var_00E04;                                   //  0x00E04
	DWORD var_00E08;                                   //  0x00E08
	DWORD var_00E0C;                                   //  0x00E0C
	DWORD var_00E10;                                   //  0x00E10
	DWORD var_00E14;                                   //  0x00E14
	DWORD var_00E18;                                   //  0x00E18
	DWORD var_00E1C;                                   //  0x00E1C
	DWORD var_00E20;                                   //  0x00E20
	DWORD var_00E24;                                   //  0x00E24
	DWORD var_00E28;                                   //  0x00E28
	DWORD var_00E2C;                                   //  0x00E2C
	DWORD var_00E30;                                   //  0x00E30
	DWORD var_00E34;                                   //  0x00E34
	DWORD var_00E38;                                   //  0x00E38
	DWORD var_00E3C;                                   //  0x00E3C
	DWORD var_00E40;                                   //  0x00E40
	DWORD var_00E44;                                   //  0x00E44
	DWORD var_00E48;                                   //  0x00E48
	DWORD var_00E4C;                                   //  0x00E4C
	DWORD var_00E50;                                   //  0x00E50
	DWORD var_00E54;                                   //  0x00E54
	DWORD var_00E58;                                   //  0x00E58
	DWORD var_00E5C;                                   //  0x00E5C
	DWORD var_00E60;                                   //  0x00E60
	DWORD var_00E64;                                   //  0x00E64
	DWORD var_00E68;                                   //  0x00E68
	DWORD var_00E6C;                                   //  0x00E6C
	DWORD var_00E70;                                   //  0x00E70
	DWORD var_00E74;                                   //  0x00E74
	DWORD var_00E78;                                   //  0x00E78
	DWORD var_00E7C;                                   //  0x00E7C
	DWORD var_00E80;                                   //  0x00E80
	DWORD var_00E84;                                   //  0x00E84
	DWORD var_00E88;                                   //  0x00E88
	DWORD var_00E8C;                                   //  0x00E8C
	DWORD var_00E90;                                   //  0x00E90
	DWORD var_00E94;                                   //  0x00E94
	DWORD var_00E98;                                   //  0x00E98
	DWORD var_00E9C;                                   //  0x00E9C
	DWORD var_00EA0;                                   //  0x00EA0
	DWORD var_00EA4;                                   //  0x00EA4
	DWORD var_00EA8;                                   //  0x00EA8
	DWORD var_00EAC;                                   //  0x00EAC
	DWORD var_00EB0;                                   //  0x00EB0
	DWORD var_00EB4;                                   //  0x00EB4
	DWORD var_00EB8;                                   //  0x00EB8
	DWORD var_00EBC;                                   //  0x00EBC
	DWORD var_00EC0;                                   //  0x00EC0
	DWORD var_00EC4;                                   //  0x00EC4
	DWORD var_00EC8;                                   //  0x00EC8
	DWORD var_00ECC;                                   //  0x00ECC
	DWORD var_00ED0;                                   //  0x00ED0
	DWORD var_00ED4;                                   //  0x00ED4
	DWORD var_00ED8;                                   //  0x00ED8
	DWORD var_00EDC;                                   //  0x00EDC
	DWORD var_00EE0;                                   //  0x00EE0
	DWORD var_00EE4;                                   //  0x00EE4
	DWORD var_00EE8;                                   //  0x00EE8
	DWORD var_00EEC;                                   //  0x00EEC
	DWORD var_00EF0;                                   //  0x00EF0
	DWORD var_00EF4;                                   //  0x00EF4
	DWORD var_00EF8;                                   //  0x00EF8
	DWORD var_00EFC;                                   //  0x00EFC
	DWORD var_00F00;                                   //  0x00F00
	DWORD var_00F04;                                   //  0x00F04
	DWORD var_00F08;                                   //  0x00F08
	DWORD var_00F0C;                                   //  0x00F0C
	DWORD var_00F10;                                   //  0x00F10
	DWORD var_00F14;                                   //  0x00F14
	DWORD var_00F18;                                   //  0x00F18
	DWORD var_00F1C;                                   //  0x00F1C
	DWORD var_00F20;                                   //  0x00F20
	DWORD var_00F24;                                   //  0x00F24
	DWORD var_00F28;                                   //  0x00F28
	DWORD var_00F2C;                                   //  0x00F2C
	DWORD var_00F30;                                   //  0x00F30
	DWORD var_00F34;                                   //  0x00F34
	DWORD var_00F38;                                   //  0x00F38
	DWORD var_00F3C;                                   //  0x00F3C
	DWORD var_00F40;                                   //  0x00F40
	DWORD var_00F44;                                   //  0x00F44
	DWORD var_00F48;                                   //  0x00F48
	DWORD var_00F4C;                                   //  0x00F4C
	DWORD var_00F50;                                   //  0x00F50
	DWORD var_00F54;                                   //  0x00F54
	DWORD var_00F58;                                   //  0x00F58
	DWORD var_00F5C;                                   //  0x00F5C
	DWORD var_00F60;                                   //  0x00F60
	DWORD var_00F64;                                   //  0x00F64
	DWORD var_00F68;                                   //  0x00F68
	DWORD var_00F6C;                                   //  0x00F6C
	DWORD var_00F70;                                   //  0x00F70
	DWORD var_00F74;                                   //  0x00F74
	DWORD var_00F78;                                   //  0x00F78
	DWORD var_00F7C;                                   //  0x00F7C
	DWORD var_00F80;                                   //  0x00F80
	DWORD var_00F84;                                   //  0x00F84
	DWORD var_00F88;                                   //  0x00F88
	DWORD var_00F8C;                                   //  0x00F8C
	DWORD var_00F90;                                   //  0x00F90
	DWORD var_00F94;                                   //  0x00F94
	DWORD var_00F98;                                   //  0x00F98
	DWORD var_00F9C;                                   //  0x00F9C
	DWORD var_00FA0;                                   //  0x00FA0
	DWORD var_00FA4;                                   //  0x00FA4
	DWORD var_00FA8;                                   //  0x00FA8
	DWORD var_00FAC;                                   //  0x00FAC
	DWORD var_00FB0;                                   //  0x00FB0
	DWORD var_00FB4;                                   //  0x00FB4
	DWORD var_00FB8;                                   //  0x00FB8
	DWORD var_00FBC;                                   //  0x00FBC
	DWORD var_00FC0;                                   //  0x00FC0
	DWORD var_00FC4;                                   //  0x00FC4
	DWORD var_00FC8;                                   //  0x00FC8
	DWORD var_00FCC;                                   //  0x00FCC
	DWORD var_00FD0;                                   //  0x00FD0
	DWORD var_00FD4;                                   //  0x00FD4
	DWORD var_00FD8;                                   //  0x00FD8
	DWORD var_00FDC;                                   //  0x00FDC
	DWORD var_00FE0;                                   //  0x00FE0
	DWORD var_00FE4;                                   //  0x00FE4
	DWORD var_00FE8;                                   //  0x00FE8
	DWORD var_00FEC;                                   //  0x00FEC
	DWORD var_00FF0;                                   //  0x00FF0
	DWORD var_00FF4;                                   //  0x00FF4
	DWORD var_00FF8;                                   //  0x00FF8
	DWORD var_00FFC;                                   //  0x00FFC
	DWORD var_01000;                                   //  0x01000
	DWORD var_01004;                                   //  0x01004
	DWORD var_01008;                                   //  0x01008
	DWORD var_0100C;                                   //  0x0100C
	DWORD var_01010;                                   //  0x01010
	DWORD var_01014;                                   //  0x01014
	DWORD var_01018;                                   //  0x01018
	DWORD var_0101C;                                   //  0x0101C
	DWORD var_01020;                                   //  0x01020
	DWORD var_01024;                                   //  0x01024
	DWORD var_01028;                                   //  0x01028
	DWORD var_0102C;                                   //  0x0102C
	DWORD var_01030;                                   //  0x01030
	DWORD var_01034;                                   //  0x01034
	DWORD var_01038;                                   //  0x01038
	DWORD var_0103C;                                   //  0x0103C
	DWORD var_01040;                                   //  0x01040
	DWORD var_01044;                                   //  0x01044
	DWORD var_01048;                                   //  0x01048
	DWORD var_0104C;                                   //  0x0104C
	DWORD var_01050;                                   //  0x01050
	DWORD var_01054;                                   //  0x01054
	DWORD var_01058;                                   //  0x01058
	DWORD var_0105C;                                   //  0x0105C
	DWORD var_01060;                                   //  0x01060
	DWORD var_01064;                                   //  0x01064
	DWORD var_01068;                                   //  0x01068
	DWORD var_0106C;                                   //  0x0106C
	DWORD var_01070;                                   //  0x01070
	DWORD var_01074;                                   //  0x01074
	DWORD var_01078;                                   //  0x01078
	DWORD var_0107C;                                   //  0x0107C
	DWORD var_01080;                                   //  0x01080
	DWORD var_01084;                                   //  0x01084
	DWORD var_01088;                                   //  0x01088
	DWORD var_0108C;                                   //  0x0108C
	DWORD var_01090;                                   //  0x01090
	DWORD var_01094;                                   //  0x01094
	DWORD var_01098;                                   //  0x01098
	DWORD var_0109C;                                   //  0x0109C
	DWORD var_010A0;                                   //  0x010A0
	DWORD var_010A4;                                   //  0x010A4
	DWORD var_010A8;                                   //  0x010A8
	DWORD var_010AC;                                   //  0x010AC
	DWORD var_010B0;                                   //  0x010B0
	DWORD var_010B4;                                   //  0x010B4
	DWORD var_010B8;                                   //  0x010B8
	DWORD var_010BC;                                   //  0x010BC
	DWORD var_010C0;                                   //  0x010C0
	DWORD var_010C4;                                   //  0x010C4
	DWORD var_010C8;                                   //  0x010C8
	DWORD var_010CC;                                   //  0x010CC
	DWORD var_010D0;                                   //  0x010D0
	DWORD var_010D4;                                   //  0x010D4
	DWORD var_010D8;                                   //  0x010D8
	DWORD var_010DC;                                   //  0x010DC
	DWORD var_010E0;                                   //  0x010E0
	DWORD var_010E4;                                   //  0x010E4
	DWORD var_010E8;                                   //  0x010E8
	DWORD var_010EC;                                   //  0x010EC
	DWORD var_010F0;                                   //  0x010F0
	DWORD var_010F4;                                   //  0x010F4
	DWORD var_010F8;                                   //  0x010F8
	DWORD var_010FC;                                   //  0x010FC
	DWORD var_01100;                                   //  0x01100
	DWORD var_01104;                                   //  0x01104
	DWORD var_01108;                                   //  0x01108
	DWORD var_0110C;                                   //  0x0110C
	DWORD var_01110;                                   //  0x01110
	DWORD var_01114;                                   //  0x01114
	DWORD var_01118;                                   //  0x01118
	DWORD var_0111C;                                   //  0x0111C
	DWORD var_01120;                                   //  0x01120
	DWORD var_01124;                                   //  0x01124
	DWORD var_01128;                                   //  0x01128
	DWORD var_0112C;                                   //  0x0112C
	DWORD var_01130;                                   //  0x01130
	DWORD var_01134;                                   //  0x01134
	DWORD var_01138;                                   //  0x01138
	DWORD var_0113C;                                   //  0x0113C
	DWORD var_01140;                                   //  0x01140
	DWORD var_01144;                                   //  0x01144
	DWORD var_01148;                                   //  0x01148
	DWORD var_0114C;                                   //  0x0114C
	DWORD var_01150;                                   //  0x01150
	DWORD var_01154;                                   //  0x01154
	DWORD var_01158;                                   //  0x01158
	DWORD var_0115C;                                   //  0x0115C
	DWORD var_01160;                                   //  0x01160
	DWORD var_01164;                                   //  0x01164
	DWORD var_01168;                                   //  0x01168
	DWORD var_0116C;                                   //  0x0116C
	DWORD var_01170;                                   //  0x01170
	DWORD var_01174;                                   //  0x01174
	DWORD var_01178;                                   //  0x01178
	DWORD var_0117C;                                   //  0x0117C
	DWORD var_01180;                                   //  0x01180
	DWORD var_01184;                                   //  0x01184
	DWORD var_01188;                                   //  0x01188
	DWORD var_0118C;                                   //  0x0118C
	DWORD var_01190;                                   //  0x01190
	DWORD var_01194;                                   //  0x01194
	DWORD var_01198;                                   //  0x01198
	DWORD var_0119C;                                   //  0x0119C
	DWORD var_011A0;                                   //  0x011A0
	DWORD var_011A4;                                   //  0x011A4
	DWORD var_011A8;                                   //  0x011A8
	DWORD var_011AC;                                   //  0x011AC
	DWORD var_011B0;                                   //  0x011B0
	DWORD var_011B4;                                   //  0x011B4
	DWORD var_011B8;                                   //  0x011B8
	DWORD var_011BC;                                   //  0x011BC
	DWORD var_011C0;                                   //  0x011C0
	DWORD var_011C4;                                   //  0x011C4
	DWORD var_011C8;                                   //  0x011C8
	DWORD var_011CC;                                   //  0x011CC
	DWORD var_011D0;                                   //  0x011D0
	DWORD var_011D4;                                   //  0x011D4
	DWORD var_011D8;                                   //  0x011D8
	DWORD var_011DC;                                   //  0x011DC
	DWORD var_011E0;                                   //  0x011E0
	DWORD var_011E4;                                   //  0x011E4
	DWORD var_011E8;                                   //  0x011E8
	DWORD var_011EC;                                   //  0x011EC
	DWORD var_011F0;                                   //  0x011F0
	DWORD var_011F4;                                   //  0x011F4
	DWORD var_011F8;                                   //  0x011F8
	DWORD var_011FC;                                   //  0x011FC
	DWORD var_01200;                                   //  0x01200
	DWORD var_01204;                                   //  0x01204
	DWORD var_01208;                                   //  0x01208
	DWORD var_0120C;                                   //  0x0120C
	DWORD var_01210;                                   //  0x01210
	DWORD var_01214;                                   //  0x01214
	DWORD var_01218;                                   //  0x01218
	DWORD var_0121C;                                   //  0x0121C
	DWORD var_01220;                                   //  0x01220
	DWORD var_01224;                                   //  0x01224
	DWORD var_01228;                                   //  0x01228
	DWORD var_0122C;                                   //  0x0122C
	DWORD var_01230;                                   //  0x01230
	DWORD var_01234;                                   //  0x01234
	DWORD var_01238;                                   //  0x01238
	DWORD var_0123C;                                   //  0x0123C
	DWORD var_01240;                                   //  0x01240
	DWORD var_01244;                                   //  0x01244
	DWORD var_01248;                                   //  0x01248
	DWORD var_0124C;                                   //  0x0124C
	DWORD var_01250;                                   //  0x01250
	DWORD var_01254;                                   //  0x01254
	DWORD var_01258;                                   //  0x01258
	DWORD var_0125C;                                   //  0x0125C
	DWORD var_01260;                                   //  0x01260
	DWORD var_01264;                                   //  0x01264
	DWORD var_01268;                                   //  0x01268
	DWORD var_0126C;                                   //  0x0126C
	DWORD var_01270;                                   //  0x01270
	DWORD var_01274;                                   //  0x01274
	DWORD var_01278;                                   //  0x01278
	DWORD var_0127C;                                   //  0x0127C
	DWORD var_01280;                                   //  0x01280
	DWORD var_01284;                                   //  0x01284
	DWORD var_01288;                                   //  0x01288
	DWORD var_0128C;                                   //  0x0128C
	DWORD var_01290;                                   //  0x01290
	DWORD var_01294;                                   //  0x01294
	DWORD var_01298;                                   //  0x01298
	DWORD var_0129C;                                   //  0x0129C
	DWORD var_012A0;                                   //  0x012A0
	DWORD var_012A4;                                   //  0x012A4
	DWORD var_012A8;                                   //  0x012A8
	DWORD var_012AC;                                   //  0x012AC
	DWORD var_012B0;                                   //  0x012B0
	DWORD var_012B4;                                   //  0x012B4
	DWORD var_012B8;                                   //  0x012B8
	DWORD var_012BC;                                   //  0x012BC
	DWORD var_012C0;                                   //  0x012C0
	DWORD var_012C4;                                   //  0x012C4
	DWORD var_012C8;                                   //  0x012C8
	DWORD var_012CC;                                   //  0x012CC
	DWORD var_012D0;                                   //  0x012D0
	DWORD var_012D4;                                   //  0x012D4
	DWORD var_012D8;                                   //  0x012D8
	DWORD var_012DC;                                   //  0x012DC
	DWORD var_012E0;                                   //  0x012E0
	DWORD var_012E4;                                   //  0x012E4
	DWORD var_012E8;                                   //  0x012E8
	DWORD var_012EC;                                   //  0x012EC
	DWORD var_012F0;                                   //  0x012F0
	DWORD var_012F4;                                   //  0x012F4
	DWORD var_012F8;                                   //  0x012F8
	DWORD var_012FC;                                   //  0x012FC
	DWORD var_01300;                                   //  0x01300
	DWORD var_01304;                                   //  0x01304
	DWORD var_01308;                                   //  0x01308
	DWORD var_0130C;                                   //  0x0130C
	DWORD var_01310;                                   //  0x01310
	DWORD var_01314;                                   //  0x01314
	DWORD var_01318;                                   //  0x01318
	DWORD var_0131C;                                   //  0x0131C
	DWORD var_01320;                                   //  0x01320
	DWORD var_01324;                                   //  0x01324
	DWORD var_01328;                                   //  0x01328
	DWORD var_0132C;                                   //  0x0132C
	DWORD var_01330;                                   //  0x01330
	DWORD var_01334;                                   //  0x01334
	DWORD var_01338;                                   //  0x01338
	DWORD var_0133C;                                   //  0x0133C
	DWORD var_01340;                                   //  0x01340
	DWORD var_01344;                                   //  0x01344
	DWORD var_01348;                                   //  0x01348
	DWORD var_0134C;                                   //  0x0134C
	DWORD var_01350;                                   //  0x01350
	DWORD var_01354;                                   //  0x01354
	DWORD var_01358;                                   //  0x01358
	DWORD var_0135C;                                   //  0x0135C
	DWORD var_01360;                                   //  0x01360
	DWORD var_01364;                                   //  0x01364
	DWORD var_01368;                                   //  0x01368
	DWORD var_0136C;                                   //  0x0136C
	DWORD var_01370;                                   //  0x01370
	DWORD var_01374;                                   //  0x01374
	DWORD var_01378;                                   //  0x01378
	DWORD var_0137C;                                   //  0x0137C
	DWORD var_01380;                                   //  0x01380
	DWORD var_01384;                                   //  0x01384
	DWORD var_01388;                                   //  0x01388
	DWORD var_0138C;                                   //  0x0138C
	DWORD var_01390;                                   //  0x01390
	DWORD var_01394;                                   //  0x01394
	DWORD var_01398;                                   //  0x01398
	DWORD var_0139C;                                   //  0x0139C
	DWORD var_013A0;                                   //  0x013A0
	DWORD var_013A4;                                   //  0x013A4
	DWORD var_013A8;                                   //  0x013A8
	DWORD var_013AC;                                   //  0x013AC
	DWORD var_013B0;                                   //  0x013B0
	DWORD var_013B4;                                   //  0x013B4
	DWORD var_013B8;                                   //  0x013B8
	DWORD var_013BC;                                   //  0x013BC
	DWORD var_013C0;                                   //  0x013C0
	DWORD var_013C4;                                   //  0x013C4
	DWORD var_013C8;                                   //  0x013C8
	DWORD var_013CC;                                   //  0x013CC
	DWORD var_013D0;                                   //  0x013D0
	DWORD var_013D4;                                   //  0x013D4
	DWORD var_013D8;                                   //  0x013D8
	DWORD iServiceKind;                                //  0x013DC
	DWORD var_013E0;                                   //  0x013E0
	DWORD var_013E4;                                   //  0x013E4
	DWORD var_013E8;                                   //  0x013E8
	DWORD var_013EC;                                   //  0x013EC
	DWORD var_013F0;                                   //  0x013F0
	DWORD var_013F4;                                   //  0x013F4
	DWORD var_013F8;                                   //  0x013F8
	DWORD var_013FC;                                   //  0x013FC
	DWORD var_01400;                                   //  0x01400
	DWORD var_01404;                                   //  0x01404
	DWORD var_01408;                                   //  0x01408
	DWORD var_0140C;                                   //  0x0140C
	DWORD var_01410;                                   //  0x01410
	DWORD var_01414;                                   //  0x01414
	DWORD var_01418;                                   //  0x01418
	DWORD var_0141C;                                   //  0x0141C
	DWORD var_01420;                                   //  0x01420
	DWORD var_01424;                                   //  0x01424
	DWORD var_01428;                                   //  0x01428
	DWORD var_0142C;                                   //  0x0142C
	DWORD var_01430;                                   //  0x01430
	DWORD var_01434;                                   //  0x01434
	DWORD var_01438;                                   //  0x01438
	DWORD var_0143C;                                   //  0x0143C
	DWORD var_01440;                                   //  0x01440
	DWORD var_01444;                                   //  0x01444
	DWORD var_01448;                                   //  0x01448
	DWORD var_0144C;                                   //  0x0144C
	DWORD var_01450;                                   //  0x01450
	DWORD var_01454;                                   //  0x01454
	DWORD var_01458;                                   //  0x01458
	DWORD var_0145C;                                   //  0x0145C
	DWORD var_01460;                                   //  0x01460
	DWORD var_01464;                                   //  0x01464
	DWORD var_01468;                                   //  0x01468
	DWORD var_0146C;                                   //  0x0146C
	DWORD var_01470;                                   //  0x01470
	DWORD var_01474;                                   //  0x01474
	DWORD PlatinumBuffGrade;                           //  0x01478
	DWORD ExpireDate_PlatinumBuffGrade;                //  0x0147C
	DWORD var_01480;                                   //  0x01480
	DWORD var_01484;                                   //  0x01484
	DWORD var_01488;                                   //  0x01488
	DWORD var_0148C;                                   //  0x0148C
	DWORD var_01490;                                   //  0x01490
	DWORD var_01494;                                   //  0x01494
	DWORD var_01498;                                   //  0x01498
	DWORD var_0149C;                                   //  0x0149C
	DWORD var_014A0;                                   //  0x014A0
	DWORD var_014A4;                                   //  0x014A4
	DWORD var_014A8;                                   //  0x014A8
	DWORD var_014AC;                                   //  0x014AC
	DWORD var_014B0;                                   //  0x014B0
	DWORD var_014B4;                                   //  0x014B4
	DWORD var_014B8;                                   //  0x014B8
	DWORD var_014BC;                                   //  0x014BC
	DWORD var_014C0;                                   //  0x014C0
	DWORD var_014C4;                                   //  0x014C4
	DWORD var_014C8;                                   //  0x014C8
	DWORD var_014CC;                                   //  0x014CC
	DWORD var_014D0;                                   //  0x014D0
	DWORD var_014D4;                                   //  0x014D4
	DWORD var_014D8;                                   //  0x014D8
	DWORD var_014DC;                                   //  0x014DC
	DWORD var_014E0;                                   //  0x014E0
	DWORD var_014E4;                                   //  0x014E4
	DWORD var_014E8;                                   //  0x014E8
	DWORD var_014EC;                                   //  0x014EC
	DWORD var_014F0;                                   //  0x014F0
	DWORD var_014F4;                                   //  0x014F4
	DWORD var_014F8;                                   //  0x014F8
	DWORD var_014FC;                                   //  0x014FC
	DWORD var_01500;                                   //  0x01500
	DWORD var_01504;                                   //  0x01504
	DWORD var_01508;                                   //  0x01508
	DWORD var_0150C;                                   //  0x0150C
	DWORD var_01510;                                   //  0x01510
	DWORD var_01514;                                   //  0x01514
	DWORD var_01518;                                   //  0x01518
	DWORD var_0151C;                                   //  0x0151C
	DWORD var_01520;                                   //  0x01520
	DWORD var_01524;                                   //  0x01524
	DWORD var_01528;                                   //  0x01528
	DWORD var_0152C;                                   //  0x0152C
	DWORD var_01530;                                   //  0x01530
	DWORD var_01534;                                   //  0x01534
	DWORD var_01538;                                   //  0x01538
	DWORD var_0153C;                                   //  0x0153C
	DWORD var_01540;                                   //  0x01540
	DWORD var_01544;                                   //  0x01544
	DWORD var_01548;                                   //  0x01548
	DWORD var_0154C;                                   //  0x0154C
	DWORD var_01550;                                   //  0x01550
	DWORD var_01554;                                   //  0x01554
	DWORD var_01558;                                   //  0x01558
	DWORD var_0155C;                                   //  0x0155C
	DWORD var_01560;                                   //  0x01560
	DWORD lastDeadType;                                //  0x01564
	DWORD isDead;									   //  0x01568
	DWORD bIsVerifyLink;                               //  0x0156C
	DWORD bIsActvteLink;                               //  0x01570
	DWORD iVerifyIndex;                                //  0x01574
	DWORD iVerifyUniqIdx;                              //  0x01578
	DWORD iVerifyServerIdx;                            //  0x0157C
	DWORD iVerifyGroupIdx;                             //  0x01580
	DWORD iVerifyProcessIdx;                           //  0x01584
	DWORD bIsNotDataUpdate;                            //  0x01588
	int var_0158C;                                   //  0x0158C
	int var_01590;                                   //  0x01590
	int var_01594;                                   //  0x01594
	int var_01598;                                   //  0x01598
	int var_0159C;                                   //  0x0159C
	int var_015A0;                                   //  0x015A0
	int var_015A4;                                   //  0x015A4
	int var_015A8;                                   //  0x015A8
	int var_015AC;                                   //  0x015AC
	int var_015B0;                                   //  0x015B0
	int var_015B4;                                   //  0x015B4
	int var_015B8;                                   //  0x015B8
	int var_015BC;                                   //  0x015BC
	int var_015C0;                                   //  0x015C0
	int var_015C4;                                   //  0x015C4
	int var_015C8;                                   //  0x015C8
	int var_015CC;                                   //  0x015CC
	int var_015D0;                                   //  0x015D0
	int var_015D4;                                   //  0x015D4
	int var_015D8;                                   //  0x015D8
	int var_015DC;                                   //  0x015DC
	int var_015E0;                                   //  0x015E0
	int var_015E4;                                   //  0x015E4
	int var_015E8;                                   //  0x015E8
	int var_015EC;                                   //  0x015EC
	int var_015F0;                                   //  0x015F0
	int var_015F4;                                   //  0x015F4
	int var_015F8;                                   //  0x015F8
	int var_015FC;                                   //  0x015FC
	int var_01600;                                   //  0x01600
	int var_01604;                                   //  0x01604
	int var_01608;                                   //  0x01608
	int var_0160C;                                   //  0x0160C
	int var_01610;                                   //  0x01610
	int var_01614;                                   //  0x01614
	int var_01618;                                   //  0x01618
	int var_0161C;                                   //  0x0161C
	int var_01620;                                   //  0x01620
	int var_01624;                                   //  0x01624
	int var_01628;                                   //  0x01628
	int var_0162C;                                   //  0x0162C
	int var_01630;                                   //  0x01630
	int var_01634;                                   //  0x01634
	int var_01638;                                   //  0x01638
	int var_0163C;                                   //  0x0163C
	int var_01640;                                   //  0x01640
	int var_01644;                                   //  0x01644
	int var_01648;                                   //  0x01648
	int var_0164C;                                   //  0x0164C
	int var_01650;                                   //  0x01650
	int var_01654;                                   //  0x01654
	int var_01658;                                   //  0x01658
	int var_0165C;                                   //  0x0165C
	int var_01660;                                   //  0x01660
	int var_01664;                                   //  0x01664
	int var_01668;                                   //  0x01668
	int var_0166C;                                   //  0x0166C
	int var_01670;                                   //  0x01670
	int var_01674;                                   //  0x01674
	int var_01678;                                   //  0x01678
	int var_0167C;                                   //  0x0167C
	int var_01680;                                   //  0x01680
	int var_01684;                                   //  0x01684
	int var_01688;                                   //  0x01688
	int var_0168C;                                   //  0x0168C
	int var_01690;                                   //  0x01690
	int var_01694;                                   //  0x01694
	int var_01698;                                   //  0x01698
	int var_0169C;                                   //  0x0169C
	int var_016A0;                                   //  0x016A0
	int var_016A4;                                   //  0x016A4
	int var_016A8;                                   //  0x016A8
	int var_016AC;                                   //  0x016AC
	int var_016B0;                                   //  0x016B0
	int var_016B4;                                   //  0x016B4
	INT64 expStatus;                                 //  0x016B8
	AlzStatus alzStatus;							 //  0x016C0
	INT64 wexp;										 //  0x016E0
	INT64 wexp2;                                     //  0x016E8
	int var_016F0;                                   //  0x016F0
	int var_016F4;                                   //  0x016F4
	int var_016F8;                                   //  0x016F8
	int var_016FC;                                   //  0x016FC
	int var_01700;                                   //  0x01700
	int var_01704;                                   //  0x01704
	int var_01708;                                   //  0x01708
	int var_0170C;                                   //  0x0170C
	int var_01710;                                   //  0x01710
	int var_01714;                                   //  0x01714
	int var_01718;                                   //  0x01718
	int var_0171C;                                   //  0x0171C
	int var_01720;                                   //  0x01720
	int var_01724;                                   //  0x01724
	int var_01728;                                   //  0x01728
	int var_0172C;                                   //  0x0172C
	int var_01730;                                   //  0x01730
	int var_01734;                                   //  0x01734
	int var_01738;                                   //  0x01738
	int var_0173C;                                   //  0x0173C
	int var_01740;                                   //  0x01740
	int var_01744;                                   //  0x01744
	int var_01748;                                   //  0x01748
	int var_0174C;                                   //  0x0174C
	int var_01750;                                   //  0x01750
	int var_01754;                                   //  0x01754
	int var_01758;                                   //  0x01758
	int var_0175C;                                   //  0x0175C
	int var_01760;                                   //  0x01760
	int var_01764;                                   //  0x01764
	int var_01768;                                   //  0x01768
	int var_0176C;                                   //  0x0176C
	int var_01770;                                   //  0x01770
	int var_01774;                                   //  0x01774
	int var_01778;                                   //  0x01778
	int var_0177C;                                   //  0x0177C
	int var_01780;                                   //  0x01780
	int var_01784;                                   //  0x01784
	int var_01788;                                   //  0x01788
	int var_0178C;                                   //  0x0178C
	int var_01790;                                   //  0x01790
	int var_01794;                                   //  0x01794
	int var_01798;                                   //  0x01798
	int var_0179C;                                   //  0x0179C
	int var_017A0;                                   //  0x017A0
	int var_017A4;                                   //  0x017A4
	int var_017A8;                                   //  0x017A8
	int var_017AC;                                   //  0x017AC
	int var_017B0;                                   //  0x017B0
	int var_017B4;                                   //  0x017B4
	int var_017B8;                                   //  0x017B8
	int var_017BC;                                   //  0x017BC
	int var_017C0;                                   //  0x017C0
	int var_017C4;                                   //  0x017C4
	int var_017C8;                                   //  0x017C8
	int var_017CC;                                   //  0x017CC
	int var_017D0;                                   //  0x017D0
	int var_017D4;                                   //  0x017D4
	int var_017D8;                                   //  0x017D8
	int var_017DC;                                   //  0x017DC
	int var_017E0;                                   //  0x017E0
	int var_017E4;                                   //  0x017E4
	int var_017E8;                                   //  0x017E8
	int var_017EC;                                   //  0x017EC
	int var_017F0;                                   //  0x017F0
	int var_017F4;                                   //  0x017F4
	int var_017F8;                                   //  0x017F8
	int var_017FC;                                   //  0x017FC
	int var_01800;                                   //  0x01800
	int var_01804;                                   //  0x01804
	int var_01808;                                   //  0x01808
	int var_0180C;                                   //  0x0180C
	int var_01810;                                   //  0x01810
	int var_01814;                                   //  0x01814
	int var_01818;                                   //  0x01818
	int var_0181C;                                   //  0x0181C
	int var_01820;                                   //  0x01820
	int var_01824;                                   //  0x01824
	int var_01828;                                   //  0x01828
	int var_0182C;                                   //  0x0182C
	int var_01830;                                   //  0x01830
	int var_01834;                                   //  0x01834
	int var_01838;                                   //  0x01838
	int var_0183C;                                   //  0x0183C
	int var_01840;                                   //  0x01840
	int var_01844;                                   //  0x01844
	int var_01848;                                   //  0x01848
	int var_0184C;                                   //  0x0184C
	int var_01850;                                   //  0x01850
	int var_01854;                                   //  0x01854
	int var_01858;                                   //  0x01858
	int var_0185C;                                   //  0x0185C
	int var_01860;                                   //  0x01860
	int var_01864;                                   //  0x01864
	int var_01868;                                   //  0x01868
	int var_0186C;                                   //  0x0186C
	int var_01870;                                   //  0x01870
	int var_01874;                                   //  0x01874
	int var_01878;                                   //  0x01878
	int var_0187C;                                   //  0x0187C
	int var_01880;                                   //  0x01880
	int var_01884;                                   //  0x01884
	int var_01888;                                   //  0x01888
	int var_0188C;                                   //  0x0188C
	int var_01890;                                   //  0x01890
	int var_01894;                                   //  0x01894
	int var_01898;                                   //  0x01898
	int var_0189C;                                   //  0x0189C
	int var_018A0;                                   //  0x018A0
	int var_018A4;                                   //  0x018A4
	int var_018A8;                                   //  0x018A8
	int var_018AC;                                   //  0x018AC
	int var_018B0;                                   //  0x018B0
	int var_018B4;                                   //  0x018B4
	int var_018B8;                                   //  0x018B8
	int var_018BC;                                   //  0x018BC
	int var_018C0;                                   //  0x018C0
	int var_018C4;                                   //  0x018C4
	int var_018C8;                                   //  0x018C8
	int var_018CC;                                   //  0x018CC
	int var_018D0;                                   //  0x018D0
	int var_018D4;                                   //  0x018D4
	int var_018D8;                                   //  0x018D8
	int var_018DC;                                   //  0x018DC
	int var_018E0;                                   //  0x018E0
	int var_018E4;                                   //  0x018E4
	int var_018E8;                                   //  0x018E8
	int var_018EC;                                   //  0x018EC
	int var_018F0;                                   //  0x018F0
	int var_018F4;                                   //  0x018F4
	int var_018F8;                                   //  0x018F8
	int var_018FC;                                   //  0x018FC
	int var_01900;                                   //  0x01900
	int var_01904;                                   //  0x01904
	int var_01908;                                   //  0x01908
	int var_0190C;                                   //  0x0190C
	int var_01910;                                   //  0x01910
	int var_01914;                                   //  0x01914
	int var_01918;                                   //  0x01918
	int var_0191C;                                   //  0x0191C
	int var_01920;                                   //  0x01920
	int var_01924;                                   //  0x01924
	int var_01928;                                   //  0x01928
	int var_0192C;                                   //  0x0192C
	int var_01930;                                   //  0x01930
	int var_01934;                                   //  0x01934
	int var_01938;                                   //  0x01938
	int var_0193C;                                   //  0x0193C
	int var_01940;                                   //  0x01940
	int var_01944;                                   //  0x01944
	int var_01948;                                   //  0x01948
	int var_0194C;                                   //  0x0194C
	int var_01950;                                   //  0x01950
	int var_01954;                                   //  0x01954
	int var_01958;                                   //  0x01958
	int var_0195C;                                   //  0x0195C
	int var_01960;                                   //  0x01960
	int var_01964;                                   //  0x01964
	int var_01968;                                   //  0x01968
	int var_0196C;                                   //  0x0196C
	int var_01970;                                   //  0x01970
	int var_01974;                                   //  0x01974
	int var_01978;                                   //  0x01978
	int var_0197C;                                   //  0x0197C
	int var_01980;                                   //  0x01980
	int var_01984;                                   //  0x01984
	int var_01988;                                   //  0x01988
	int var_0198C;                                   //  0x0198C
	int var_01990;                                   //  0x01990
	int var_01994;                                   //  0x01994
	int var_01998;                                   //  0x01998
	int var_0199C;                                   //  0x0199C
	int var_019A0;                                   //  0x019A0
	int var_019A4;                                   //  0x019A4
	int var_019A8;                                   //  0x019A8
	int var_019AC;                                   //  0x019AC
	int var_019B0;                                   //  0x019B0
	int var_019B4;                                   //  0x019B4
	int var_019B8;                                   //  0x019B8
	int var_019BC;                                   //  0x019BC
	int var_019C0;                                   //  0x019C0
	int var_019C4;                                   //  0x019C4
	int var_019C8;                                   //  0x019C8
	int var_019CC;                                   //  0x019CC
	int var_019D0;                                   //  0x019D0
	int var_019D4;                                   //  0x019D4
	int var_019D8;                                   //  0x019D8
	int var_019DC;                                   //  0x019DC
	int var_019E0;                                   //  0x019E0
	int var_019E4;                                   //  0x019E4
	int var_019E8;                                   //  0x019E8
	int var_019EC;                                   //  0x019EC
	int var_019F0;                                   //  0x019F0
	int var_019F4;                                   //  0x019F4
	int var_019F8;                                   //  0x019F8
	int var_019FC;                                   //  0x019FC
	int var_01A00;                                   //  0x01A00
	int var_01A04;                                   //  0x01A04
	int var_01A08;                                   //  0x01A08
	int var_01A0C;                                   //  0x01A0C
	int var_01A10;                                   //  0x01A10
	int var_01A14;                                   //  0x01A14
	int var_01A18;                                   //  0x01A18
	int var_01A1C;                                   //  0x01A1C
	int var_01A20;                                   //  0x01A20
	int var_01A24;                                   //  0x01A24
	int var_01A28;                                   //  0x01A28
	int var_01A2C;                                   //  0x01A2C
	int var_01A30;                                   //  0x01A30
	int var_01A34;                                   //  0x01A34
	int var_01A38;                                   //  0x01A38
	int var_01A3C;                                   //  0x01A3C
	int var_01A40;                                   //  0x01A40
	int var_01A44;                                   //  0x01A44
	int var_01A48;                                   //  0x01A48
	int var_01A4C;                                   //  0x01A4C
	int var_01A50;                                   //  0x01A50
	int var_01A54;                                   //  0x01A54
	int var_01A58;                                   //  0x01A58
	int var_01A5C;                                   //  0x01A5C
	int var_01A60;                                   //  0x01A60
	int var_01A64;                                   //  0x01A64
	int var_01A68;                                   //  0x01A68
	int var_01A6C;                                   //  0x01A6C
	int var_01A70;                                   //  0x01A70
	int var_01A74;                                   //  0x01A74
	int var_01A78;                                   //  0x01A78
	int var_01A7C;                                   //  0x01A7C
	int var_01A80;                                   //  0x01A80
	int var_01A84;                                   //  0x01A84
	int var_01A88;                                   //  0x01A88
	int var_01A8C;                                   //  0x01A8C
	int var_01A90;                                   //  0x01A90
	int var_01A94;                                   //  0x01A94
	int var_01A98;                                   //  0x01A98
	int var_01A9C;                                   //  0x01A9C
	int var_01AA0;                                   //  0x01AA0
	int var_01AA4;                                   //  0x01AA4
	int var_01AA8;                                   //  0x01AA8
	int var_01AAC;                                   //  0x01AAC
	int var_01AB0;                                   //  0x01AB0
	int var_01AB4;                                   //  0x01AB4
	int var_01AB8;                                   //  0x01AB8
	int var_01ABC;                                   //  0x01ABC
	int var_01AC0;                                   //  0x01AC0
	int var_01AC4;                                   //  0x01AC4
	int var_01AC8;                                   //  0x01AC8
	int var_01ACC;                                   //  0x01ACC
	int var_01AD0;                                   //  0x01AD0
	int var_01AD4;                                   //  0x01AD4
	int var_01AD8;                                   //  0x01AD8
	int var_01ADC;                                   //  0x01ADC
	int var_01AE0;                                   //  0x01AE0
	int var_01AE4;                                   //  0x01AE4
	int var_01AE8;                                   //  0x01AE8
	int var_01AEC;                                   //  0x01AEC
	int var_01AF0;                                   //  0x01AF0
	int var_01AF4;                                   //  0x01AF4
	int var_01AF8;                                   //  0x01AF8
	int var_01AFC;                                   //  0x01AFC
	int var_01B00;                                   //  0x01B00
	int var_01B04;                                   //  0x01B04
	int var_01B08;                                   //  0x01B08
	int var_01B0C;                                   //  0x01B0C
	int var_01B10;                                   //  0x01B10
	int var_01B14;                                   //  0x01B14
	int var_01B18;                                   //  0x01B18
	int var_01B1C;                                   //  0x01B1C
	int var_01B20;                                   //  0x01B20
	int var_01B24;                                   //  0x01B24
	int var_01B28;                                   //  0x01B28
	int var_01B2C;                                   //  0x01B2C
	int var_01B30;                                   //  0x01B30
	int var_01B34;                                   //  0x01B34
	int var_01B38;                                   //  0x01B38
	int var_01B3C;                                   //  0x01B3C
	int var_01B40;                                   //  0x01B40
	int var_01B44;                                   //  0x01B44
	int var_01B48;                                   //  0x01B48
	int var_01B4C;                                   //  0x01B4C
	int var_01B50;                                   //  0x01B50
	int var_01B54;                                   //  0x01B54
	int var_01B58;                                   //  0x01B58
	int var_01B5C;                                   //  0x01B5C
	int var_01B60;                                   //  0x01B60
	int var_01B64;                                   //  0x01B64
	int var_01B68;                                   //  0x01B68
	int var_01B6C;                                   //  0x01B6C
	int var_01B70;                                   //  0x01B70
	int var_01B74;                                   //  0x01B74
	int var_01B78;                                   //  0x01B78
	int var_01B7C;                                   //  0x01B7C
	int var_01B80;                                   //  0x01B80
	int var_01B84;                                   //  0x01B84
	int var_01B88;                                   //  0x01B88
	int var_01B8C;                                   //  0x01B8C
	int var_01B90;                                   //  0x01B90
	int var_01B94;                                   //  0x01B94
	int var_01B98;                                   //  0x01B98
	int var_01B9C;                                   //  0x01B9C
	int var_01BA0;                                   //  0x01BA0
	int var_01BA4;                                   //  0x01BA4
	int var_01BA8;                                   //  0x01BA8
	int var_01BAC;                                   //  0x01BAC
	int var_01BB0;                                   //  0x01BB0
	int var_01BB4;                                   //  0x01BB4
	int var_01BB8;                                   //  0x01BB8
	int var_01BBC;                                   //  0x01BBC
	int var_01BC0;                                   //  0x01BC0
	int var_01BC4;                                   //  0x01BC4
	int var_01BC8;                                   //  0x01BC8
	int var_01BCC;                                   //  0x01BCC
	int var_01BD0;                                   //  0x01BD0
	int var_01BD4;                                   //  0x01BD4
	int var_01BD8;                                   //  0x01BD8
	int var_01BDC;                                   //  0x01BDC
	int var_01BE0;                                   //  0x01BE0
	int var_01BE4;                                   //  0x01BE4
	int var_01BE8;                                   //  0x01BE8
	int var_01BEC;                                   //  0x01BEC
	int var_01BF0;                                   //  0x01BF0
	int var_01BF4;                                   //  0x01BF4
	int var_01BF8;                                   //  0x01BF8
	int var_01BFC;                                   //  0x01BFC
	int var_01C00;                                   //  0x01C00
	int var_01C04;                                   //  0x01C04
	int var_01C08;                                   //  0x01C08
	int var_01C0C;                                   //  0x01C0C
	int var_01C10;                                   //  0x01C10
	int var_01C14;                                   //  0x01C14
	int var_01C18;                                   //  0x01C18
	int var_01C1C;                                   //  0x01C1C
	int var_01C20;                                   //  0x01C20
	int var_01C24;                                   //  0x01C24
	int var_01C28;                                   //  0x01C28
	int var_01C2C;                                   //  0x01C2C
	int var_01C30;                                   //  0x01C30
	int var_01C34;                                   //  0x01C34
	int var_01C38;                                   //  0x01C38
	int var_01C3C;                                   //  0x01C3C
	int var_01C40;                                   //  0x01C40
	int var_01C44;                                   //  0x01C44
	int var_01C48;                                   //  0x01C48
	int var_01C4C;                                   //  0x01C4C
	int var_01C50;                                   //  0x01C50
	int var_01C54;                                   //  0x01C54
	int var_01C58;                                   //  0x01C58
	int var_01C5C;                                   //  0x01C5C
	int var_01C60;                                   //  0x01C60
	int var_01C64;                                   //  0x01C64
	int var_01C68;                                   //  0x01C68
	int var_01C6C;                                   //  0x01C6C
	int var_01C70;                                   //  0x01C70
	int var_01C74;                                   //  0x01C74
	int var_01C78;                                   //  0x01C78
	int var_01C7C;                                   //  0x01C7C
	int var_01C80;                                   //  0x01C80
	int var_01C84;                                   //  0x01C84
	int var_01C88;                                   //  0x01C88
	int var_01C8C;                                   //  0x01C8C
	int var_01C90;                                   //  0x01C90
	int var_01C94;                                   //  0x01C94
	int var_01C98;                                   //  0x01C98
	int var_01C9C;                                   //  0x01C9C
	int var_01CA0;                                   //  0x01CA0
	int var_01CA4;                                   //  0x01CA4
	int var_01CA8;                                   //  0x01CA8
	int var_01CAC;                                   //  0x01CAC
	int var_01CB0;                                   //  0x01CB0
	int var_01CB4;                                   //  0x01CB4
	int var_01CB8;                                   //  0x01CB8
	int var_01CBC;                                   //  0x01CBC
	int var_01CC0;                                   //  0x01CC0
	int var_01CC4;                                   //  0x01CC4
	int var_01CC8;                                   //  0x01CC8
	int var_01CCC;                                   //  0x01CCC
	int var_01CD0;                                   //  0x01CD0
	int var_01CD4;                                   //  0x01CD4
	int var_01CD8;                                   //  0x01CD8
	int var_01CDC;                                   //  0x01CDC
	int var_01CE0;                                   //  0x01CE0
	int var_01CE4;                                   //  0x01CE4
	int var_01CE8;                                   //  0x01CE8
	int var_01CEC;                                   //  0x01CEC
	int var_01CF0;                                   //  0x01CF0
	int var_01CF4;                                   //  0x01CF4
	int var_01CF8;                                   //  0x01CF8
	int var_01CFC;                                   //  0x01CFC
	int var_01D00;                                   //  0x01D00
	int var_01D04;                                   //  0x01D04
	int var_01D08;                                   //  0x01D08
	int var_01D0C;                                   //  0x01D0C
	int var_01D10;                                   //  0x01D10
	int var_01D14;                                   //  0x01D14
	int var_01D18;                                   //  0x01D18
	int var_01D1C;                                   //  0x01D1C
	int var_01D20;                                   //  0x01D20
	int var_01D24;                                   //  0x01D24
	int var_01D28;                                   //  0x01D28
	int var_01D2C;                                   //  0x01D2C
	int var_01D30;                                   //  0x01D30
	int var_01D34;                                   //  0x01D34
	int var_01D38;                                   //  0x01D38
	int var_01D3C;                                   //  0x01D3C
	int var_01D40;                                   //  0x01D40
	int var_01D44;                                   //  0x01D44
	int var_01D48;                                   //  0x01D48
	int var_01D4C;                                   //  0x01D4C
	int var_01D50;                                   //  0x01D50
	int var_01D54;                                   //  0x01D54
	int var_01D58;                                   //  0x01D58
	int var_01D5C;                                   //  0x01D5C
	int var_01D60;                                   //  0x01D60
	int var_01D64;                                   //  0x01D64
	int var_01D68;                                   //  0x01D68
	int var_01D6C;                                   //  0x01D6C
	int var_01D70;                                   //  0x01D70
	int var_01D74;                                   //  0x01D74
	int var_01D78;                                   //  0x01D78
	int var_01D7C;                                   //  0x01D7C
	int var_01D80;                                   //  0x01D80
	int var_01D84;                                   //  0x01D84
	int var_01D88;                                   //  0x01D88
	int var_01D8C;                                   //  0x01D8C
	int var_01D90;                                   //  0x01D90
	int var_01D94;                                   //  0x01D94
	int var_01D98;                                   //  0x01D98
	int var_01D9C;                                   //  0x01D9C
	int var_01DA0;                                   //  0x01DA0
	int var_01DA4;                                   //  0x01DA4
	int var_01DA8;                                   //  0x01DA8
	int var_01DAC;                                   //  0x01DAC
	int var_01DB0;                                   //  0x01DB0
	int var_01DB4;                                   //  0x01DB4
	int var_01DB8;                                   //  0x01DB8
	int var_01DBC;                                   //  0x01DBC
	int var_01DC0;                                   //  0x01DC0
	int var_01DC4;                                   //  0x01DC4
	int var_01DC8;                                   //  0x01DC8
	int var_01DCC;                                   //  0x01DCC
	int var_01DD0;                                   //  0x01DD0
	int var_01DD4;                                   //  0x01DD4
	int var_01DD8;                                   //  0x01DD8
	int var_01DDC;                                   //  0x01DDC
	int var_01DE0;                                   //  0x01DE0
	int var_01DE4;                                   //  0x01DE4
	int var_01DE8;                                   //  0x01DE8
	int var_01DEC;                                   //  0x01DEC
	int var_01DF0;                                   //  0x01DF0
	int var_01DF4;                                   //  0x01DF4
	int var_01DF8;                                   //  0x01DF8
	int var_01DFC;                                   //  0x01DFC
	int var_01E00;                                   //  0x01E00
	int var_01E04;                                   //  0x01E04
	int var_01E08;                                   //  0x01E08
	int var_01E0C;                                   //  0x01E0C
	int var_01E10;                                   //  0x01E10
	int var_01E14;                                   //  0x01E14
	int var_01E18;                                   //  0x01E18
	int var_01E1C;                                   //  0x01E1C
	int var_01E20;                                   //  0x01E20
	int var_01E24;                                   //  0x01E24
	int var_01E28;                                   //  0x01E28
	int var_01E2C;                                   //  0x01E2C
	int var_01E30;                                   //  0x01E30
	int var_01E34;                                   //  0x01E34
	int var_01E38;                                   //  0x01E38
	int var_01E3C;                                   //  0x01E3C
	int var_01E40;                                   //  0x01E40
	int var_01E44;                                   //  0x01E44
	int var_01E48;                                   //  0x01E48
	int var_01E4C;                                   //  0x01E4C
	int var_01E50;                                   //  0x01E50
	int var_01E54;                                   //  0x01E54
	int var_01E58;                                   //  0x01E58
	int var_01E5C;                                   //  0x01E5C
	int var_01E60;                                   //  0x01E60
	int var_01E64;                                   //  0x01E64
	int var_01E68;                                   //  0x01E68
	int var_01E6C;                                   //  0x01E6C
	int var_01E70;                                   //  0x01E70
	int var_01E74;                                   //  0x01E74
	int var_01E78;                                   //  0x01E78
	int var_01E7C;                                   //  0x01E7C
	int var_01E80;                                   //  0x01E80
	int var_01E84;                                   //  0x01E84
	int var_01E88;                                   //  0x01E88
	int var_01E8C;                                   //  0x01E8C
	int var_01E90;                                   //  0x01E90
	int var_01E94;                                   //  0x01E94
	int var_01E98;                                   //  0x01E98
	int var_01E9C;                                   //  0x01E9C
	int var_01EA0;                                   //  0x01EA0
	int var_01EA4;                                   //  0x01EA4
	int var_01EA8;                                   //  0x01EA8
	int var_01EAC;                                   //  0x01EAC
	int var_01EB0;                                   //  0x01EB0
	int var_01EB4;                                   //  0x01EB4
	int var_01EB8;                                   //  0x01EB8
	int var_01EBC;                                   //  0x01EBC
	int var_01EC0;                                   //  0x01EC0
	int var_01EC4;                                   //  0x01EC4
	int var_01EC8;                                   //  0x01EC8
	int var_01ECC;                                   //  0x01ECC
	int var_01ED0;                                   //  0x01ED0
	int var_01ED4;                                   //  0x01ED4
	int var_01ED8;                                   //  0x01ED8
	int var_01EDC;                                   //  0x01EDC
	int var_01EE0;                                   //  0x01EE0
	int var_01EE4;                                   //  0x01EE4
	int var_01EE8;                                   //  0x01EE8
	int var_01EEC;                                   //  0x01EEC
	int var_01EF0;                                   //  0x01EF0
	int var_01EF4;                                   //  0x01EF4
	int var_01EF8;                                   //  0x01EF8
	int var_01EFC;                                   //  0x01EFC
	int var_01F00;                                   //  0x01F00
	int var_01F04;                                   //  0x01F04
	int var_01F08;                                   //  0x01F08
	int var_01F0C;                                   //  0x01F0C
	int var_01F10;                                   //  0x01F10
	int var_01F14;                                   //  0x01F14
	int var_01F18;                                   //  0x01F18
	int var_01F1C;                                   //  0x01F1C
	int var_01F20;                                   //  0x01F20
	int var_01F24;                                   //  0x01F24
	int var_01F28;                                   //  0x01F28
	int var_01F2C;                                   //  0x01F2C
	int var_01F30;                                   //  0x01F30
	int var_01F34;                                   //  0x01F34
	int var_01F38;                                   //  0x01F38
	int var_01F3C;                                   //  0x01F3C
	int var_01F40;                                   //  0x01F40
	int var_01F44;                                   //  0x01F44
	int var_01F48;                                   //  0x01F48
	int var_01F4C;                                   //  0x01F4C
	int var_01F50;                                   //  0x01F50
	int var_01F54;                                   //  0x01F54
	int var_01F58;                                   //  0x01F58
	int var_01F5C;                                   //  0x01F5C
	int var_01F60;                                   //  0x01F60
	int var_01F64;                                   //  0x01F64
	int var_01F68;                                   //  0x01F68
	int var_01F6C;                                   //  0x01F6C
	int var_01F70;                                   //  0x01F70
	int var_01F74;                                   //  0x01F74
	int var_01F78;                                   //  0x01F78
	int var_01F7C;                                   //  0x01F7C
	int var_01F80;                                   //  0x01F80
	int var_01F84;                                   //  0x01F84
	int var_01F88;                                   //  0x01F88
	int var_01F8C;                                   //  0x01F8C
	int var_01F90;                                   //  0x01F90
	int var_01F94;                                   //  0x01F94
	int var_01F98;                                   //  0x01F98
	int var_01F9C;                                   //  0x01F9C
	int var_01FA0;                                   //  0x01FA0
	int var_01FA4;                                   //  0x01FA4
	int var_01FA8;                                   //  0x01FA8
	int var_01FAC;                                   //  0x01FAC
	int var_01FB0;                                   //  0x01FB0
	int var_01FB4;                                   //  0x01FB4
	int var_01FB8;                                   //  0x01FB8
	int var_01FBC;                                   //  0x01FBC
	int var_01FC0;                                   //  0x01FC0
	int var_01FC4;                                   //  0x01FC4
	int var_01FC8;                                   //  0x01FC8
	int var_01FCC;                                   //  0x01FCC
	int var_01FD0;                                   //  0x01FD0
	int var_01FD4;                                   //  0x01FD4
	int var_01FD8;                                   //  0x01FD8
	int var_01FDC;                                   //  0x01FDC
	int var_01FE0;                                   //  0x01FE0
	int var_01FE4;                                   //  0x01FE4
	int var_01FE8;                                   //  0x01FE8
	int var_01FEC;                                   //  0x01FEC
	int var_01FF0;                                   //  0x01FF0
	int var_01FF4;                                   //  0x01FF4
	int var_01FF8;                                   //  0x01FF8
	int var_01FFC;                                   //  0x01FFC
	int var_02000;                                   //  0x02000
	int var_02004;                                   //  0x02004
	int var_02008;                                   //  0x02008
	int var_0200C;                                   //  0x0200C
	int var_02010;                                   //  0x02010
	int var_02014;                                   //  0x02014
	int var_02018;                                   //  0x02018
	int var_0201C;                                   //  0x0201C
	int var_02020;                                   //  0x02020
	int var_02024;                                   //  0x02024
	int var_02028;                                   //  0x02028
	int var_0202C;                                   //  0x0202C
	int var_02030;                                   //  0x02030
	int var_02034;                                   //  0x02034
	int var_02038;                                   //  0x02038
	int var_0203C;                                   //  0x0203C
	int var_02040;                                   //  0x02040
	int var_02044;                                   //  0x02044
	int var_02048;                                   //  0x02048
	int var_0204C;                                   //  0x0204C
	int var_02050;                                   //  0x02050
	int var_02054;                                   //  0x02054
	int var_02058;                                   //  0x02058
	int var_0205C;                                   //  0x0205C
	int var_02060;                                   //  0x02060
	int var_02064;                                   //  0x02064
	int var_02068;                                   //  0x02068
	int var_0206C;                                   //  0x0206C
	int var_02070;                                   //  0x02070
	int var_02074;                                   //  0x02074
	int var_02078;                                   //  0x02078
	int var_0207C;                                   //  0x0207C
	int var_02080;                                   //  0x02080
	int var_02084;                                   //  0x02084
	int var_02088;                                   //  0x02088
	int var_0208C;                                   //  0x0208C
	int var_02090;                                   //  0x02090
	int var_02094;                                   //  0x02094
	int var_02098;                                   //  0x02098
	int var_0209C;                                   //  0x0209C
	int var_020A0;                                   //  0x020A0
	int var_020A4;                                   //  0x020A4
	int var_020A8;                                   //  0x020A8
	int var_020AC;                                   //  0x020AC
	int var_020B0;                                   //  0x020B0
	int var_020B4;                                   //  0x020B4
	int var_020B8;                                   //  0x020B8
	int var_020BC;                                   //  0x020BC
	int var_020C0;                                   //  0x020C0
	int var_020C4;                                   //  0x020C4
	int var_020C8;                                   //  0x020C8
	int var_020CC;                                   //  0x020CC
	int var_020D0;                                   //  0x020D0
	int var_020D4;                                   //  0x020D4
	int var_020D8;                                   //  0x020D8
	int var_020DC;                                   //  0x020DC
	int var_020E0;                                   //  0x020E0
	int var_020E4;                                   //  0x020E4
	int var_020E8;                                   //  0x020E8
	int var_020EC;                                   //  0x020EC
	int var_020F0;                                   //  0x020F0
	int var_020F4;                                   //  0x020F4
	int var_020F8;                                   //  0x020F8
	int var_020FC;                                   //  0x020FC
	int var_02100;                                   //  0x02100
	int var_02104;                                   //  0x02104
	int var_02108;                                   //  0x02108
	int var_0210C;                                   //  0x0210C
	int var_02110;                                   //  0x02110
	int var_02114;                                   //  0x02114
	int var_02118;                                   //  0x02118
	int var_0211C;                                   //  0x0211C
	int var_02120;                                   //  0x02120
	int var_02124;                                   //  0x02124
	int var_02128;                                   //  0x02128
	int var_0212C;                                   //  0x0212C
	int var_02130;                                   //  0x02130
	int var_02134;                                   //  0x02134
	int var_02138;                                   //  0x02138
	int var_0213C;                                   //  0x0213C
	int var_02140;                                   //  0x02140
	int var_02144;                                   //  0x02144
	int var_02148;                                   //  0x02148
	int var_0214C;                                   //  0x0214C
	int var_02150;                                   //  0x02150
	int var_02154;                                   //  0x02154
	int var_02158;                                   //  0x02158
	int var_0215C;                                   //  0x0215C
	int var_02160;                                   //  0x02160
	int var_02164;                                   //  0x02164
	int var_02168;                                   //  0x02168
	int var_0216C;                                   //  0x0216C
	int var_02170;                                   //  0x02170
	int var_02174;                                   //  0x02174
	int var_02178;                                   //  0x02178
	int var_0217C;                                   //  0x0217C
	int var_02180;                                   //  0x02180
	int var_02184;                                   //  0x02184
	int var_02188;                                   //  0x02188
	int var_0218C;                                   //  0x0218C
	int var_02190;                                   //  0x02190
	int var_02194;                                   //  0x02194
	int var_02198;                                   //  0x02198
	int var_0219C;                                   //  0x0219C
	int var_021A0;                                   //  0x021A0
	int var_021A4;                                   //  0x021A4
	int var_021A8;                                   //  0x021A8
	int var_021AC;                                   //  0x021AC
	int var_021B0;                                   //  0x021B0
	int var_021B4;                                   //  0x021B4
	int var_021B8;                                   //  0x021B8
	int var_021BC;                                   //  0x021BC
	int var_021C0;                                   //  0x021C0
	int var_021C4;                                   //  0x021C4
	int var_021C8;                                   //  0x021C8
	int var_021CC;                                   //  0x021CC
	int var_021D0;                                   //  0x021D0
	int var_021D4;                                   //  0x021D4
	int var_021D8;                                   //  0x021D8
	int var_021DC;                                   //  0x021DC
	int var_021E0;                                   //  0x021E0
	int var_021E4;                                   //  0x021E4
	int var_021E8;                                   //  0x021E8
	int var_021EC;                                   //  0x021EC
	int var_021F0;                                   //  0x021F0
	int var_021F4;                                   //  0x021F4
	int var_021F8;                                   //  0x021F8
	int var_021FC;                                   //  0x021FC
	int var_02200;                                   //  0x02200
	int var_02204;                                   //  0x02204
	int var_02208;                                   //  0x02208
	int var_0220C;                                   //  0x0220C
	int var_02210;                                   //  0x02210
	int var_02214;                                   //  0x02214
	int var_02218;                                   //  0x02218
	int var_0221C;                                   //  0x0221C
	int var_02220;                                   //  0x02220
	int var_02224;                                   //  0x02224
	int var_02228;                                   //  0x02228
	int var_0222C;                                   //  0x0222C
	int var_02230;                                   //  0x02230
	int var_02234;                                   //  0x02234
	int var_02238;                                   //  0x02238
	int var_0223C;                                   //  0x0223C
	int var_02240;                                   //  0x02240
	int var_02244;                                   //  0x02244
	int var_02248;                                   //  0x02248
	int var_0224C;                                   //  0x0224C
	int var_02250;                                   //  0x02250
	int var_02254;                                   //  0x02254
	int var_02258;                                   //  0x02258
	int var_0225C;                                   //  0x0225C
	int var_02260;                                   //  0x02260
	int var_02264;                                   //  0x02264
	int var_02268;                                   //  0x02268
	int var_0226C;                                   //  0x0226C
	int var_02270;                                   //  0x02270
	int var_02274;                                   //  0x02274
	int var_02278;                                   //  0x02278
	int var_0227C;                                   //  0x0227C
	int var_02280;                                   //  0x02280
	int var_02284;                                   //  0x02284
	int var_02288;                                   //  0x02288
	int var_0228C;                                   //  0x0228C
	int var_02290;                                   //  0x02290
	int var_02294;                                   //  0x02294
	int var_02298;                                   //  0x02298
	int var_0229C;                                   //  0x0229C
	int var_022A0;                                   //  0x022A0
	int var_022A4;                                   //  0x022A4
	int var_022A8;                                   //  0x022A8
	int var_022AC;                                   //  0x022AC
	int var_022B0;                                   //  0x022B0
	int var_022B4;                                   //  0x022B4
	int var_022B8;                                   //  0x022B8
	int var_022BC;                                   //  0x022BC
	int var_022C0;                                   //  0x022C0
	int var_022C4;                                   //  0x022C4
	int var_022C8;                                   //  0x022C8
	int var_022CC;                                   //  0x022CC
	int var_022D0;                                   //  0x022D0
	int var_022D4;                                   //  0x022D4
	int var_022D8;                                   //  0x022D8
	int var_022DC;                                   //  0x022DC
	int var_022E0;                                   //  0x022E0
	int var_022E4;                                   //  0x022E4
	int var_022E8;                                   //  0x022E8
	int var_022EC;                                   //  0x022EC
	int var_022F0;                                   //  0x022F0
	int var_022F4;                                   //  0x022F4
	int var_022F8;                                   //  0x022F8
	int var_022FC;                                   //  0x022FC
	int var_02300;                                   //  0x02300
	int var_02304;                                   //  0x02304
	int var_02308;                                   //  0x02308
	int var_0230C;                                   //  0x0230C
	int var_02310;                                   //  0x02310
	int var_02314;                                   //  0x02314
	int var_02318;                                   //  0x02318
	int var_0231C;                                   //  0x0231C
	int var_02320;                                   //  0x02320
	int var_02324;                                   //  0x02324
	int var_02328;                                   //  0x02328
	int var_0232C;                                   //  0x0232C
	int var_02330;                                   //  0x02330
	int var_02334;                                   //  0x02334
	int var_02338;                                   //  0x02338
	int var_0233C;                                   //  0x0233C
	int var_02340;                                   //  0x02340
	int var_02344;                                   //  0x02344
	int var_02348;                                   //  0x02348
	int var_0234C;                                   //  0x0234C
	int var_02350;                                   //  0x02350
	int var_02354;                                   //  0x02354
	int var_02358;                                   //  0x02358
	int var_0235C;                                   //  0x0235C
	int var_02360;                                   //  0x02360
	int var_02364;                                   //  0x02364
	int var_02368;                                   //  0x02368
	int var_0236C;                                   //  0x0236C
	int var_02370;                                   //  0x02370
	int var_02374;                                   //  0x02374
	int var_02378;                                   //  0x02378
	int var_0237C;                                   //  0x0237C
	int var_02380;                                   //  0x02380
	int var_02384;                                   //  0x02384
	int var_02388;                                   //  0x02388
	int var_0238C;                                   //  0x0238C
	int var_02390;                                   //  0x02390
	int var_02394;                                   //  0x02394
	int var_02398;                                   //  0x02398
	int var_0239C;                                   //  0x0239C
	int var_023A0;                                   //  0x023A0
	int var_023A4;                                   //  0x023A4
	int var_023A8;                                   //  0x023A8
	int var_023AC;                                   //  0x023AC
	int var_023B0;                                   //  0x023B0
	int var_023B4;                                   //  0x023B4
	int var_023B8;                                   //  0x023B8
	int var_023BC;                                   //  0x023BC
	int var_023C0;                                   //  0x023C0
	int var_023C4;                                   //  0x023C4
	int var_023C8;                                   //  0x023C8
	int var_023CC;                                   //  0x023CC
	int var_023D0;                                   //  0x023D0
	int var_023D4;                                   //  0x023D4
	int var_023D8;                                   //  0x023D8
	int var_023DC;                                   //  0x023DC
	int var_023E0;                                   //  0x023E0
	int var_023E4;                                   //  0x023E4
	int var_023E8;                                   //  0x023E8
	int var_023EC;                                   //  0x023EC
	int var_023F0;                                   //  0x023F0
	int var_023F4;                                   //  0x023F4
	int var_023F8;                                   //  0x023F8
	int var_023FC;                                   //  0x023FC
	int var_02400;                                   //  0x02400
	int var_02404;                                   //  0x02404
	int var_02408;                                   //  0x02408
	int var_0240C;                                   //  0x0240C
	int var_02410;                                   //  0x02410
	int var_02414;                                   //  0x02414
	int var_02418;                                   //  0x02418
	int var_0241C;                                   //  0x0241C
	int var_02420;                                   //  0x02420
	int var_02424;                                   //  0x02424
	int var_02428;                                   //  0x02428
	int var_0242C;                                   //  0x0242C
	int var_02430;                                   //  0x02430
	int var_02434;                                   //  0x02434
	int var_02438;                                   //  0x02438
	int var_0243C;                                   //  0x0243C
	int var_02440;                                   //  0x02440
	int var_02444;                                   //  0x02444
	int var_02448;                                   //  0x02448
	int var_0244C;                                   //  0x0244C
	int var_02450;                                   //  0x02450
	int var_02454;                                   //  0x02454
	int var_02458;                                   //  0x02458
	int var_0245C;                                   //  0x0245C
	int var_02460;                                   //  0x02460
	int var_02464;                                   //  0x02464
	int var_02468;                                   //  0x02468
	int var_0246C;                                   //  0x0246C
	int var_02470;                                   //  0x02470
	int var_02474;                                   //  0x02474
	int var_02478;                                   //  0x02478
	int var_0247C;                                   //  0x0247C
	int var_02480;                                   //  0x02480
	int var_02484;                                   //  0x02484
	int var_02488;                                   //  0x02488
	int var_0248C;                                   //  0x0248C
	int var_02490;                                   //  0x02490
	int var_02494;                                   //  0x02494
	int var_02498;                                   //  0x02498
	int var_0249C;                                   //  0x0249C
	int var_024A0;                                   //  0x024A0
	int var_024A4;                                   //  0x024A4
	int var_024A8;                                   //  0x024A8
	int var_024AC;                                   //  0x024AC
	int var_024B0;                                   //  0x024B0
	int var_024B4;                                   //  0x024B4
	int var_024B8;                                   //  0x024B8
	int var_024BC;                                   //  0x024BC
	int var_024C0;                                   //  0x024C0
	int var_024C4;                                   //  0x024C4
	int var_024C8;                                   //  0x024C8
	int var_024CC;                                   //  0x024CC
	int var_024D0;                                   //  0x024D0
	int var_024D4;                                   //  0x024D4
	int var_024D8;                                   //  0x024D8
	int var_024DC;                                   //  0x024DC
	int var_024E0;                                   //  0x024E0
	int var_024E4;                                   //  0x024E4
	int var_024E8;                                   //  0x024E8
	int var_024EC;                                   //  0x024EC
	int var_024F0;                                   //  0x024F0
	int var_024F4;                                   //  0x024F4
	int var_024F8;                                   //  0x024F8
	int var_024FC;                                   //  0x024FC
	int var_02500;                                   //  0x02500
	int var_02504;                                   //  0x02504
	int var_02508;                                   //  0x02508
	int var_0250C;                                   //  0x0250C
	int var_02510;                                   //  0x02510
	int var_02514;                                   //  0x02514
	int var_02518;                                   //  0x02518
	int var_0251C;                                   //  0x0251C
	int var_02520;                                   //  0x02520
	int var_02524;                                   //  0x02524
	int var_02528;                                   //  0x02528
	int var_0252C;                                   //  0x0252C
	int var_02530;                                   //  0x02530
	int var_02534;                                   //  0x02534
	int var_02538;                                   //  0x02538
	int var_0253C;                                   //  0x0253C
	int var_02540;                                   //  0x02540
	int var_02544;                                   //  0x02544
	int var_02548;                                   //  0x02548
	int var_0254C;                                   //  0x0254C
	int var_02550;                                   //  0x02550
	int var_02554;                                   //  0x02554
	int var_02558;                                   //  0x02558
	int var_0255C;                                   //  0x0255C
	int var_02560;                                   //  0x02560
	int var_02564;                                   //  0x02564
	int var_02568;                                   //  0x02568
	int var_0256C;                                   //  0x0256C
	int var_02570;                                   //  0x02570
	int var_02574;                                   //  0x02574
	int var_02578;                                   //  0x02578
	int var_0257C;                                   //  0x0257C
	int var_02580;                                   //  0x02580
	int var_02584;                                   //  0x02584
	int var_02588;                                   //  0x02588
	int var_0258C;                                   //  0x0258C
	int var_02590;                                   //  0x02590
	int var_02594;                                   //  0x02594
	int var_02598;                                   //  0x02598
	int var_0259C;                                   //  0x0259C
	int var_025A0;                                   //  0x025A0
	int var_025A4;                                   //  0x025A4
	int var_025A8;                                   //  0x025A8
	int var_025AC;                                   //  0x025AC
	int var_025B0;                                   //  0x025B0
	int var_025B4;                                   //  0x025B4
	int var_025B8;                                   //  0x025B8
	int var_025BC;                                   //  0x025BC
	int var_025C0;                                   //  0x025C0
	int var_025C4;                                   //  0x025C4
	int var_025C8;                                   //  0x025C8
	int var_025CC;                                   //  0x025CC
	int var_025D0;                                   //  0x025D0
	int var_025D4;                                   //  0x025D4
	int var_025D8;                                   //  0x025D8
	int var_025DC;                                   //  0x025DC
	int var_025E0;                                   //  0x025E0
	int var_025E4;                                   //  0x025E4
	int var_025E8;                                   //  0x025E8
	int var_025EC;                                   //  0x025EC
	int var_025F0;                                   //  0x025F0
	int var_025F4;                                   //  0x025F4
	int var_025F8;                                   //  0x025F8
	int var_025FC;                                   //  0x025FC
	int var_02600;                                   //  0x02600
	int var_02604;                                   //  0x02604
	int var_02608;                                   //  0x02608
	int var_0260C;                                   //  0x0260C
	int var_02610;                                   //  0x02610
	int var_02614;                                   //  0x02614
	int var_02618;                                   //  0x02618
	int var_0261C;                                   //  0x0261C
	int var_02620;                                   //  0x02620
	int var_02624;                                   //  0x02624
	int var_02628;                                   //  0x02628
	int var_0262C;                                   //  0x0262C
	int var_02630;                                   //  0x02630
	int var_02634;                                   //  0x02634
	int var_02638;                                   //  0x02638
	int var_0263C;                                   //  0x0263C
	int var_02640;                                   //  0x02640
	int var_02644;                                   //  0x02644
	int var_02648;                                   //  0x02648
	int var_0264C;                                   //  0x0264C
	int var_02650;                                   //  0x02650
	int var_02654;                                   //  0x02654
	int var_02658;                                   //  0x02658
	int var_0265C;                                   //  0x0265C
	int var_02660;                                   //  0x02660
	int var_02664;                                   //  0x02664
	int var_02668;                                   //  0x02668
	int var_0266C;                                   //  0x0266C
	int var_02670;                                   //  0x02670
	int var_02674;                                   //  0x02674
	int var_02678;                                   //  0x02678
	int var_0267C;                                   //  0x0267C
	int var_02680;                                   //  0x02680
	int var_02684;                                   //  0x02684
	int var_02688;                                   //  0x02688
	int var_0268C;                                   //  0x0268C
	int var_02690;                                   //  0x02690
	int var_02694;                                   //  0x02694
	int var_02698;                                   //  0x02698
	int var_0269C;                                   //  0x0269C
	int var_026A0;                                   //  0x026A0
	int var_026A4;                                   //  0x026A4
	int var_026A8;                                   //  0x026A8
	int var_026AC;                                   //  0x026AC
	int var_026B0;                                   //  0x026B0
	int var_026B4;                                   //  0x026B4
	int var_026B8;                                   //  0x026B8
	int var_026BC;                                   //  0x026BC
	int var_026C0;                                   //  0x026C0
	int var_026C4;                                   //  0x026C4
	int var_026C8;                                   //  0x026C8
	int var_026CC;                                   //  0x026CC
	int var_026D0;                                   //  0x026D0
	int var_026D4;                                   //  0x026D4
	int var_026D8;                                   //  0x026D8
	int var_026DC;                                   //  0x026DC
	int var_026E0;                                   //  0x026E0
	int var_026E4;                                   //  0x026E4
	int var_026E8;                                   //  0x026E8
	int var_026EC;                                   //  0x026EC
	int var_026F0;                                   //  0x026F0
	int var_026F4;                                   //  0x026F4
	int var_026F8;                                   //  0x026F8
	int var_026FC;                                   //  0x026FC
	int var_02700;                                   //  0x02700
	int var_02704;                                   //  0x02704
	int var_02708;                                   //  0x02708
	int var_0270C;                                   //  0x0270C
	int var_02710;                                   //  0x02710
	int var_02714;                                   //  0x02714
	int var_02718;                                   //  0x02718
	int var_0271C;                                   //  0x0271C
	int var_02720;                                   //  0x02720
	int var_02724;                                   //  0x02724
	int var_02728;                                   //  0x02728
	int var_0272C;                                   //  0x0272C
	int var_02730;                                   //  0x02730
	int var_02734;                                   //  0x02734
	int var_02738;                                   //  0x02738
	int var_0273C;                                   //  0x0273C
	int var_02740;                                   //  0x02740
	int var_02744;                                   //  0x02744
	int var_02748;                                   //  0x02748
	int var_0274C;                                   //  0x0274C
	int var_02750;                                   //  0x02750
	int var_02754;                                   //  0x02754
	int var_02758;                                   //  0x02758
	int var_0275C;                                   //  0x0275C
	int var_02760;                                   //  0x02760
	int var_02764;                                   //  0x02764
	int var_02768;                                   //  0x02768
	int var_0276C;                                   //  0x0276C
	int var_02770;                                   //  0x02770
	int var_02774;                                   //  0x02774
	int var_02778;                                   //  0x02778
	int var_0277C;                                   //  0x0277C
	int var_02780;                                   //  0x02780
	int var_02784;                                   //  0x02784
	int var_02788;                                   //  0x02788
	int var_0278C;                                   //  0x0278C
	int var_02790;                                   //  0x02790
	int var_02794;                                   //  0x02794
	int var_02798;                                   //  0x02798
	int var_0279C;                                   //  0x0279C
	int var_027A0;                                   //  0x027A0
	int var_027A4;                                   //  0x027A4
	int var_027A8;                                   //  0x027A8
	int var_027AC;                                   //  0x027AC
	int var_027B0;                                   //  0x027B0
	int var_027B4;                                   //  0x027B4
	int var_027B8;                                   //  0x027B8
	int var_027BC;                                   //  0x027BC
	int var_027C0;                                   //  0x027C0
	int var_027C4;                                   //  0x027C4
	int var_027C8;                                   //  0x027C8
	int var_027CC;                                   //  0x027CC
	int var_027D0;                                   //  0x027D0
	int var_027D4;                                   //  0x027D4
	int var_027D8;                                   //  0x027D8
	int var_027DC;                                   //  0x027DC
	int var_027E0;                                   //  0x027E0
	int var_027E4;                                   //  0x027E4
	int var_027E8;                                   //  0x027E8
	int var_027EC;                                   //  0x027EC
	int var_027F0;                                   //  0x027F0
	int var_027F4;                                   //  0x027F4
	int var_027F8;                                   //  0x027F8
	int var_027FC;                                   //  0x027FC
	int var_02800;                                   //  0x02800
	int var_02804;                                   //  0x02804
	int var_02808;                                   //  0x02808
	int var_0280C;                                   //  0x0280C
	int var_02810;                                   //  0x02810
	int var_02814;                                   //  0x02814
	int var_02818;                                   //  0x02818
	int var_0281C;                                   //  0x0281C
	int var_02820;                                   //  0x02820
	int var_02824;                                   //  0x02824
	int var_02828;                                   //  0x02828
	int var_0282C;                                   //  0x0282C
	int var_02830;                                   //  0x02830
	int var_02834;                                   //  0x02834
	int var_02838;                                   //  0x02838
	int var_0283C;                                   //  0x0283C
	int var_02840;                                   //  0x02840
	int var_02844;                                   //  0x02844
	int var_02848;                                   //  0x02848
	int var_0284C;                                   //  0x0284C
	int var_02850;                                   //  0x02850
	int var_02854;                                   //  0x02854
	int var_02858;                                   //  0x02858
	int var_0285C;                                   //  0x0285C
	int var_02860;                                   //  0x02860
	int var_02864;                                   //  0x02864
	int var_02868;                                   //  0x02868
	int var_0286C;                                   //  0x0286C
	int var_02870;                                   //  0x02870
	int var_02874;                                   //  0x02874
	int var_02878;                                   //  0x02878
	int var_0287C;                                   //  0x0287C
	int var_02880;                                   //  0x02880
	int var_02884;                                   //  0x02884
	int var_02888;                                   //  0x02888
	int var_0288C;                                   //  0x0288C
	int var_02890;                                   //  0x02890
	int var_02894;                                   //  0x02894
	int var_02898;                                   //  0x02898
	int var_0289C;                                   //  0x0289C
	int var_028A0;                                   //  0x028A0
	int var_028A4;                                   //  0x028A4
	int var_028A8;                                   //  0x028A8
	int var_028AC;                                   //  0x028AC
	int var_028B0;                                   //  0x028B0
	int var_028B4;                                   //  0x028B4
	int var_028B8;                                   //  0x028B8
	int var_028BC;                                   //  0x028BC
	int var_028C0;                                   //  0x028C0
	int var_028C4;                                   //  0x028C4
	int var_028C8;                                   //  0x028C8
	int var_028CC;                                   //  0x028CC
	int var_028D0;                                   //  0x028D0
	int var_028D4;                                   //  0x028D4
	int var_028D8;                                   //  0x028D8
	int var_028DC;                                   //  0x028DC
	int var_028E0;                                   //  0x028E0
	int var_028E4;                                   //  0x028E4
	int var_028E8;                                   //  0x028E8
	int var_028EC;                                   //  0x028EC
	int var_028F0;                                   //  0x028F0
	int var_028F4;                                   //  0x028F4
	int var_028F8;                                   //  0x028F8
	int var_028FC;                                   //  0x028FC
	int var_02900;                                   //  0x02900
	int var_02904;                                   //  0x02904
	int var_02908;                                   //  0x02908
	int var_0290C;                                   //  0x0290C
	int var_02910;                                   //  0x02910
	int var_02914;                                   //  0x02914
	int var_02918;                                   //  0x02918
	int var_0291C;                                   //  0x0291C
	int var_02920;                                   //  0x02920
	int var_02924;                                   //  0x02924
	int var_02928;                                   //  0x02928
	int var_0292C;                                   //  0x0292C
	int var_02930;                                   //  0x02930
	int var_02934;                                   //  0x02934
	int var_02938;                                   //  0x02938
	int var_0293C;                                   //  0x0293C
	int var_02940;                                   //  0x02940
	int var_02944;                                   //  0x02944
	int var_02948;                                   //  0x02948
	int var_0294C;                                   //  0x0294C
	int var_02950;                                   //  0x02950
	int var_02954;                                   //  0x02954
	int var_02958;                                   //  0x02958
	int var_0295C;                                   //  0x0295C
	int var_02960;                                   //  0x02960
	int var_02964;                                   //  0x02964
	int var_02968;                                   //  0x02968
	int var_0296C;                                   //  0x0296C
	int var_02970;                                   //  0x02970
	int var_02974;                                   //  0x02974
	int var_02978;                                   //  0x02978
	int var_0297C;                                   //  0x0297C
	int var_02980;                                   //  0x02980
	int var_02984;                                   //  0x02984
	int var_02988;                                   //  0x02988
	int var_0298C;                                   //  0x0298C
	int var_02990;                                   //  0x02990
	int var_02994;                                   //  0x02994
	int var_02998;                                   //  0x02998
	int var_0299C;                                   //  0x0299C
	int var_029A0;                                   //  0x029A0
	int var_029A4;                                   //  0x029A4
	int var_029A8;                                   //  0x029A8
	int var_029AC;                                   //  0x029AC
	int var_029B0;                                   //  0x029B0
	int var_029B4;                                   //  0x029B4
	int var_029B8;                                   //  0x029B8
	int var_029BC;                                   //  0x029BC
	int var_029C0;                                   //  0x029C0
	int var_029C4;                                   //  0x029C4
	int var_029C8;                                   //  0x029C8
	int var_029CC;                                   //  0x029CC
	int var_029D0;                                   //  0x029D0
	int var_029D4;                                   //  0x029D4
	int var_029D8;                                   //  0x029D8
	int var_029DC;                                   //  0x029DC
	int var_029E0;                                   //  0x029E0
	int var_029E4;                                   //  0x029E4
	int var_029E8;                                   //  0x029E8
	int var_029EC;                                   //  0x029EC
	int var_029F0;                                   //  0x029F0
	int var_029F4;                                   //  0x029F4
	int var_029F8;                                   //  0x029F8
	int var_029FC;                                   //  0x029FC
	int var_02A00;                                   //  0x02A00
	int var_02A04;                                   //  0x02A04
	int var_02A08;                                   //  0x02A08
	int var_02A0C;                                   //  0x02A0C
	int var_02A10;                                   //  0x02A10
	int var_02A14;                                   //  0x02A14
	int var_02A18;                                   //  0x02A18
	int var_02A1C;                                   //  0x02A1C
	int var_02A20;                                   //  0x02A20
	int var_02A24;                                   //  0x02A24
	int var_02A28;                                   //  0x02A28
	int var_02A2C;                                   //  0x02A2C
	int var_02A30;                                   //  0x02A30
	int var_02A34;                                   //  0x02A34
	int var_02A38;                                   //  0x02A38
	int var_02A3C;                                   //  0x02A3C
	int var_02A40;                                   //  0x02A40
	int var_02A44;                                   //  0x02A44
	int var_02A48;                                   //  0x02A48
	int var_02A4C;                                   //  0x02A4C
	int var_02A50;                                   //  0x02A50
	int var_02A54;                                   //  0x02A54
	int var_02A58;                                   //  0x02A58
	int var_02A5C;                                   //  0x02A5C
	int var_02A60;                                   //  0x02A60
	int var_02A64;                                   //  0x02A64
	int var_02A68;                                   //  0x02A68
	int var_02A6C;                                   //  0x02A6C
	int var_02A70;                                   //  0x02A70
	int var_02A74;                                   //  0x02A74
	int var_02A78;                                   //  0x02A78
	int var_02A7C;                                   //  0x02A7C
	int var_02A80;                                   //  0x02A80
	int var_02A84;                                   //  0x02A84
	int var_02A88;                                   //  0x02A88
	int var_02A8C;                                   //  0x02A8C
	int var_02A90;                                   //  0x02A90
	int var_02A94;                                   //  0x02A94
	int var_02A98;                                   //  0x02A98
	int var_02A9C;                                   //  0x02A9C
	int var_02AA0;                                   //  0x02AA0
	int var_02AA4;                                   //  0x02AA4
	int var_02AA8;                                   //  0x02AA8
	int var_02AAC;                                   //  0x02AAC
	int var_02AB0;                                   //  0x02AB0
	int var_02AB4;                                   //  0x02AB4
	int var_02AB8;                                   //  0x02AB8
	int var_02ABC;                                   //  0x02ABC
	int var_02AC0;                                   //  0x02AC0
	int var_02AC4;                                   //  0x02AC4
	int var_02AC8;                                   //  0x02AC8
	int var_02ACC;                                   //  0x02ACC
	int var_02AD0;                                   //  0x02AD0
	int var_02AD4;                                   //  0x02AD4
	int var_02AD8;                                   //  0x02AD8
	int var_02ADC;                                   //  0x02ADC
	int var_02AE0;                                   //  0x02AE0
	int var_02AE4;                                   //  0x02AE4
	int var_02AE8;                                   //  0x02AE8
	int var_02AEC;                                   //  0x02AEC
	int var_02AF0;                                   //  0x02AF0
	int var_02AF4;                                   //  0x02AF4
	int var_02AF8;                                   //  0x02AF8
	int var_02AFC;                                   //  0x02AFC
	int var_02B00;                                   //  0x02B00
	int var_02B04;                                   //  0x02B04
	int var_02B08;                                   //  0x02B08
	int var_02B0C;                                   //  0x02B0C
	int var_02B10;                                   //  0x02B10
	int var_02B14;                                   //  0x02B14
	int var_02B18;                                   //  0x02B18
	int var_02B1C;                                   //  0x02B1C
	int var_02B20;                                   //  0x02B20
	int var_02B24;                                   //  0x02B24
	int var_02B28;                                   //  0x02B28
	int var_02B2C;                                   //  0x02B2C
	int var_02B30;                                   //  0x02B30
	int var_02B34;                                   //  0x02B34
	int var_02B38;                                   //  0x02B38
	int var_02B3C;                                   //  0x02B3C
	int var_02B40;                                   //  0x02B40
	int var_02B44;                                   //  0x02B44
	int var_02B48;                                   //  0x02B48
	int var_02B4C;                                   //  0x02B4C
	int var_02B50;                                   //  0x02B50
	int var_02B54;                                   //  0x02B54
	int var_02B58;                                   //  0x02B58
	int var_02B5C;                                   //  0x02B5C
	int var_02B60;                                   //  0x02B60
	int var_02B64;                                   //  0x02B64
	int var_02B68;                                   //  0x02B68
	int var_02B6C;                                   //  0x02B6C
	int var_02B70;                                   //  0x02B70
	int var_02B74;                                   //  0x02B74
	int var_02B78;                                   //  0x02B78
	int var_02B7C;                                   //  0x02B7C
	int var_02B80;                                   //  0x02B80
	int var_02B84;                                   //  0x02B84
	int var_02B88;                                   //  0x02B88
	int var_02B8C;                                   //  0x02B8C
	int var_02B90;                                   //  0x02B90
	int var_02B94;                                   //  0x02B94
	int var_02B98;                                   //  0x02B98
	int var_02B9C;                                   //  0x02B9C
	int var_02BA0;                                   //  0x02BA0
	int var_02BA4;                                   //  0x02BA4
	int var_02BA8;                                   //  0x02BA8
	int var_02BAC;                                   //  0x02BAC
	int var_02BB0;                                   //  0x02BB0
	int var_02BB4;                                   //  0x02BB4
	int var_02BB8;                                   //  0x02BB8
	int var_02BBC;                                   //  0x02BBC
	int var_02BC0;                                   //  0x02BC0
	int var_02BC4;                                   //  0x02BC4
	int var_02BC8;                                   //  0x02BC8
	int var_02BCC;                                   //  0x02BCC
	int var_02BD0;                                   //  0x02BD0
	int var_02BD4;                                   //  0x02BD4
	int var_02BD8;                                   //  0x02BD8
	int var_02BDC;                                   //  0x02BDC
	int var_02BE0;                                   //  0x02BE0
	int var_02BE4;                                   //  0x02BE4
	int var_02BE8;                                   //  0x02BE8
	int var_02BEC;                                   //  0x02BEC
	int var_02BF0;                                   //  0x02BF0
	int var_02BF4;                                   //  0x02BF4
	int var_02BF8;                                   //  0x02BF8
	int var_02BFC;                                   //  0x02BFC
	int var_02C00;                                   //  0x02C00
	int var_02C04;                                   //  0x02C04
	int var_02C08;                                   //  0x02C08
	int var_02C0C;                                   //  0x02C0C
	int var_02C10;                                   //  0x02C10
	int var_02C14;                                   //  0x02C14
	int var_02C18;                                   //  0x02C18
	int var_02C1C;                                   //  0x02C1C
	int var_02C20;                                   //  0x02C20
	int var_02C24;                                   //  0x02C24
	int var_02C28;                                   //  0x02C28
	int var_02C2C;                                   //  0x02C2C
	int var_02C30;                                   //  0x02C30
	int var_02C34;                                   //  0x02C34
	int var_02C38;                                   //  0x02C38
	int var_02C3C;                                   //  0x02C3C
	int var_02C40;                                   //  0x02C40
	int var_02C44;                                   //  0x02C44
	int var_02C48;                                   //  0x02C48
	int var_02C4C;                                   //  0x02C4C
	int var_02C50;                                   //  0x02C50
	int var_02C54;                                   //  0x02C54
	int var_02C58;                                   //  0x02C58
	int var_02C5C;                                   //  0x02C5C
	int var_02C60;                                   //  0x02C60
	int var_02C64;                                   //  0x02C64
	int var_02C68;                                   //  0x02C68
	int var_02C6C;                                   //  0x02C6C
	int var_02C70;                                   //  0x02C70
	int var_02C74;                                   //  0x02C74
	int var_02C78;                                   //  0x02C78
	int var_02C7C;                                   //  0x02C7C
	int var_02C80;                                   //  0x02C80
	int var_02C84;                                   //  0x02C84
	int var_02C88;                                   //  0x02C88
	int var_02C8C;                                   //  0x02C8C
	int var_02C90;                                   //  0x02C90
	int var_02C94;                                   //  0x02C94
	int var_02C98;                                   //  0x02C98
	int var_02C9C;                                   //  0x02C9C
	int var_02CA0;                                   //  0x02CA0
	int var_02CA4;                                   //  0x02CA4
	int var_02CA8;                                   //  0x02CA8
	int var_02CAC;                                   //  0x02CAC
	int var_02CB0;                                   //  0x02CB0
	int var_02CB4;                                   //  0x02CB4
	int var_02CB8;                                   //  0x02CB8
	int var_02CBC;                                   //  0x02CBC
	int var_02CC0;                                   //  0x02CC0
	int var_02CC4;                                   //  0x02CC4
	int var_02CC8;                                   //  0x02CC8
	int var_02CCC;                                   //  0x02CCC
	int var_02CD0;                                   //  0x02CD0
	int var_02CD4;                                   //  0x02CD4
	int var_02CD8;                                   //  0x02CD8
	int var_02CDC;                                   //  0x02CDC
	int var_02CE0;                                   //  0x02CE0
	int var_02CE4;                                   //  0x02CE4
	int var_02CE8;                                   //  0x02CE8
	int var_02CEC;                                   //  0x02CEC
	int var_02CF0;                                   //  0x02CF0
	int var_02CF4;                                   //  0x02CF4
	int var_02CF8;                                   //  0x02CF8
	int var_02CFC;                                   //  0x02CFC
	int var_02D00;                                   //  0x02D00
	int var_02D04;                                   //  0x02D04
	int var_02D08;                                   //  0x02D08
	int var_02D0C;                                   //  0x02D0C
	int var_02D10;                                   //  0x02D10
	int var_02D14;                                   //  0x02D14
	int var_02D18;                                   //  0x02D18
	int var_02D1C;                                   //  0x02D1C
	int var_02D20;                                   //  0x02D20
	int var_02D24;                                   //  0x02D24
	int var_02D28;                                   //  0x02D28
	int var_02D2C;                                   //  0x02D2C
	int var_02D30;                                   //  0x02D30
	int var_02D34;                                   //  0x02D34
	int var_02D38;                                   //  0x02D38
	int var_02D3C;                                   //  0x02D3C
	int var_02D40;                                   //  0x02D40
	int var_02D44;                                   //  0x02D44
	int var_02D48;                                   //  0x02D48
	int var_02D4C;                                   //  0x02D4C
	int var_02D50;                                   //  0x02D50
	int var_02D54;                                   //  0x02D54
	int var_02D58;                                   //  0x02D58
	int var_02D5C;                                   //  0x02D5C
	int var_02D60;                                   //  0x02D60
	int var_02D64;                                   //  0x02D64
	int var_02D68;                                   //  0x02D68
	int var_02D6C;                                   //  0x02D6C
	int var_02D70;                                   //  0x02D70
	int var_02D74;                                   //  0x02D74
	int var_02D78;                                   //  0x02D78
	int var_02D7C;                                   //  0x02D7C
	int var_02D80;                                   //  0x02D80
	int var_02D84;                                   //  0x02D84
	int var_02D88;                                   //  0x02D88
	int var_02D8C;                                   //  0x02D8C
	int var_02D90;                                   //  0x02D90
	int var_02D94;                                   //  0x02D94
	int var_02D98;                                   //  0x02D98
	int var_02D9C;                                   //  0x02D9C
	int var_02DA0;                                   //  0x02DA0
	int var_02DA4;                                   //  0x02DA4
	int var_02DA8;                                   //  0x02DA8
	int var_02DAC;                                   //  0x02DAC
	int var_02DB0;                                   //  0x02DB0
	int var_02DB4;                                   //  0x02DB4
	int var_02DB8;                                   //  0x02DB8
	int var_02DBC;                                   //  0x02DBC
	int var_02DC0;                                   //  0x02DC0
	int var_02DC4;                                   //  0x02DC4
	int var_02DC8;                                   //  0x02DC8
	int var_02DCC;                                   //  0x02DCC
	int var_02DD0;                                   //  0x02DD0
	int var_02DD4;                                   //  0x02DD4
	int var_02DD8;                                   //  0x02DD8
	int var_02DDC;                                   //  0x02DDC
	int var_02DE0;                                   //  0x02DE0
	int var_02DE4;                                   //  0x02DE4
	int var_02DE8;                                   //  0x02DE8
	int var_02DEC;                                   //  0x02DEC
	int var_02DF0;                                   //  0x02DF0
	int var_02DF4;                                   //  0x02DF4
	int var_02DF8;                                   //  0x02DF8
	int var_02DFC;                                   //  0x02DFC
	int var_02E00;                                   //  0x02E00
	int var_02E04;                                   //  0x02E04
	int var_02E08;                                   //  0x02E08
	int var_02E0C;                                   //  0x02E0C
	int var_02E10;                                   //  0x02E10
	int var_02E14;                                   //  0x02E14
	int var_02E18;                                   //  0x02E18
	int var_02E1C;                                   //  0x02E1C
	int var_02E20;                                   //  0x02E20
	int var_02E24;                                   //  0x02E24
	int var_02E28;                                   //  0x02E28
	int var_02E2C;                                   //  0x02E2C
	int var_02E30;                                   //  0x02E30
	int var_02E34;                                   //  0x02E34
	int var_02E38;                                   //  0x02E38
	int var_02E3C;                                   //  0x02E3C
	int var_02E40;                                   //  0x02E40
	int var_02E44;                                   //  0x02E44
	int var_02E48;                                   //  0x02E48
	int var_02E4C;                                   //  0x02E4C
	int var_02E50;                                   //  0x02E50
	int var_02E54;                                   //  0x02E54
	int var_02E58;                                   //  0x02E58
	int var_02E5C;                                   //  0x02E5C
	int var_02E60;                                   //  0x02E60
	int var_02E64;                                   //  0x02E64
	int var_02E68;                                   //  0x02E68
	int var_02E6C;                                   //  0x02E6C
	int var_02E70;                                   //  0x02E70
	int var_02E74;                                   //  0x02E74
	int var_02E78;                                   //  0x02E78
	int var_02E7C;                                   //  0x02E7C
	int var_02E80;                                   //  0x02E80
	int var_02E84;                                   //  0x02E84
	int var_02E88;                                   //  0x02E88
	int var_02E8C;                                   //  0x02E8C
	int var_02E90;                                   //  0x02E90
	int var_02E94;                                   //  0x02E94
	int var_02E98;                                   //  0x02E98
	int var_02E9C;                                   //  0x02E9C
	int var_02EA0;                                   //  0x02EA0
	int var_02EA4;                                   //  0x02EA4
	int var_02EA8;                                   //  0x02EA8
	int var_02EAC;                                   //  0x02EAC
	int var_02EB0;                                   //  0x02EB0
	int var_02EB4;                                   //  0x02EB4
	int var_02EB8;                                   //  0x02EB8
	int var_02EBC;                                   //  0x02EBC
	int var_02EC0;                                   //  0x02EC0
	int var_02EC4;                                   //  0x02EC4
	int var_02EC8;                                   //  0x02EC8
	int var_02ECC;                                   //  0x02ECC
	int var_02ED0;                                   //  0x02ED0
	int var_02ED4;                                   //  0x02ED4
	int var_02ED8;                                   //  0x02ED8
	int var_02EDC;                                   //  0x02EDC
	int var_02EE0;                                   //  0x02EE0
	int var_02EE4;                                   //  0x02EE4
	int var_02EE8;                                   //  0x02EE8
	int var_02EEC;                                   //  0x02EEC
	int var_02EF0;                                   //  0x02EF0
	int var_02EF4;                                   //  0x02EF4
	int var_02EF8;                                   //  0x02EF8
	int var_02EFC;                                   //  0x02EFC
	int var_02F00;                                   //  0x02F00
	int var_02F04;                                   //  0x02F04
	int var_02F08;                                   //  0x02F08
	int var_02F0C;                                   //  0x02F0C
	int var_02F10;                                   //  0x02F10
	int var_02F14;                                   //  0x02F14
	int var_02F18;                                   //  0x02F18
	int var_02F1C;                                   //  0x02F1C
	int var_02F20;                                   //  0x02F20
	int var_02F24;                                   //  0x02F24
	int var_02F28;                                   //  0x02F28
	int var_02F2C;                                   //  0x02F2C
	int var_02F30;                                   //  0x02F30
	int var_02F34;                                   //  0x02F34
	int var_02F38;                                   //  0x02F38
	int var_02F3C;                                   //  0x02F3C
	int var_02F40;                                   //  0x02F40
	int var_02F44;                                   //  0x02F44
	int var_02F48;                                   //  0x02F48
	int var_02F4C;                                   //  0x02F4C
	int var_02F50;                                   //  0x02F50
	int var_02F54;                                   //  0x02F54
	int var_02F58;                                   //  0x02F58
	int var_02F5C;                                   //  0x02F5C
	int var_02F60;                                   //  0x02F60
	int var_02F64;                                   //  0x02F64
	int var_02F68;                                   //  0x02F68
	int var_02F6C;                                   //  0x02F6C
	int var_02F70;                                   //  0x02F70
	int var_02F74;                                   //  0x02F74
	int var_02F78;                                   //  0x02F78
	int var_02F7C;                                   //  0x02F7C
	int var_02F80;                                   //  0x02F80
	int var_02F84;                                   //  0x02F84
	int var_02F88;                                   //  0x02F88
	int var_02F8C;                                   //  0x02F8C
	int var_02F90;                                   //  0x02F90
	int var_02F94;                                   //  0x02F94
	int var_02F98;                                   //  0x02F98
	int var_02F9C;                                   //  0x02F9C
	int var_02FA0;                                   //  0x02FA0
	int var_02FA4;                                   //  0x02FA4
	int var_02FA8;                                   //  0x02FA8
	int var_02FAC;                                   //  0x02FAC
	int var_02FB0;                                   //  0x02FB0
	int var_02FB4;                                   //  0x02FB4
	int var_02FB8;                                   //  0x02FB8
	int var_02FBC;                                   //  0x02FBC
	int var_02FC0;                                   //  0x02FC0
	int var_02FC4;                                   //  0x02FC4
	int var_02FC8;                                   //  0x02FC8
	int var_02FCC;                                   //  0x02FCC
	int var_02FD0;                                   //  0x02FD0
	int var_02FD4;                                   //  0x02FD4
	int var_02FD8;                                   //  0x02FD8
	int var_02FDC;                                   //  0x02FDC
	int var_02FE0;                                   //  0x02FE0
	int var_02FE4;                                   //  0x02FE4
	int var_02FE8;                                   //  0x02FE8
	int var_02FEC;                                   //  0x02FEC
	int var_02FF0;                                   //  0x02FF0
	int var_02FF4;                                   //  0x02FF4
	int var_02FF8;                                   //  0x02FF8
	int var_02FFC;                                   //  0x02FFC
	int var_03000;                                   //  0x03000
	int var_03004;                                   //  0x03004
	int var_03008;                                   //  0x03008
	int var_0300C;                                   //  0x0300C
	int var_03010;                                   //  0x03010
	int var_03014;                                   //  0x03014
	int var_03018;                                   //  0x03018
	int var_0301C;                                   //  0x0301C
	int var_03020;                                   //  0x03020
	int var_03024;                                   //  0x03024
	int var_03028;                                   //  0x03028
	int var_0302C;                                   //  0x0302C
	int var_03030;                                   //  0x03030
	int var_03034;                                   //  0x03034
	int var_03038;                                   //  0x03038
	int var_0303C;                                   //  0x0303C
	int var_03040;                                   //  0x03040
	int var_03044;                                   //  0x03044
	int var_03048;                                   //  0x03048
	int var_0304C;                                   //  0x0304C
	int var_03050;                                   //  0x03050
	int var_03054;                                   //  0x03054
	int var_03058;                                   //  0x03058
	int var_0305C;                                   //  0x0305C
	int var_03060;                                   //  0x03060
	int var_03064;                                   //  0x03064
	int var_03068;                                   //  0x03068
	int var_0306C;                                   //  0x0306C
	int var_03070;                                   //  0x03070
	int var_03074;                                   //  0x03074
	int var_03078;                                   //  0x03078
	int var_0307C;                                   //  0x0307C
	int var_03080;                                   //  0x03080
	int var_03084;                                   //  0x03084
	int var_03088;                                   //  0x03088
	int var_0308C;                                   //  0x0308C
	int var_03090;                                   //  0x03090
	int var_03094;                                   //  0x03094
	int var_03098;                                   //  0x03098
	int var_0309C;                                   //  0x0309C
	int var_030A0;                                   //  0x030A0
	int var_030A4;                                   //  0x030A4
	int var_030A8;                                   //  0x030A8
	int var_030AC;                                   //  0x030AC
	int var_030B0;                                   //  0x030B0
	int var_030B4;                                   //  0x030B4
	int var_030B8;                                   //  0x030B8
	int var_030BC;                                   //  0x030BC
	int var_030C0;                                   //  0x030C0
	int var_030C4;                                   //  0x030C4
	int var_030C8;                                   //  0x030C8
	int var_030CC;                                   //  0x030CC
	int var_030D0;                                   //  0x030D0
	int var_030D4;                                   //  0x030D4
	int var_030D8;                                   //  0x030D8
	int var_030DC;                                   //  0x030DC
	int var_030E0;                                   //  0x030E0
	int var_030E4;                                   //  0x030E4
	int var_030E8;                                   //  0x030E8
	int var_030EC;                                   //  0x030EC
	int var_030F0;                                   //  0x030F0
	int var_030F4;                                   //  0x030F4
	int var_030F8;                                   //  0x030F8
	int var_030FC;                                   //  0x030FC
	int var_03100;                                   //  0x03100
	int var_03104;                                   //  0x03104
	int var_03108;                                   //  0x03108
	int var_0310C;                                   //  0x0310C
	int var_03110;                                   //  0x03110
	int var_03114;                                   //  0x03114
	int var_03118;                                   //  0x03118
	int var_0311C;                                   //  0x0311C
	int var_03120;                                   //  0x03120
	int var_03124;                                   //  0x03124
	int var_03128;                                   //  0x03128
	int var_0312C;                                   //  0x0312C
	int var_03130;                                   //  0x03130
	int var_03134;                                   //  0x03134
	int var_03138;                                   //  0x03138
	int var_0313C;                                   //  0x0313C
	int var_03140;                                   //  0x03140
	int var_03144;                                   //  0x03144
	int var_03148;                                   //  0x03148
	int var_0314C;                                   //  0x0314C
	int var_03150;                                   //  0x03150
	int var_03154;                                   //  0x03154
	int var_03158;                                   //  0x03158
	int var_0315C;                                   //  0x0315C
	int var_03160;                                   //  0x03160
	int var_03164;                                   //  0x03164
	int var_03168;                                   //  0x03168
	int var_0316C;                                   //  0x0316C
	int var_03170;                                   //  0x03170
	int var_03174;                                   //  0x03174
	int var_03178;                                   //  0x03178
	int var_0317C;                                   //  0x0317C
	int var_03180;                                   //  0x03180
	int var_03184;                                   //  0x03184
	int var_03188;                                   //  0x03188
	int var_0318C;                                   //  0x0318C
	int var_03190;                                   //  0x03190
	int var_03194;                                   //  0x03194
	int var_03198;                                   //  0x03198
	int var_0319C;                                   //  0x0319C
	int var_031A0;                                   //  0x031A0
	int var_031A4;                                   //  0x031A4
	int var_031A8;                                   //  0x031A8
	int var_031AC;                                   //  0x031AC
	int var_031B0;                                   //  0x031B0
	int var_031B4;                                   //  0x031B4
	int var_031B8;                                   //  0x031B8
	int var_031BC;                                   //  0x031BC
	int var_031C0;                                   //  0x031C0
	int var_031C4;                                   //  0x031C4
	int var_031C8;                                   //  0x031C8
	int var_031CC;                                   //  0x031CC
	int var_031D0;                                   //  0x031D0
	int var_031D4;                                   //  0x031D4
	int var_031D8;                                   //  0x031D8
	int var_031DC;                                   //  0x031DC
	int var_031E0;                                   //  0x031E0
	int var_031E4;                                   //  0x031E4
	int var_031E8;                                   //  0x031E8
	int var_031EC;                                   //  0x031EC
	int var_031F0;                                   //  0x031F0
	int var_031F4;                                   //  0x031F4
	int var_031F8;                                   //  0x031F8
	int var_031FC;                                   //  0x031FC
	int var_03200;                                   //  0x03200
	int var_03204;                                   //  0x03204
	int var_03208;                                   //  0x03208
	int var_0320C;                                   //  0x0320C
	int var_03210;                                   //  0x03210
	int var_03214;                                   //  0x03214
	int var_03218;                                   //  0x03218
	int var_0321C;                                   //  0x0321C
	int var_03220;                                   //  0x03220
	int var_03224;                                   //  0x03224
	int var_03228;                                   //  0x03228
	int var_0322C;                                   //  0x0322C
	int var_03230;                                   //  0x03230
	int var_03234;                                   //  0x03234
	int var_03238;                                   //  0x03238
	int var_0323C;                                   //  0x0323C
	int var_03240;                                   //  0x03240
	int var_03244;                                   //  0x03244
	int var_03248;                                   //  0x03248
	int var_0324C;                                   //  0x0324C
	int var_03250;                                   //  0x03250
	int var_03254;                                   //  0x03254
	int var_03258;                                   //  0x03258
	int var_0325C;                                   //  0x0325C
	int var_03260;                                   //  0x03260
	int var_03264;                                   //  0x03264
	int var_03268;                                   //  0x03268
	int var_0326C;                                   //  0x0326C
	int var_03270;                                   //  0x03270
	int var_03274;                                   //  0x03274
	int var_03278;                                   //  0x03278
	int var_0327C;                                   //  0x0327C
	int var_03280;                                   //  0x03280
	int var_03284;                                   //  0x03284
	int var_03288;                                   //  0x03288
	int var_0328C;                                   //  0x0328C
	int var_03290;                                   //  0x03290
	int var_03294;                                   //  0x03294
	int var_03298;                                   //  0x03298
	int var_0329C;                                   //  0x0329C
	int var_032A0;                                   //  0x032A0
	int var_032A4;                                   //  0x032A4
	int var_032A8;                                   //  0x032A8
	int var_032AC;                                   //  0x032AC
	int var_032B0;                                   //  0x032B0
	int var_032B4;                                   //  0x032B4
	int var_032B8;                                   //  0x032B8
	int var_032BC;                                   //  0x032BC
	int var_032C0;                                   //  0x032C0
	int var_032C4;                                   //  0x032C4
	int var_032C8;                                   //  0x032C8
	int var_032CC;                                   //  0x032CC
	int var_032D0;                                   //  0x032D0
	int var_032D4;                                   //  0x032D4
	int var_032D8;                                   //  0x032D8
	int var_032DC;                                   //  0x032DC
	int var_032E0;                                   //  0x032E0
	int var_032E4;                                   //  0x032E4
	int var_032E8;                                   //  0x032E8
	int var_032EC;                                   //  0x032EC
	int var_032F0;                                   //  0x032F0
	int var_032F4;                                   //  0x032F4
	int var_032F8;                                   //  0x032F8
	int var_032FC;                                   //  0x032FC
	int var_03300;                                   //  0x03300
	int var_03304;                                   //  0x03304
	int var_03308;                                   //  0x03308
	int var_0330C;                                   //  0x0330C
	int var_03310;                                   //  0x03310
	int var_03314;                                   //  0x03314
	int var_03318;                                   //  0x03318
	int var_0331C;                                   //  0x0331C
	int var_03320;                                   //  0x03320
	int var_03324;                                   //  0x03324
	int var_03328;                                   //  0x03328
	int var_0332C;                                   //  0x0332C
	int var_03330;                                   //  0x03330
	int var_03334;                                   //  0x03334
	int var_03338;                                   //  0x03338
	int var_0333C;                                   //  0x0333C
	int var_03340;                                   //  0x03340
	int var_03344;                                   //  0x03344
	int var_03348;                                   //  0x03348
	int var_0334C;                                   //  0x0334C
	int var_03350;                                   //  0x03350
	int var_03354;                                   //  0x03354
	int var_03358;                                   //  0x03358
	int var_0335C;                                   //  0x0335C
	int var_03360;                                   //  0x03360
	int var_03364;                                   //  0x03364
	int var_03368;                                   //  0x03368
	int var_0336C;                                   //  0x0336C
	int var_03370;                                   //  0x03370
	int var_03374;                                   //  0x03374
	int var_03378;                                   //  0x03378
	int var_0337C;                                   //  0x0337C
	int var_03380;                                   //  0x03380
	int var_03384;                                   //  0x03384
	int var_03388;                                   //  0x03388
	int var_0338C;                                   //  0x0338C
	int var_03390;                                   //  0x03390
	int var_03394;                                   //  0x03394
	int var_03398;                                   //  0x03398
	int var_0339C;                                   //  0x0339C
	int var_033A0;                                   //  0x033A0
	int var_033A4;                                   //  0x033A4
	int var_033A8;                                   //  0x033A8
	int var_033AC;                                   //  0x033AC
	int var_033B0;                                   //  0x033B0
	int var_033B4;                                   //  0x033B4
	int var_033B8;                                   //  0x033B8
	int var_033BC;                                   //  0x033BC
	int var_033C0;                                   //  0x033C0
	int var_033C4;                                   //  0x033C4
	int var_033C8;                                   //  0x033C8
	int var_033CC;                                   //  0x033CC
	int var_033D0;                                   //  0x033D0
	int var_033D4;                                   //  0x033D4
	int var_033D8;                                   //  0x033D8
	int var_033DC;                                   //  0x033DC
	int var_033E0;                                   //  0x033E0
	int var_033E4;                                   //  0x033E4
	int var_033E8;                                   //  0x033E8
	int var_033EC;                                   //  0x033EC
	int var_033F0;                                   //  0x033F0
	int var_033F4;                                   //  0x033F4
	int var_033F8;                                   //  0x033F8
	int var_033FC;                                   //  0x033FC
	int var_03400;                                   //  0x03400
	int var_03404;                                   //  0x03404
	int var_03408;                                   //  0x03408
	int var_0340C;                                   //  0x0340C
	int var_03410;                                   //  0x03410
	int var_03414;                                   //  0x03414
	int var_03418;                                   //  0x03418
	int var_0341C;                                   //  0x0341C
	int var_03420;                                   //  0x03420
	int var_03424;                                   //  0x03424
	int var_03428;                                   //  0x03428
	int var_0342C;                                   //  0x0342C
	int var_03430;                                   //  0x03430
	int var_03434;                                   //  0x03434
	int var_03438;                                   //  0x03438
	int var_0343C;                                   //  0x0343C
	int var_03440;                                   //  0x03440
	int var_03444;                                   //  0x03444
	int var_03448;                                   //  0x03448
	int var_0344C;                                   //  0x0344C
	int var_03450;                                   //  0x03450
	int var_03454;                                   //  0x03454
	int var_03458;                                   //  0x03458
	int var_0345C;                                   //  0x0345C
	int var_03460;                                   //  0x03460
	int var_03464;                                   //  0x03464
	int var_03468;                                   //  0x03468
	int var_0346C;                                   //  0x0346C
	int var_03470;                                   //  0x03470
	int var_03474;                                   //  0x03474
	int var_03478;                                   //  0x03478
	int var_0347C;                                   //  0x0347C
	int var_03480;                                   //  0x03480
	int var_03484;                                   //  0x03484
	int var_03488;                                   //  0x03488
	int var_0348C;                                   //  0x0348C
	int var_03490;                                   //  0x03490
	int var_03494;                                   //  0x03494
	int var_03498;                                   //  0x03498
	int var_0349C;                                   //  0x0349C
	int var_034A0;                                   //  0x034A0
	int var_034A4;                                   //  0x034A4
	int var_034A8;                                   //  0x034A8
	int var_034AC;                                   //  0x034AC
	int var_034B0;                                   //  0x034B0
	int var_034B4;                                   //  0x034B4
	int var_034B8;                                   //  0x034B8
	int var_034BC;                                   //  0x034BC
	int var_034C0;                                   //  0x034C0
	int var_034C4;                                   //  0x034C4
	int var_034C8;                                   //  0x034C8
	int var_034CC;                                   //  0x034CC
	int var_034D0;                                   //  0x034D0
	int var_034D4;                                   //  0x034D4
	int var_034D8;                                   //  0x034D8
	int var_034DC;                                   //  0x034DC
	int var_034E0;                                   //  0x034E0
	int var_034E4;                                   //  0x034E4
	int var_034E8;                                   //  0x034E8
	int var_034EC;                                   //  0x034EC
	int var_034F0;                                   //  0x034F0
	int var_034F4;                                   //  0x034F4
	int var_034F8;                                   //  0x034F8
	int var_034FC;                                   //  0x034FC
	int var_03500;                                   //  0x03500
	int var_03504;                                   //  0x03504
	int var_03508;                                   //  0x03508
	int var_0350C;                                   //  0x0350C
	int var_03510;                                   //  0x03510
	int var_03514;                                   //  0x03514
	int var_03518;                                   //  0x03518
	int var_0351C;                                   //  0x0351C
	int var_03520;                                   //  0x03520
	int var_03524;                                   //  0x03524
	int var_03528;                                   //  0x03528
	int var_0352C;                                   //  0x0352C
	int var_03530;                                   //  0x03530
	int var_03534;                                   //  0x03534
	int var_03538;                                   //  0x03538
	int var_0353C;                                   //  0x0353C
	int var_03540;                                   //  0x03540
	int var_03544;                                   //  0x03544
	int var_03548;                                   //  0x03548
	int var_0354C;                                   //  0x0354C
	int var_03550;                                   //  0x03550
	int var_03554;                                   //  0x03554
	int var_03558;                                   //  0x03558
	int var_0355C;                                   //  0x0355C
	int var_03560;                                   //  0x03560
	int var_03564;                                   //  0x03564
	int var_03568;                                   //  0x03568
	int var_0356C;                                   //  0x0356C
	int var_03570;                                   //  0x03570
	int var_03574;                                   //  0x03574
	int var_03578;                                   //  0x03578
	int var_0357C;                                   //  0x0357C
	int var_03580;                                   //  0x03580
	int var_03584;                                   //  0x03584
	int var_03588;                                   //  0x03588
	int var_0358C;                                   //  0x0358C
	int var_03590;                                   //  0x03590
	int var_03594;                                   //  0x03594
	int var_03598;                                   //  0x03598
	int var_0359C;                                   //  0x0359C
	int var_035A0;                                   //  0x035A0
	int var_035A4;                                   //  0x035A4
	int var_035A8;                                   //  0x035A8
	int var_035AC;                                   //  0x035AC
	int var_035B0;                                   //  0x035B0
	int var_035B4;                                   //  0x035B4
	int var_035B8;                                   //  0x035B8
	int var_035BC;                                   //  0x035BC
	int var_035C0;                                   //  0x035C0
	int var_035C4;                                   //  0x035C4
	int var_035C8;                                   //  0x035C8
	int var_035CC;                                   //  0x035CC
	int var_035D0;                                   //  0x035D0
	int var_035D4;                                   //  0x035D4
	int var_035D8;                                   //  0x035D8
	int var_035DC;                                   //  0x035DC
	int var_035E0;                                   //  0x035E0
	int var_035E4;                                   //  0x035E4
	int var_035E8;                                   //  0x035E8
	int var_035EC;                                   //  0x035EC
	int var_035F0;                                   //  0x035F0
	int var_035F4;                                   //  0x035F4
	int var_035F8;                                   //  0x035F8
	int var_035FC;                                   //  0x035FC
	int var_03600;                                   //  0x03600
	int var_03604;                                   //  0x03604
	int var_03608;                                   //  0x03608
	int var_0360C;                                   //  0x0360C
	int var_03610;                                   //  0x03610
	int var_03614;                                   //  0x03614
	int var_03618;                                   //  0x03618
	int var_0361C;                                   //  0x0361C
	int var_03620;                                   //  0x03620
	int var_03624;                                   //  0x03624
	int var_03628;                                   //  0x03628
	int var_0362C;                                   //  0x0362C
	int var_03630;                                   //  0x03630
	int var_03634;                                   //  0x03634
	int var_03638;                                   //  0x03638
	int var_0363C;                                   //  0x0363C
	int var_03640;                                   //  0x03640
	int var_03644;                                   //  0x03644
	int var_03648;                                   //  0x03648
	int var_0364C;                                   //  0x0364C
	int var_03650;                                   //  0x03650
	int var_03654;                                   //  0x03654
	int var_03658;                                   //  0x03658
	int var_0365C;                                   //  0x0365C
	int var_03660;                                   //  0x03660
	int var_03664;                                   //  0x03664
	int var_03668;                                   //  0x03668
	int var_0366C;                                   //  0x0366C
	int var_03670;                                   //  0x03670
	int var_03674;                                   //  0x03674
	int var_03678;                                   //  0x03678
	int var_0367C;                                   //  0x0367C
	int var_03680;                                   //  0x03680
	int var_03684;                                   //  0x03684
	int var_03688;                                   //  0x03688
	int var_0368C;                                   //  0x0368C
	int var_03690;                                   //  0x03690
	int var_03694;                                   //  0x03694
	int var_03698;                                   //  0x03698
	int var_0369C;                                   //  0x0369C
	int var_036A0;                                   //  0x036A0
	int var_036A4;                                   //  0x036A4
	int var_036A8;                                   //  0x036A8
	int var_036AC;                                   //  0x036AC
	int var_036B0;                                   //  0x036B0
	int var_036B4;                                   //  0x036B4
	int var_036B8;                                   //  0x036B8
	int var_036BC;                                   //  0x036BC
	int var_036C0;                                   //  0x036C0
	int var_036C4;                                   //  0x036C4
	int var_036C8;                                   //  0x036C8
	int var_036CC;                                   //  0x036CC
	int var_036D0;                                   //  0x036D0
	int var_036D4;                                   //  0x036D4
	int var_036D8;                                   //  0x036D8
	int var_036DC;                                   //  0x036DC
	int var_036E0;                                   //  0x036E0
	int var_036E4;                                   //  0x036E4
	int var_036E8;                                   //  0x036E8
	int var_036EC;                                   //  0x036EC
	int var_036F0;                                   //  0x036F0
	int var_036F4;                                   //  0x036F4
	int var_036F8;                                   //  0x036F8
	int var_036FC;                                   //  0x036FC
	int var_03700;                                   //  0x03700
	int var_03704;                                   //  0x03704
	int var_03708;                                   //  0x03708
	int var_0370C;                                   //  0x0370C
	int var_03710;                                   //  0x03710
	int var_03714;                                   //  0x03714
	int var_03718;                                   //  0x03718
	int var_0371C;                                   //  0x0371C
	int var_03720;                                   //  0x03720
	int var_03724;                                   //  0x03724
	int var_03728;                                   //  0x03728
	int var_0372C;                                   //  0x0372C
	int var_03730;                                   //  0x03730
	int var_03734;                                   //  0x03734
	int var_03738;                                   //  0x03738
	int var_0373C;                                   //  0x0373C
	int var_03740;                                   //  0x03740
	int var_03744;                                   //  0x03744
	int var_03748;                                   //  0x03748
	int var_0374C;                                   //  0x0374C
	int var_03750;                                   //  0x03750
	int var_03754;                                   //  0x03754
	int var_03758;                                   //  0x03758
	int var_0375C;                                   //  0x0375C
	int var_03760;                                   //  0x03760
	int var_03764;                                   //  0x03764
	int var_03768;                                   //  0x03768
	int var_0376C;                                   //  0x0376C
	int var_03770;                                   //  0x03770
	int var_03774;                                   //  0x03774
	int var_03778;                                   //  0x03778
	int var_0377C;                                   //  0x0377C
	int var_03780;                                   //  0x03780
	int var_03784;                                   //  0x03784
	int var_03788;                                   //  0x03788
	int var_0378C;                                   //  0x0378C
	int var_03790;                                   //  0x03790
	int var_03794;                                   //  0x03794
	int var_03798;                                   //  0x03798
	int var_0379C;                                   //  0x0379C
	int var_037A0;                                   //  0x037A0
	int var_037A4;                                   //  0x037A4
	int var_037A8;                                   //  0x037A8
	int var_037AC;                                   //  0x037AC
	int var_037B0;                                   //  0x037B0
	int var_037B4;                                   //  0x037B4
	int var_037B8;                                   //  0x037B8
	int var_037BC;                                   //  0x037BC
	int var_037C0;                                   //  0x037C0
	int var_037C4;                                   //  0x037C4
	int var_037C8;                                   //  0x037C8
	int var_037CC;                                   //  0x037CC
	int var_037D0;                                   //  0x037D0
	int var_037D4;                                   //  0x037D4
	int var_037D8;                                   //  0x037D8
	int var_037DC;                                   //  0x037DC
	int var_037E0;                                   //  0x037E0
	int var_037E4;                                   //  0x037E4
	int var_037E8;                                   //  0x037E8
	int var_037EC;                                   //  0x037EC
	int var_037F0;                                   //  0x037F0
	int var_037F4;                                   //  0x037F4
	int var_037F8;                                   //  0x037F8
	int var_037FC;                                   //  0x037FC
	int var_03800;                                   //  0x03800
	int var_03804;                                   //  0x03804
	int var_03808;                                   //  0x03808
	int var_0380C;                                   //  0x0380C
	int var_03810;                                   //  0x03810
	int var_03814;                                   //  0x03814
	int var_03818;                                   //  0x03818
	int var_0381C;                                   //  0x0381C
	int var_03820;                                   //  0x03820
	int var_03824;                                   //  0x03824
	int var_03828;                                   //  0x03828
	int var_0382C;                                   //  0x0382C
	int var_03830;                                   //  0x03830
	int var_03834;                                   //  0x03834
	int var_03838;                                   //  0x03838
	int var_0383C;                                   //  0x0383C
	int var_03840;                                   //  0x03840
	int var_03844;                                   //  0x03844
	int var_03848;                                   //  0x03848
	int var_0384C;                                   //  0x0384C
	int var_03850;                                   //  0x03850
	int var_03854;                                   //  0x03854
	int var_03858;                                   //  0x03858
	int var_0385C;                                   //  0x0385C
	int var_03860;                                   //  0x03860
	int var_03864;                                   //  0x03864
	int var_03868;                                   //  0x03868
	int var_0386C;                                   //  0x0386C
	int var_03870;                                   //  0x03870
	int var_03874;                                   //  0x03874
	int var_03878;                                   //  0x03878
	int var_0387C;                                   //  0x0387C
	int var_03880;                                   //  0x03880
	int var_03884;                                   //  0x03884
	int var_03888;                                   //  0x03888
	int var_0388C;                                   //  0x0388C
	int var_03890;                                   //  0x03890
	int var_03894;                                   //  0x03894
	int var_03898;                                   //  0x03898
	int var_0389C;                                   //  0x0389C
	int var_038A0;                                   //  0x038A0
	int var_038A4;                                   //  0x038A4
	int var_038A8;                                   //  0x038A8
	int var_038AC;                                   //  0x038AC
	int var_038B0;                                   //  0x038B0
	int var_038B4;                                   //  0x038B4
	int var_038B8;                                   //  0x038B8
	int var_038BC;                                   //  0x038BC
	int var_038C0;                                   //  0x038C0
	int var_038C4;                                   //  0x038C4
	int var_038C8;                                   //  0x038C8
	int var_038CC;                                   //  0x038CC
	int var_038D0;                                   //  0x038D0
	int var_038D4;                                   //  0x038D4
	int var_038D8;                                   //  0x038D8
	int var_038DC;                                   //  0x038DC
	int var_038E0;                                   //  0x038E0
	int var_038E4;                                   //  0x038E4
	int var_038E8;                                   //  0x038E8
	int var_038EC;                                   //  0x038EC
	int var_038F0;                                   //  0x038F0
	int var_038F4;                                   //  0x038F4
	int var_038F8;                                   //  0x038F8
	int var_038FC;                                   //  0x038FC
	int var_03900;                                   //  0x03900
	int var_03904;                                   //  0x03904
	int var_03908;                                   //  0x03908
	int var_0390C;                                   //  0x0390C
	int var_03910;                                   //  0x03910
	int var_03914;                                   //  0x03914
	int var_03918;                                   //  0x03918
	int var_0391C;                                   //  0x0391C
	int var_03920;                                   //  0x03920
	int var_03924;                                   //  0x03924
	int var_03928;                                   //  0x03928
	int var_0392C;                                   //  0x0392C
	int var_03930;                                   //  0x03930
	int var_03934;                                   //  0x03934
	int var_03938;                                   //  0x03938
	int var_0393C;                                   //  0x0393C
	int var_03940;                                   //  0x03940
	int var_03944;                                   //  0x03944
	int var_03948;                                   //  0x03948
	int var_0394C;                                   //  0x0394C
	int var_03950;                                   //  0x03950
	int var_03954;                                   //  0x03954
	int var_03958;                                   //  0x03958
	int var_0395C;                                   //  0x0395C
	int var_03960;                                   //  0x03960
	int var_03964;                                   //  0x03964
	int var_03968;                                   //  0x03968
	int var_0396C;                                   //  0x0396C
	int var_03970;                                   //  0x03970
	int var_03974;                                   //  0x03974
	int var_03978;                                   //  0x03978
	int var_0397C;                                   //  0x0397C
	int var_03980;                                   //  0x03980
	int var_03984;                                   //  0x03984
	int var_03988;                                   //  0x03988
	int var_0398C;                                   //  0x0398C
	int var_03990;                                   //  0x03990
	int var_03994;                                   //  0x03994
	int var_03998;                                   //  0x03998
	int var_0399C;                                   //  0x0399C
	int var_039A0;                                   //  0x039A0
	int var_039A4;                                   //  0x039A4
	int var_039A8;                                   //  0x039A8
	int var_039AC;                                   //  0x039AC
	int var_039B0;                                   //  0x039B0
	int var_039B4;                                   //  0x039B4
	int var_039B8;                                   //  0x039B8
	int var_039BC;                                   //  0x039BC
	int var_039C0;                                   //  0x039C0
	int var_039C4;                                   //  0x039C4
	int var_039C8;                                   //  0x039C8
	int var_039CC;                                   //  0x039CC
	int var_039D0;                                   //  0x039D0
	int var_039D4;                                   //  0x039D4
	int var_039D8;                                   //  0x039D8
	int var_039DC;                                   //  0x039DC
	int var_039E0;                                   //  0x039E0
	int var_039E4;                                   //  0x039E4
	int var_039E8;                                   //  0x039E8
	int var_039EC;                                   //  0x039EC
	int var_039F0;                                   //  0x039F0
	int var_039F4;                                   //  0x039F4
	int var_039F8;                                   //  0x039F8
	int var_039FC;                                   //  0x039FC
	int var_03A00;                                   //  0x03A00
	int var_03A04;                                   //  0x03A04
	int var_03A08;                                   //  0x03A08
	int var_03A0C;                                   //  0x03A0C
	int var_03A10;                                   //  0x03A10
	int var_03A14;                                   //  0x03A14
	int var_03A18;                                   //  0x03A18
	int var_03A1C;                                   //  0x03A1C
	int var_03A20;                                   //  0x03A20
	int var_03A24;                                   //  0x03A24
	int var_03A28;                                   //  0x03A28
	int var_03A2C;                                   //  0x03A2C
	int var_03A30;                                   //  0x03A30
	int var_03A34;                                   //  0x03A34
	int var_03A38;                                   //  0x03A38
	int var_03A3C;                                   //  0x03A3C
	int var_03A40;                                   //  0x03A40
	int var_03A44;                                   //  0x03A44
	int var_03A48;                                   //  0x03A48
	int var_03A4C;                                   //  0x03A4C
	int var_03A50;                                   //  0x03A50
	int var_03A54;                                   //  0x03A54
	int var_03A58;                                   //  0x03A58
	int var_03A5C;                                   //  0x03A5C
	int var_03A60;                                   //  0x03A60
	int var_03A64;                                   //  0x03A64
	int var_03A68;                                   //  0x03A68
	int var_03A6C;                                   //  0x03A6C
	int var_03A70;                                   //  0x03A70
	int var_03A74;                                   //  0x03A74
	int var_03A78;                                   //  0x03A78
	int var_03A7C;                                   //  0x03A7C
	int var_03A80;                                   //  0x03A80
	int var_03A84;                                   //  0x03A84
	int var_03A88;                                   //  0x03A88
	int var_03A8C;                                   //  0x03A8C
	int var_03A90;                                   //  0x03A90
	int var_03A94;                                   //  0x03A94
	int var_03A98;                                   //  0x03A98
	int var_03A9C;                                   //  0x03A9C
	int var_03AA0;                                   //  0x03AA0
	int var_03AA4;                                   //  0x03AA4
	int var_03AA8;                                   //  0x03AA8
	int var_03AAC;                                   //  0x03AAC
	int var_03AB0;                                   //  0x03AB0
	int var_03AB4;                                   //  0x03AB4
	int var_03AB8;                                   //  0x03AB8
	int var_03ABC;                                   //  0x03ABC
	int var_03AC0;                                   //  0x03AC0
	int var_03AC4;                                   //  0x03AC4
	int var_03AC8;                                   //  0x03AC8
	int var_03ACC;                                   //  0x03ACC
	int var_03AD0;                                   //  0x03AD0
	int var_03AD4;                                   //  0x03AD4
	int var_03AD8;                                   //  0x03AD8
	int var_03ADC;                                   //  0x03ADC
	int var_03AE0;                                   //  0x03AE0
	int var_03AE4;                                   //  0x03AE4
	int var_03AE8;                                   //  0x03AE8
	int var_03AEC;                                   //  0x03AEC
	int var_03AF0;                                   //  0x03AF0
	int var_03AF4;                                   //  0x03AF4
	int var_03AF8;                                   //  0x03AF8
	int var_03AFC;                                   //  0x03AFC
	int var_03B00;                                   //  0x03B00
	int var_03B04;                                   //  0x03B04
	int var_03B08;                                   //  0x03B08
	int var_03B0C;                                   //  0x03B0C
	int var_03B10;                                   //  0x03B10
	int var_03B14;                                   //  0x03B14
	int var_03B18;                                   //  0x03B18
	int var_03B1C;                                   //  0x03B1C
	int var_03B20;                                   //  0x03B20
	int var_03B24;                                   //  0x03B24
	int var_03B28;                                   //  0x03B28
	int var_03B2C;                                   //  0x03B2C
	int var_03B30;                                   //  0x03B30
	int var_03B34;                                   //  0x03B34
	int var_03B38;                                   //  0x03B38
	int var_03B3C;                                   //  0x03B3C
	int var_03B40;                                   //  0x03B40
	int var_03B44;                                   //  0x03B44
	int var_03B48;                                   //  0x03B48
	int var_03B4C;                                   //  0x03B4C
	int var_03B50;                                   //  0x03B50
	int var_03B54;                                   //  0x03B54
	int var_03B58;                                   //  0x03B58
	int var_03B5C;                                   //  0x03B5C
	int var_03B60;                                   //  0x03B60
	int var_03B64;                                   //  0x03B64
	int var_03B68;                                   //  0x03B68
	int var_03B6C;                                   //  0x03B6C
	int var_03B70;                                   //  0x03B70
	int var_03B74;                                   //  0x03B74
	int var_03B78;                                   //  0x03B78
	int var_03B7C;                                   //  0x03B7C
	int var_03B80;                                   //  0x03B80
	int var_03B84;                                   //  0x03B84
	int var_03B88;                                   //  0x03B88
	int var_03B8C;                                   //  0x03B8C
	int var_03B90;                                   //  0x03B90
	int var_03B94;                                   //  0x03B94
	int var_03B98;                                   //  0x03B98
	int var_03B9C;                                   //  0x03B9C
	int var_03BA0;                                   //  0x03BA0
	int var_03BA4;                                   //  0x03BA4
	int var_03BA8;                                   //  0x03BA8
	int var_03BAC;                                   //  0x03BAC
	int var_03BB0;                                   //  0x03BB0
	int var_03BB4;                                   //  0x03BB4
	int var_03BB8;                                   //  0x03BB8
	int var_03BBC;                                   //  0x03BBC
	int var_03BC0;                                   //  0x03BC0
	int var_03BC4;                                   //  0x03BC4
	int var_03BC8;                                   //  0x03BC8
	int var_03BCC;                                   //  0x03BCC
	int var_03BD0;                                   //  0x03BD0
	int var_03BD4;                                   //  0x03BD4
	int var_03BD8;                                   //  0x03BD8
	int var_03BDC;                                   //  0x03BDC
	int var_03BE0;                                   //  0x03BE0
	int var_03BE4;                                   //  0x03BE4
	int var_03BE8;                                   //  0x03BE8
	int var_03BEC;                                   //  0x03BEC
	int var_03BF0;                                   //  0x03BF0
	int var_03BF4;                                   //  0x03BF4
	int var_03BF8;                                   //  0x03BF8
	int var_03BFC;                                   //  0x03BFC
	int var_03C00;                                   //  0x03C00
	int var_03C04;                                   //  0x03C04
	int var_03C08;                                   //  0x03C08
	int var_03C0C;                                   //  0x03C0C
	int var_03C10;                                   //  0x03C10
	int var_03C14;                                   //  0x03C14
	int var_03C18;                                   //  0x03C18
	int var_03C1C;                                   //  0x03C1C
	int var_03C20;                                   //  0x03C20
	int var_03C24;                                   //  0x03C24
	int var_03C28;                                   //  0x03C28
	int var_03C2C;                                   //  0x03C2C
	int var_03C30;                                   //  0x03C30
	int var_03C34;                                   //  0x03C34
	int var_03C38;                                   //  0x03C38
	int var_03C3C;                                   //  0x03C3C
	int var_03C40;                                   //  0x03C40
	int var_03C44;                                   //  0x03C44
	int var_03C48;                                   //  0x03C48
	int var_03C4C;                                   //  0x03C4C
	int var_03C50;                                   //  0x03C50
	int var_03C54;                                   //  0x03C54
	int var_03C58;                                   //  0x03C58
	int var_03C5C;                                   //  0x03C5C
	int var_03C60;                                   //  0x03C60
	int var_03C64;                                   //  0x03C64
	int var_03C68;                                   //  0x03C68
	int var_03C6C;                                   //  0x03C6C
	int var_03C70;                                   //  0x03C70
	int var_03C74;                                   //  0x03C74
	int var_03C78;                                   //  0x03C78
	int var_03C7C;                                   //  0x03C7C
	int var_03C80;                                   //  0x03C80
	int var_03C84;                                   //  0x03C84
	int var_03C88;                                   //  0x03C88
	int var_03C8C;                                   //  0x03C8C
	int var_03C90;                                   //  0x03C90
	int var_03C94;                                   //  0x03C94
	int var_03C98;                                   //  0x03C98
	int var_03C9C;                                   //  0x03C9C
	int var_03CA0;                                   //  0x03CA0
	int var_03CA4;                                   //  0x03CA4
	int var_03CA8;                                   //  0x03CA8
	int var_03CAC;                                   //  0x03CAC
	int var_03CB0;                                   //  0x03CB0
	int var_03CB4;                                   //  0x03CB4
	int var_03CB8;                                   //  0x03CB8
	int var_03CBC;                                   //  0x03CBC
	int var_03CC0;                                   //  0x03CC0
	int var_03CC4;                                   //  0x03CC4
	int var_03CC8;                                   //  0x03CC8
	int var_03CCC;                                   //  0x03CCC
	int var_03CD0;                                   //  0x03CD0
	int var_03CD4;                                   //  0x03CD4
	int var_03CD8;                                   //  0x03CD8
	int var_03CDC;                                   //  0x03CDC
	int var_03CE0;                                   //  0x03CE0
	int var_03CE4;                                   //  0x03CE4
	int var_03CE8;                                   //  0x03CE8
